<?php 
// добавление видов работ до 13.05.2017 в переменные//
$type163="1. Инженерные изыскания для объектов строительства первого-четвертого классов сложности";
$type164="1.1. работы в составе инженерно-геодезических изысканий";
$type165="1.2. работы в составе инженерно-геологических изысканий";
$type166="1.3. работы в составе инженерно-гидрометеорологических изысканий";
$type167="1.4. работы в составе инженерно-экологических изысканий";
$type168="1.5. работы в составе инженерно-геотехнических изысканий";
$type169="1.6. обследование состояния грунтов оснований зданий и сооружений";
$type170="2. Разработка предпроектной (предынвестиционной) документации";
$type171="3. Выполнение функций генерального проектировщика";
$type196="4. Разработка разделов проектной документации для объектов строительства первого-четвертого классов сложности";
$type197="4.1. генеральный план и транспорт";
$type198="4.2. архитектурные решения";
$type199="4.3. сметная документация";
$type200="4.4. строительные решения";
$type543="4.5. внутреннее инженерное оборудование, внутренние сети и системы:";
$type5434="теплоснабжения";
$type5435="холодоснабжения";
$type5436="водоснабжения";
$type5437="газоснабжения";
$type5438="канализации";
$type5439="отопления";
$type5440="вентиляции и кондиционирования воздуха";
$type5441="электроснабжения";
$type5442="электрооборудования";
$type5443="электроосвещения";
$type5444="связи";
$type5453="радиофикации";
$type5454="телевидения";
$type5445="4.6. наружные сети и системы:";
$type5446="теплоснабжения";
$type5447="водоснабжения";
$type5448="газоснабжения";
$type5449="канализации";
$type5450="электроснабжения";
$type5451="связи";
$type5455="радиофикации";
$type5456="телевидения";
$type202="4.7. технологические решения";
$type5457="4.8.:";
$type5458="охрана окружающей среды";
$type5459="инженерно-технические мероприятия гражданской обороны";
$type5460="мероприятия по предупреждению чрезвычайных ситуаций";
$type5461="мероприятия по обеспечению пожарной безопасности";
$type5462="организация строительства";
$type205="5. Выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов первого-четвертого классов сложности";
$type206="5.1. выполнение функций заказчика, застройщика, оказание отдельных видов инженерных услуг в строительстве";
$type207="5.2. выполнение функций заказчика, застройщика, оказание инженерных услуг по комплексному управлению строительной деятельностью";
$type208="5.3. технический надзор за общестроительными работами";
$type209="5.4. технический надзор за работами в области водоснабжения и канализации";
$type210="5.5. технический надзор за работами по устройству систем вентиляции, кондиционирования";
$type211="5.6. технический надзор за работами в области теплоснабжения";
$type212="5.7. технический надзор за работами в области газоснабжения";
$type213="5.8. технический надзор за работами в области электроснабжения";
$type214="5.9. технический надзор за работами в области связи, сигнализации и пожаротушения";
$type215="5.10. технический надзор за дорожно-мостовым строительством";
$type216="5.11. технический надзор за строительством железных дорог";
$type217="5.12. технический надзор за строительством сооружений метрополитена и тоннелей";
$type218="5.13. технический надзор за гидротехническим и мелиоративным строительством";
$type219="5.14. технический надзор за благоустройством территории";
$type220="6. Градостроительная деятельность";
$type221="6.1. разработка градостроительных проектов общего планирования";
$type222="6.2. разработка градостроительных проектов общего планирования (генеральные планы городов районного подчинения, поселков городского типа и сельских населенных пунктов)";
$type223="6.3. разработка градостроительных проектов специального планирования";
$type224="6.4. разработка градостроительных проектов детального планирования";
$type225="6.5. разработка градостроительных проектов детального планирования (площадь территории - до 30 га)";
$type226="6.6. разработка градостроительных проектов детального планирования (схемы планировки районов индивидуального жилищного строительства)";
$type227="7. Выполнение функций генерального подрядчика";
$type228="8. Строительство объектов первого-четвертого классов сложности";
$type229="8.1. геодезические работы";
$type230="8.2. подготовительные работы";
$type231="8.3. земляные работы";
$type232="8.4. свайные работы";
$type233="8.5. искусственное укрепление грунтов";
$type234="8.6. устройство оснований, фундаментов зданий и сооружений на естественных грунтах";
$type235="8.7. устройство конструкций способом «стена в грунте»";
$type236="8.8. устройство скважин для забора подземных вод";
$type237="8.9. бестраншейная прокладка инженерных сетей и коммуникаций";
$type238="8.10. возведение монолитных бетонных и железобетонных конструкций";
$type239="8.11. монтаж сборных бетонных и железобетонных конструкций";
$type240="8.12. монтаж металлических конструкций";
$type241="8.13. монтаж деревянных конструкций";
$type242="8.14. монтаж каменных и армокаменных конструкций";
$type243="8.15. монтаж конструкций из полимерных композиционных материалов";
$type244="8.16. защита строительных конструкций и оборудования";
$type245="8.17. защита трубопроводов";
$type246="8.18. устройство изоляционных покрытий";
$type247="8.19. устройство кровли";
$type248="8.20. устройство систем теплоизоляции и фасадов зданий";
$type249="8.21. заполнение оконных и дверных проемов";
$type250="8.22. устройство полов";
$type251="8.23. отделочные работы";
$type252="8.24. устройство наружных сетей водопровода и канализации";
$type253="8.25. устройство внутренних сетей водопровода и канализации";
$type254="8.26. устройство наружных сетей теплоснабжения";
$type255="8.27. устройство внутренних сетей теплоснабжения";
$type256="8.28. устройство наружных сетей и линий электроснабжения";
$type257="8.29. устройство внутренних сетей электроснабжения";
$type258="8.30. устройство наружных сетей газопроводов";
$type259="8.31. устройство внутренних систем газоснабжения";
$type260="8.32. устройство слаботочных сетей и систем";
$type261="8.33. монтаж систем вентиляции и кондиционирования воздуха";
$type262="8.34. гидротехническое и мелиоративное строительство";
$type263="8.35. строительство автомобильных дорог и аэродромов";
$type264="8.36. строительство мостов, эстакад и путепроводов";
$type265="8.37. благоустройство территорий";
$type266="8.38. строительство железных дорог";
$type267="8.39. строительство сооружений метрополитена и тоннелей";
$type268="8.40. монтаж систем пожаротушения";
$type269="8.41. работы по огнезащите";
$type270="8.42. монтаж подъемно-транспортного оборудования";
$type271="8.43. устройство шахтных сооружений";
$type5753="9. Выполнение работ по обследованию зданий и сооружений";

// добавление видов работ с 13.05.2017 в переменные//
$type5594="1. Инженерные изыскания для объектов строительства первого-четвертого классов сложности";
$type5595="1.1. работы в составе инженерно-геодезических изысканий";
$type5596="1.1.1. создание опорных геодезических сетей";
$type5597="1.1.2. геодезические наблюдения за деформациями и осадками зданий и сооружений, движениями земной поверхности и опасными природными процесс";
$type5598="1.1.3. съемка подземных коммуникаций и сооружений";
$type5599="1.1.4. трассирование линейных объектов";
$type5600="1.1.5. инженерно-гидрографические работы";
$type5601="1.1.6. специальные геодезические и топографические работы при строительстве и реконструкции зданий и сооружений";
$type5602="1.1.7. геодинамический контроль (режимные наблюдения) стабильности природной среды";
$type5616="1.2. работы в составе инженерно-геологических изысканий";
$type5617="1.2.1. инженерно-геологическая съемка в масштабах 1:500 - 1:25 000";
$type5624="1.2.2. проходка горных выработок с их опробованием, полевые и лабораторные исследования физико-механических свойств грунтов и химических свойств проб подземных вод";
$type5618="1.2.3. изучение опасных геологических и инженерно-геологических процессов с разработкой рекомендаций по инженерной защите территории";
$type5619="1.2.4. гидрогеологические исследования";
$type5620="1.2.5. инженерно-геофизические исследования";
$type5621="1.2.6. инженерно-геокриологические исследования";
$type5622="1.2.7. сейсмологические и сейсмотектонические исследования территории, сейсмическое микрорайонирование";
$type5623="1.2.8. геофизические исследования грунтов в условиях естественного залегания с использованием радиационных источников";
$type5625="1.3. работы в составе инженерно-гидрометеорологических изысканий";
$type5626="1.3.1. метеорологические наблюдения и изучение гидрологического режима водных объектов";
$type5627="1.3.2. изучение опасных гидрометеорологических процессов и явлений с расчетами их характеристик";
$type5628="1.3.3. изучение русловых процессов водных объектов, деформаций и переработки берегов";
$type5629="1.3.4. исследования ледового режима водных объектов";
$type5630="1.4. работы в составе инженерно-экологических изысканий";
$type5631="1.4.1. инженерно-экологическая съемка территории";
$type5632="1.4.2. исследования химического загрязнения почвогрунтов, поверхностных и подземных вод, атмосферного воздуха, источников загрязнения";
$type5633="1.4.3. лабораторные химико-аналитические и газохимические исследования образцов и проб почвогрунтов и воды";
$type5634="1.4.4. исследования и оценка физических воздействий и радиационной обстановки на территории";
$type5635="1.4.5. изучение растительности, животного мира, санитарно-эпидемиологические и медико-биологические исследования территории. Математическое моделирование процессов геофильтрации и массопереноса радионуклидов";
$type5636="1.4.6. исследования и прогнозные оценки миграции радионуклидов в грунтах, подземных и поверхностных водах";
$type5647="1.5. работы в составе инженерно-геотехнических изысканий";
$type5648="1.5.1. проходка горных выработок с их опробованием, полевые и лабораторные исследования механических свойств грунтов с определением характеристик для конкретных схем расчета оснований фундаментов";
$type5649="1.5.2. испытания эталонных и натурных свай";
$type5650="1.5.3. определение стандартных механических характеристик грунтов методами статического, динамического и бурового зондирования";
$type5651="1.5.4. физическое и математическое моделирование взаимодействия зданий и сооружений с геологической средой";
$type5652="1.5.5. специальные исследования характеристик грунтов по отдельным программам для нестандартных, в том числе нелинейных, методов расчета оснований фундаментов и конструкций зданий и сооружений";
$type5653="1.5.6. геотехнический контроль строительства зданий, сооружений и прилегающих территорий";
$type5654="1.6. обследование состояния грунтов оснований зданий и сооружений";
$type5655="2. Разработка предпроектной (предынвестиционной) документации";
$type5656="3. Выполнение функций генерального проектировщика";
$type5657="4. Разработка разделов проектной документации для объектов строительства первого-четвертого классов сложности";
$type5658="4.1. генеральный план";
$type5659="4.2. архитектурные решения";
$type5660="4.3. сметная документация";
$type5661="4.4. строительные решения";
$type5662="4.5. внутреннее инженерное оборудование, внутренние сети и системы";
$type5663="4.5.1. отопление, вентиляция и кондиционирование воздуха";
$type5664="4.5.2. холодоснабжение, за исключением потенциально опасных объектов";
$type5665="4.5.3. водоснабжение и канализация";
$type5666="4.5.4. электроснабжение, силовое электрооборудование и электроосвещение";
$type5667="4.5.5. связь и сигнализация, за исключением систем автоматической пожарной сигнализации, а также потенциально опасных объектов";
$type5668="4.5.6. автоматизация, за исключением потенциально опасных объектов";
$type5669="4.5.7. системы газоснабжения, за исключением потенциально опасных объектов";
$type5670="4.6. наружные сети и системы";
$type5671="4.6.1. теплоснабжение";
$type5672="4.6.2. водоснабжение и канализация";
$type5673="4.6.3. электроснабжение";
$type5674="4.6.4. связь и сигнализация, за исключением систем автоматической пожарной сигнализации, а также потенциально опасных объектов";
$type5675="4.6.5. сети газоснабжения, за исключением потенциально опасных объектов";
$type5676="4.7. технологические решения";
$type5677="4.8. инженерно-технические мероприятия гражданской обороны. Мероприятия по предупреждению чрезвычайных ситуаций";
$type5678="4.9. организация строительства";
$type5679="4.10. охрана окружающей среды";
$type5680="5. Выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов первого-четвертого классов сложности";
$type5681="5.1. выполнение функций заказчика, застройщика, оказание отдельных видов инженерных услуг в строительстве";
$type5682="5.2. выполнение функций заказчика, застройщика, оказание инженерных услуг по комплексному управлению строительной деятельностью";
$type5683="5.3. технический надзор за общестроительными работами";
$type5684="5.4. технический надзор за работами в области водоснабжения и канализации";
$type5685="5.5. технический надзор за работами по монтажу внутренних сетей теплоснабжения, вентиляции и кондиционирования воздуха";
$type5686="5.6. технический надзор за работами по устройству систем холодоснабжения";
$type5687="5.7. технический надзор за работами по монтажу наружных сетей теплоснабжения";
$type5688="5.8. технический надзор за работами в области газоснабжения";
$type5689="5.9. технический надзор за работами в области электроснабжения и автоматизации";
$type5690="5.10. технический надзор за работами в области связи, сигнализации";
$type5691="5.11. технический надзор за работами по строительству автомобильных дорог и аэродромов, строительству мостов, транспортных эстакад и путепроводов";
$type5692="5.12. технический надзор за строительством железных дорог";
$type5693="5.13. технический надзор за строительством сооружений транспортных тоннелей, метрополитенов";
$type5694="5.14. технический надзор за гидротехническим и мелиоративным строительством";
$type5695="5.15. технический надзор за благоустройством территорий";
$type5696="5.16. технический надзор за работами по монтажу технологических трубопроводов";
$type5697="5.17. технический надзор за работами по устройству магистральных трубопроводов для транспортирования нефти, газа, нефтепродуктов";
$type5698="6. Градостроительная деятельность";
$type5699="6.1. разработка градостроительных проектов общего планирования";
$type5700="6.2. разработка градостроительных проектов общего планирования (генеральные планы городов районного подчинения, поселков городского типа и сельских населенных пунктов)";
$type5701="6.3. разработка градостроительных проектов специального планирования";
$type5702="6.4. разработка градостроительных проектов детального планирования";
$type5703="6.5. разработка градостроительных проектов детального планирования (площадь территории - до 30 га)";
$type5704="6.6. разработка градостроительных проектов детального планирования (схемы планировки районов индивидуального жилищного строительства)";
$type5705="7. Выполнение функций генерального подрядчика объектов первого-четвертого классов сложности со стоимостью строительства свыше 5 тыс. базовых величин по";
$type5706="7.1. строительству зданий и сооружений";
$type5707="7.2. строительству инженерной инфраструктуры, инженерной и транспортной инфраструктуры, магистральной инженерной инфраструктуры";
$type5708="8. Строительство объектов первого-четвертого классов сложности";
$type5709="8.1. геодезические работы, выполняемые при строительстве";
$type5710="8.2. подготовительные работы, за исключением осуществляемых сельскохозяйственными  организациями при строительстве объектов сельскохозяйственного назначения  хозяйственным способом";
$type5711="8.3. земляные работы, за исключением осуществляемых сельскохозяйственными  организациями при строительстве объектов сельскохозяйственного назначения  хозяйственным способом";
$type5712="8.4. свайные работы";
$type5713="8.5. искусственное укрепление грунтов";
$type5714="8.6. устройство оснований, фундаментов зданий и сооружений на естественных грунтах";
$type5715="8.7. устройство конструкций способом «стена в грунте»";
$type5716="8.8. бурение и обустройство скважин (кроме нефтяных и газовых), за исключением потенциально опасных объектов, технических устройств";
$type5717="8.9. бестраншейная прокладка инженерных сетей и коммуникаций";
$type5718="8.10. устройство бетонных и железобетонных монолитных конструкций, кроме мостов, транспортных эстакад и путепроводов";
$type5719="8.11. монтаж сборных бетонных и железобетонных конструкций, кроме мостов, транспортных эстакад и путепроводов";
$type5720="8.12. монтаж металлических конструкций, кроме мостов, транспортных эстакад и путепроводов";
$type5721="8.13. монтаж деревянных конструкций (кроме мостов, транспортных эстакад и  путепроводов), за исключением осуществляемого сельскохозяйственными организациями  при строительстве объектов сельскохозяйственного назначения хозяйственным способом";
$type5722="8.14. монтаж каменных и армокаменных конструкций (кроме мостов, транспортных эстакад и  путепроводов), за исключением монтажа ненесущих конструкций, осуществляемого с/х организациями при строительстве объектов с/х назначения хозяйственным способом";
$type5723="8.15. монтаж конструкций из полимерных композиционных материалов, кроме мостов, транспортных эстакад и путепроводов";
$type5724="8.16. защита строительных конструкций и оборудования, за исключением потенциально опасных объектов";
$type5725="8.17. защита трубопроводов, за исключением потенциально опасных объектов";
$type5726="8.18. устройство изоляционных покрытий, за исключением потенциально опасных объектов";
$type5727="8.19. устройство кровли, за исключением осуществляемого сельскохозяйственными  организациями при строительстве объектов сельскохозяйственного назначения  хозяйственным способом";
$type5728="8.20. устройство фасадных систем теплоизоляции и облицовка фасадов зданий, за  исключением осуществляемых сельскохозяйственными организациями при строительстве объектов сельскохозяйственного назначения хозяйственным способом";
$type5729="8.21. заполнение оконных и дверных проемов, за исключением осуществляемого сельскохозяйственными организациями при строительстве объектов сельскохозяйственного назначения хозяйственным способом";
$type5730="8.22. устройство полов, за исключением осуществляемого сельскохозяйственными организациями при строительстве объектов сельскохозяйственного назначения хозяйственным способом";
$type5731="8.23. отделочные работы, за исключением осуществляемых сельскохозяйственными организациями при строительстве объектов сельскохозяйственного назначения хозяйственным способом";
$type5732="8.24. устройство наружных сетей водоснабжения и канализации";
$type5733="8.25. устройство внутренних систем водопровода и канализации";
$type5734="8.26. устройство наружных сетей теплоснабжения";
$type5735="8.27. устройство внутренних сетей теплоснабжения";
$type5736="8.28. устройство наружных сетей и линий электроснабжения, трансформаторных подстанций и распределительных устройств";
$type5737="8.29. устройство внутренних систем электроснабжения";
$type5738="8.30. устройство внутренних систем газоснабжения объектов жилищного фонда";
$type5739="8.31. устройство слаботочных сетей и систем, за исключением систем автоматической пожарной сигнализации, оповещения о пожаре и управления эвакуацией";
$type5740="8.32. монтаж систем вентиляции и кондиционирования воздуха";
$type5741="8.33. гидротехническое и мелиоративное строительство";
$type5742="8.34. строительство автомобильных дорог и аэродромов";
$type5743="8.35. строительство мостов, транспортных эстакад и путепроводов";
$type5744="8.36. благоустройство территории, за исключением осуществляемого сельскохозяйственными организациями при строительстве объектов сельскохозяйственного назначения хозяйственным способом";
$type5745="8.37. строительство железных дорог";
$type5746="8.38. строительство транспортных тоннелей, метрополитенов, за исключением потенциально опасных объектов, технических устройств";
$type5747="8.39. монтаж систем холодоснабжения, за исключением потенциально опасных объектов, технических устройств";
$type5748="8.40. монтаж систем автоматизации, за исключением потенциально опасных объектов, технических устройств";
$type5749="8.41. монтаж подъемных сооружений, за исключением потенциально опасных объектов, технических устройств";
$type5750="8.42. устройство шахтных сооружений, за исключением потенциально опасных объектов, технических устройств";
$type5751="8.43. монтаж технологических трубопроводов, за исключением потенциально опасных объектов, технических устройств";
$type5752="9. Обследование зданий и сооружений";
$type5901="строительных конструкций зданий и сооружений";
$type5902="инженерных сетей и систем";
$type5903="автомобильных дорог, мостовых сооружений";

// добавление видов работ с 23.02.2018 в переменные//
$type5907="1. Инженерные изыскания для объектов строительства первого-четвертого классов сложности";
$type5908="1.1. работы в составе инженерно-геодезических изысканий";
$type5909="1.2. работы в составе инженерно-геологических изысканий";
$type5910="1.3. работы в составе инженерно-экологических изысканий";
$type5911="2. Выполнение функций генерального проектировщика";
$type5912="3. Разработка разделов проектной документации для объектов строительства первого-четвертого классов сложности";
$type5913="3.1. генеральный план";
$type5914="3.2. архитектурные решения";
$type5915="3.3. сметная документация";
$type5916="3.4. строительные решения";
$type5917="3.5. внутреннее инженерное оборудование, внутренние сети и системы";
$type5918="3.5.1. отопление, вентиляция и кондиционирование воздуха";
$type5919="3.5.2. холодоснабжение, за исключением потенциально опасных объектов";
$type5920="3.5.3. водоснабжение и канализация";
$type5921="3.5.4. электроснабжение, силовое электрооборудование и электроосвещение";
$type5922="3.5.5. автоматизация, за исключением потенциально опасных объектов";
$type5923="3.5.6. системы газоснабжения, за исключением потенциально опасных объектов";
$type5924="3.6. наружные сети и системы";
$type5925="3.6.1. теплоснабжение";
$type5926="3.6.2. водоснабжение и канализация";
$type5927="3.6.3. электроснабжение";
$type5928="3.6.4. сети газоснабжения, за исключением потенциально опасных объектов";
$type5929="3.7. инженерно-технические мероприятия гражданской обороны. Мероприятия по предупреждению чрезвычайных ситуаций";
$type5930="3.8. охрана окружающей среды";
$type5931="4. Оказание инженерных услуг при осуществлении деятельности в области строительства объектов первого-четвертого классов сложности";
$type5932="4.1. оказание отдельных видов инженерных услуг в строительстве";
$type5933="4.2. оказание инженерных услуг по комплексному управлению строительной деятельностью";
$type5934="4.3. технический надзор за общестроительными работами";
$type5935="4.4. технический надзор за работами в области водоснабжения и канализации";
$type5936="4.5. технический надзор за работами по монтажу внутренних сетей теплоснабжения, вентиляции и кондиционирования воздуха";
$type5937="4.6. технический надзор за работами по устройству систем холодоснабжения";
$type5938="4.7. технический надзор за работами по монтажу наружных сетей теплоснабжения";
$type5939="4.8. технический надзор за работами в области газоснабжения";
$type5940="4.9. технический надзор за работами в области электроснабжения и автоматизации";
$type5941="4.10. технический надзор за работами в области связи, сигнализации";
$type5942="4.11. технический надзор за работами по строительству автомобильных дорог и аэродромов, строительству мостов, транспортных эстакад и путепроводов";
$type5943="4.12. технический надзор за строительством железных дорог";
$type5944="4.13. технический надзор за строительством сооружений транспортных тоннелей, метрополитенов";
$type5945="4.14. технический надзор за гидротехническим и мелиоративным строительством";
$type5946="4.15. технический надзор за работами по монтажу технологических трубопроводов";
$type5947="4.16. технический надзор за работами по устройству магистральных трубопроводов для транспортирования нефти, газа, нефтепродуктов";
$type5948="5. Градостроительная деятельность";
$type5949="5.1. разработка градостроительных проектов общего планирования";
$type5950="5.2. разработка градостроительных проектов общего планирования (генеральные планы городов районного подчинения, поселков городского типа и сельских населенных пунктов)";
$type5951="5.3. разработка градостроительных проектов специального планирования";
$type5952="5.4. разработка градостроительных проектов детального планирования";
$type5953="5.5. разработка градостроительных проектов детального планирования (площадь территории - до 30 гектаров)";
$type5954="6. Выполнение функций генерального подрядчика объектов первого-четвертого классов сложности со стоимостью строительства свыше 5 тыс. базовых величин по";
$type5955="6.1. строительству зданий и сооружений";
$type5956="6.2. строительству инженерной инфраструктуры, инженерной и транспортной инфраструктуры, магистральной инженерной инфраструктуры";
$type5957="7. Строительство объектов первого-четвертого классов сложности";
$type5958="7.1. геодезические работы, выполняемые при строительстве";
$type5959="7.2. устройство оснований, фундаментов зданий и сооружений";
$type5960="7.3. устройство конструкций способом «стена в грунте»";
$type5961="7.4. устройство бетонных и железобетонных монолитных конструкций, кроме мостов, транспортных эстакад и путепроводов";
$type5962="7.5. монтаж сборных бетонных и железобетонных конструкций, кроме мостов, транспортных эстакад и путепроводов";
$type5963="7.6. монтаж стальных несущих конструкций, кроме мостов, транспортных эстакад и путепроводов";
$type5964="7.7. монтаж деревянных несущих элементов (конструкций), кроме мостов, транспортных эстакад и путепроводов, за исключением осуществляемых сельскохозяйственными организациями  при строительстве объектов сельскохозяйственного назначения хозяйственным...";
$type5965="7.8. монтаж каменных и армокаменных конструкций, кроме мостов, транспортных эстакад и путепроводов, за исключением осуществляемых сельскохозяйственными организациями при строительстве объектов сельскохозяйственного назначения хозяйственным способом";
$type5966="7.9. устройство кровли, за исключением осуществляемых сельскохозяйственными организациями при строительстве объектов сельскохозяйственного назначения хозяйственным способом";
$type5967="7.10. устройство фасадных систем теплоизоляции и облицовка фасадов зданий, за исключением осуществляемых сельскохозяйственными организациями при строительстве объектов сельскохозяйственного назначения хозяйственным способом";
$type5968="7.11. устройство наружных сетей водоснабжения и канализации";
$type5969="7.12. устройство внутренних систем водопровода и канализации, за исключением устройства пожарных кранов на автоматических установках пожаротушения";
$type5970="7.13. устройство наружных сетей теплоснабжения";
$type5971="7.14. устройство внутренних сетей теплоснабжения";
$type5972="7.15. устройство наружных сетей и линий электроснабжения, трансформаторных подстанций и распределительных устройств";
$type5973="7.16. устройство внутренних систем электроснабжения";
$type5974="7.17. устройство внутренних систем газоснабжения объектов жилищного фонда";
$type5975="7.18. монтаж систем вентиляции и кондиционирования воздуха, за исключением систем противодымной вентиляции";
$type5976="7.19. гидротехническое и мелиоративное строительство";
$type5977="7.20. строительство автомобильных дорог и аэродромов";
$type5978="7.21. строительство мостов, транспортных эстакад и путепроводов";
$type5979="7.22. строительство железных дорог";
$type5980="7.23. строительство транспортных тоннелей, метрополитенов, за исключением потенциально опасных объектов, технических устройств";
$type5981="7.24. монтаж систем холодоснабжения, за исключением потенциально опасных объектов, технических устройств";
$type5982="7.25. монтаж систем автоматизации, за исключением потенциально опасных объектов, технических устройств";
$type5983="7.26. устройство шахтных сооружений, за исключением потенциально опасных объектов, технических устройств";
$type5984="7.27. монтаж технологических трубопроводов, за исключением потенциально опасных объектов, технических устройств";
$type5985="8. Обследование зданий и сооружений";
$type5987="автомобильных дорог, мостовых сооружений";
$type5986="строительных конструкций зданий и сооружений";


// добавление видов работ промежуточных в переменные//
$type5795="4.5.1. отопление, вентиляция и кондиционирование воздуха *";
$type5797="4.5.3. водоснабжение и канализация *";
$type5798="4.5.4. электроснабжение, силовое электрооборудование и электроосвещение *";
$type5799="4.5.5. связь и сигнализация, за исключением систем автоматической пожарной сигнализации, а также потенциально опасных объектов *";
$type5802="4.6.1. теплоснабжение *";
$type5803="4.6.2. водоснабжение и канализация *";
$type5804="4.6.3. электроснабжение *";
$type5805="4.6.4. связь и сигнализация, за исключением систем автоматической пожарной сигнализации, а также потенциально опасных объектов *";
$type5864="8.1. геодезические работы, выполняемые при строительстве *";
$type5869="8.12. монтаж металлических конструкций, кроме мостов, транспортных эстакад и путепроводов *";
$type5872="8.15. монтаж конструкций из полимерных композиционных материалов, кроме мостов, транспортных эстакад и путепроводов *";
$type5873="8.16. защита строительных конструкций и оборудования, за исключением потенциально опасных объектов *";
$type5874="8.17. защита трубопроводов, за исключением потенциально опасных объектов *";
$type5875="8.18. устройство изоляционных покрытий, за исключением потенциально опасных объектов *";
$type5885="8.28. устройство наружных сетей и линий электроснабжения, трансформаторных подстанций и распределительных устройств *";
$type5886="8.29. устройство внутренних систем электроснабжения *";
$type5888="8.31. устройство слаботочных сетей и систем, за исключением систем автоматической пожарной сигнализации, оповещения о пожаре и управления эвакуацией *";
$type5892="8.35. строительство мостов, транспортных эстакад и путепроводов *";
$type5827="7. Выполнение функций генерального подрядчика объектов первого-четвертого классов сложности со стоимостью строительства свыше 5 тыс. базовых величин по *";
$type5828="7.1. строительству зданий и сооружений *";
$type5829="7.2. строительству инженерной инфраструктуры, инженерной и транспортной инфраструктуры, магистральной инженерной инфраструктуры *";
//добавление специалистов в переменные//
$spec0="null";
$spec10=10;
$spec101=101;
$spec102=102;
$spec103=103;
$spec104=104;
$spec105=105;
$spec106=106;
$spec107=107;
$spec108=108;
$spec109=109;
$spec11=11;
$spec110=110;
$spec111=111;
$spec112=112;
$spec113=113;
$spec114=114;
$spec115=115;
$spec116=116;
$spec117=117;
$spec118=118;
$spec119=119;
$spec12=12;
$spec120=120;
$spec121=121;
$spec122=122;
$spec123=123;
$spec124=124;
$spec125=125;
$spec126=126;
$spec127=127;
$spec128=128;
$spec129=129;
$spec13=13;
$spec136=136;
$spec137=137;
$spec138=138;
$spec139=139;
$spec14="null";
$spec140=140;
$spec141=141;
$spec142=142;
$spec143=143;
$spec144=144;
$spec145=145;
$spec146=146;
$spec147=147;
$spec148=148;
$spec15=15;
$spec150=150;
$spec151=151;
$spec152=152;
$spec153=153;
$spec154=154;
$spec155=155;
$spec16=16;
$spec162=162;
$spec163=163;
$spec164=164;
$spec166=166;
$spec167=167;
$spec168=168;
$spec169=169;
$spec17=17;
$spec170=170;
$spec171=171;
$spec173=173;
$spec174=174;
$spec17700024=17700024;
$spec17700026=17700026;
$spec17700030=17700030;
$spec17700033=17700033;
$spec17700043=17700043;
$spec17700044=17700044;
$spec17700046=17700046;
$spec17700047=17700047;
$spec17700048=17700048;
$spec17700059=17700059;
$spec17700061=17700061;
$spec17700066=17700066;
$spec17700067=17700067;
$spec17700068=17700068;
$spec17700069=17700069;
$spec17700070=17700070;
$spec17700071=17700071;
$spec17700072=17700072;
$spec17700074=17700074;
$spec17700084=17700084;
$spec17700085=17700085;
$spec17700097=17700097;
$spec17700098=17700098;
$spec17700099=17700099;
$spec17700101=17700101;
$spec17700102=17700102;
$spec17700103=17700103;
$spec17700104=17700104;
$spec17700105=17700105;
$spec17700106=17700106;
$spec17700107=17700107;
$spec17700108=17700108;
$spec17700109=17700109;
$spec17700114=17700114;
$spec17700115=17700115;
$spec17700118=17700118;
$spec17700120=17700120;
$spec17700121=17700121;
$spec17700124=17700124;
$spec17700129=17700129;
$spec17700135=17700135;
$spec17700195=17700195;
$spec17700197=17700197;
$spec17700199=17700199;
$spec17700200=17700200;
$spec17700203=17700203;
$spec17700204=17700204;
$spec17700205=17700205;
$spec17700209=17700209;
$spec17700211=17700211;
$spec17700215=17700215;
$spec17700216=17700216;
$spec17700217=17700217;
$spec17700223=17700223;
$spec17700225=17700225;
$spec17700231=17700231;
$spec17700232=17700232;
$spec17700233=17700233;
$spec17700234=17700234;
$spec17700237=17700237;
$spec17700239=17700239;
$spec17700243=17700243;
$spec17700245=17700245;
$spec17700246=17700246;
$spec18=18;
$spec187=187;
$spec18700024=18700024;
$spec18700026=18700026;
$spec18700030=18700030;
$spec18700033=18700033;
$spec18700034=18700034;
$spec18700057=18700057;
$spec18700061=18700061;
$spec18700084=18700084;
$spec18700085=18700085;
$spec18700095=18700095;
$spec18700097=18700097;
$spec18700113=18700113;
$spec18700187=18700187;
$spec18700251=18700251;
$spec18700276=18700276;
$spec18700277=18700277;
$spec188=188;
$spec189=189;
$spec19=19;
$spec190=190;
$spec192=192;
$spec193=193;
$spec194=194;
$spec195=195;
$spec196=196;
$spec197=197;
$spec198=198;
$spec199=199;
$spec200=200;
$spec20112=20112;
$spec20113=20113;
$spec202=202;
$spec203=203;
$spec204=204;
$spec205=205;
$spec206=206;
$spec207=207;
$spec208=208;
$spec209=209;
$spec210=210;
$spec211=211;
$spec212=212;
$spec213="null";
$spec214=214;
$spec215=215;
$spec216=216;
$spec217=217;
$spec218=218;
$spec220=220;
$spec221=221;
$spec222=222;
$spec223=223;
$spec224=224;
$spec225=225;
$spec226=226;
$spec227=227;
$spec228=228;
$spec230=230;
$spec231=231;
$spec232=232;
$spec233=233;
$spec234=234;
$spec235=235;
$spec236=236;
$spec237=237;
$spec238=238;
$spec239=239;
$spec24=24;
$spec240=240;
$spec241="null";
$spec242=242;
$spec243=243;
$spec244=244;
$spec245=245;
$spec246=246;
$spec247=247;
$spec248=248;
$spec249=249;
$spec250=250;
$spec251=251;
$spec252=252;
$spec253=253;
$spec254=254;
$spec255=255;
$spec256=256;
$spec257=257;
$spec258=258;
$spec259=259;
$spec26=26;
$spec260=260;
$spec261=261;
$spec262=262;
$spec263=263;
$spec264=264;
$spec265=265;
$spec266=266;
$spec267=267;
$spec268=268;
$spec269=269;
$spec270=270;
$spec271=271;
$spec272=272;
$spec273=273;
$spec274=274;
$spec275=275;
$spec276=276;
$spec277=277;
$spec278=278;
$spec3=3;
$spec30=30;
$spec33=33;
$spec34=34;
$spec38=38;
$spec39=39;
$spec4=4;
$spec40=40;
$spec41=41;
$spec42=42;
$spec43=43;
$spec44=44;
$spec45=45;
$spec46=46;
$spec47=47;
$spec48=48;
$spec50=50;
$spec51="null";
$spec52="null";
$spec53="null";
$spec54="null";
$spec55="null";
$spec56="null";
$spec57=57;
$spec58=58;
$spec59=59;
$spec60=60;
$spec61=61;
$spec62=62;
$spec63=63;
$spec64=64;
$spec66=66;
$spec67=67;
$spec68=68;
$spec69=69;
$spec70=70;
$spec700004=700004;
$spec700024=700024;
$spec700026=700026;
$spec700030=700030;
$spec700033=700033;
$spec700034=700034;
$spec700039=700039;
$spec700043=700043;
$spec700044=700044;
$spec700045=700045;
$spec700046=700046;
$spec700047=700047;
$spec700048=700048;
$spec700057=700057;
$spec700059=700059;
$spec700061=700061;
$spec700063=700063;
$spec700064=700064;
$spec700066=700066;
$spec700067=700067;
$spec700068=700068;
$spec700069=700069;
$spec700070=700070;
$spec700071=700071;
$spec700072=700072;
$spec700073=700073;
$spec700074=700074;
$spec700084=700084;
$spec700085=700085;
$spec700093=700093;
$spec700095=700095;
$spec700096=700096;
$spec700097=700097;
$spec700098=700098;
$spec700099=700099;
$spec700101=700101;
$spec700102=700102;
$spec700103=700103;
$spec700104=700104;
$spec700105=700105;
$spec700106=700106;
$spec700107=700107;
$spec700108=700108;
$spec700109=700109;
$spec700113=700113;
$spec700114=700114;
$spec700115=700115;
$spec700116=700116;
$spec700117=700117;
$spec700118=700118;
$spec700119=700119;
$spec700120=700120;
$spec700121=700121;
$spec700122=700122;
$spec700123=700123;
$spec700124=700124;
$spec700125=700125;
$spec700126=700126;
$spec700128=700128;
$spec700129=700129;
$spec700135=700135;
$spec700136=700136;
$spec700137=700137;
$spec700138=700138;
$spec700139=700139;
$spec700140=700140;
$spec700141=700141;
$spec700142=700142;
$spec700147=700147;
$spec700162=700162;
$spec700163=700163;
$spec700164=700164;
$spec700166=700166;
$spec700167=700167;
$spec700168=700168;
$spec700169=700169;
$spec700170=700170;
$spec700171=700171;
$spec700187=700187;
$spec700190=700190;
$spec71=71;
$spec710112=710112;
$spec710113=710113;
$spec710114=710114;
$spec710115=710115;
$spec710116=710116;
$spec710117=710117;
$spec710118=710118;
$spec710119=710119;
$spec710120=710120;
$spec710121=710121;
$spec710122=710122;
$spec710123=710123;
$spec710124=710124;
$spec710125=710125;
$spec710126=710126;
$spec710128=710128;
$spec71039=71039;
$spec71043=71043;
$spec71044=71044;
$spec71045=71045;
$spec71046=71046;
$spec71047=71047;
$spec71048=71048;
$spec71059=71059;
$spec71063=71063;
$spec71073=71073;
$spec71074=71074;
$spec71096=71096;
$spec72=72;
$spec73=73;
$spec74=74;
$spec75="null";
$spec76=76;
$spec77=77;
$spec78=78;
$spec79=79;
$spec80=80;
$spec800135=800135;
$spec81=81;
$spec82=82;
$spec83=83;
$spec84=84;
$spec85=85;
$spec9=9;
$spec90=90;
$spec91=91;
$spec92="null";
$spec93=93;
$spec94=94;
$spec95=95;
$spec96=96;
$spec97=97;
$spec98=98;
$spec99=99;



//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
$personnel_main_request=views_get_view_result('personal_for_data', $display_id ='default', array($row->nid));
//personnels_for_data - массив данных представдения (специалисты из проверки ПКД)
$types_of_jobs=views_get_view_result('kinds_of_specialties', $display_id ='default', array($row->nid_1));
//kinds_of_specialties - массив данных представдения (Фильтр виды работ для сравнения)
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
////получаем названия видов работ/////// 
$vidy10=$types_of_jobs[0]->field_field_vidyrab;
$vidy2=$types_of_jobs[0]->field_field_vidyrab[0][raw];
$vidy3=$vidy2[taxonomy_term]->name;
/////получаем значения полей field_2 специалистов из подтверждения ПКД ////////
for ($i = 0; $i <= count($personnel_main_request); $i++){ 
	$wr1_4=$personnel_main_request[$i]->_field_data[node_field_data_field_sotrrrudn_nid];
	$wr1_5[$i]=$wr1_4[entity]->field_2[und][0][value];
} 
$allspec=$wr1_5;



///////находим совпадения в названиях видов работ//////////////
$alltypes=$types_of_jobs3;
function search_types_of_jobs ($alltypes, $type_of_job){
	$avail_type=substr_count($alltypes, $type_of_job);
	return $avail_type;
}

/////////находим количество вхождений field_2 в массиве работников//
function searchavailspec($allspec, $spec){
	$n=0;
	for($i=0; $i<=count($allspec); $i++){
 
        if($allspec[$i]==$spec){
 $n++;
           }
}
return $n;
}

function countoverzero ($a, $count){
	if ($a>0){
			$count=$count+$a;	
			}					
	return $count;
}
//////получение в переменную всех видов работ организации из аттестатов///////////

for ($k = 0; $k < count($types_of_jobs); $k++) { 
	$vidy11=$types_of_jobs[$k]->_field_data;
	$vidy12=$vidy11[field_idn_node_nid];
	$vidy13=$vidy12[entity]->field_klasssl;
	$vidy14=$vidy12[entity]->field_serialnumber;
	$vidy15=$vidy12[entity]->field_vmins;
	$category=$vidy13[und][0][value];
	$nomber=$vidy14[und][0][value];
	$vidyrabot1=$vidy15[und][0][value];
	$data_prikaza=date("d.m.Y", strtotime($vidyrabot1));
    $outdate="2017-05-13";
	print_r("<b>Аттестат:</b> ".$nomber."</br>");
	print_r("<b>Категория:</b> ".$category."</br>");
	print_r("<b>Дата:</b> ".$data_prikaza."</br>");

switch ($category) {
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////CASE 1//////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    case 1:
	if($vidyrabot1 < $outdate){
        for ($i = 0; $i <= count($types_of_jobs[$k]->field_field_vidyrab); $i++) 
		{ 
			$types_of_jobs2=$types_of_jobs[$k]->field_field_vidyrab[$i][raw];
			$types_of_jobs3=$types_of_jobs2[taxonomy_term]->name;
			$vidyrabot[$k][$i]=$types_of_jobs3; // переменная для вывода вне массива
			$condition1=substr_count($types_of_jobs3, $type163);
			print_r ("</br>".$types_of_jobs3."</br>");
		
		switch ($types_of_jobs3) {
        case $type163:
		break;
		
		case $type164:
			if((searchavailspec($allspec, $spec166)+
				searchavailspec($allspec, $spec173)+
				searchavailspec($allspec, $spec700166))>=10){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-геодезические изыскания меньше 10</div>';
				}
		break;
		
		case $type165:
			if((searchavailspec($allspec, $spec167)+
				searchavailspec($allspec, $spec174)+
				searchavailspec($allspec, $spec700167))>=10){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-геологические изыскания меньше 10</div>';
				}
		break;
		
		case $type166:
			if((searchavailspec($allspec, $spec168)+
				searchavailspec($allspec, $spec700168))>=10){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-гидрометеорологические изыскания меньше 10</div>';
				}
		break;
		
		case $type167:
			if((searchavailspec($allspec, $spec169)+
				searchavailspec($allspec, $spec700169))>=10){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-экологические изыскания меньше 10</div>';
				}
		break;
		
		case $type168:
			if((searchavailspec($allspec, $spec170)+
				searchavailspec($allspec, $spec700170))>=10){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-геотехнические изыскания меньше 10</div>';
				}
		break;
		
		case $type169:
			if((searchavailspec($allspec, $spec171)+
				searchavailspec($allspec, $spec700171))>=10){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих обследование состояния грунтов оснований зданий и сооружений меньше 10</div>';
				}
		break;
		
		case $type170:
			if((searchavailspec($allspec, $spec3)+
				searchavailspec($allspec, $spec64)+
				searchavailspec($allspec, $spec700064))>=1
				or 
			   (searchavailspec($allspec, $spec4)+
				searchavailspec($allspec, $spec129)+
				searchavailspec($allspec, $spec148)+
				searchavailspec($allspec, $spec275)+
			    searchavailspec($allspec, $spec700004)+
				searchavailspec($allspec, $spec17700129))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного специалиста ГАП или ГИП</div>';
				}
		break;
		
		case $type171:
			if((searchavailspec($allspec, $spec101)+
				searchavailspec($allspec, $spec102)+
				searchavailspec($allspec, $spec103)+
				searchavailspec($allspec, $spec104)+
				searchavailspec($allspec, $spec105)+
				searchavailspec($allspec, $spec106)+
				searchavailspec($allspec, $spec107)+
				searchavailspec($allspec, $spec108)+
				searchavailspec($allspec, $spec109)+
				searchavailspec($allspec, $spec137)+
				searchavailspec($allspec, $spec138)+
				searchavailspec($allspec, $spec162)+		
				searchavailspec($allspec, $spec700101)+
				searchavailspec($allspec, $spec700102)+
				searchavailspec($allspec, $spec700103)+
				searchavailspec($allspec, $spec700104)+
				searchavailspec($allspec, $spec700105)+
				searchavailspec($allspec, $spec700106)+
				searchavailspec($allspec, $spec700107)+
				searchavailspec($allspec, $spec700108)+
				searchavailspec($allspec, $spec700109)+
				searchavailspec($allspec, $spec700137)+
				searchavailspec($allspec, $spec700138)+
				searchavailspec($allspec, $spec700162)+
				searchavailspec($allspec, $spec17700101)+
				searchavailspec($allspec, $spec17700102)+
				searchavailspec($allspec, $spec17700103)+
				searchavailspec($allspec, $spec17700104)+
				searchavailspec($allspec, $spec17700105)+
				searchavailspec($allspec, $spec17700106)+
				searchavailspec($allspec, $spec17700107)+
				searchavailspec($allspec, $spec17700108)+
				searchavailspec($allspec, $spec17700109))<1) 
			 {
				echo '<div class="red">Нет ни одного аттестованного начальника (заведующего) структурного подразделения</div>';
				}
			else
				{
				echo '<div class="green">Начальник (заведующий) структурного подразделения есть</div>';
				}			
			if((searchavailspec($allspec, $spec3)+
				searchavailspec($allspec, $spec64)+
				searchavailspec($allspec, $spec700064))<4
				and
			   (searchavailspec($allspec, $spec4)+
				searchavailspec($allspec, $spec129)+
				searchavailspec($allspec, $spec148)+
				searchavailspec($allspec, $spec275)+
				searchavailspec($allspec, $spec700004)+
				searchavailspec($allspec, $spec700129)+
				searchavailspec($allspec, $spec17700129))<4)
             {
				echo '<div class="red">Количество специалистов ГАП или ГИП меньше 4</div>';
				}
			 else
				{
				echo '<div class="green">Количество специалистов ГАП или ГИП 4 или более</div>';
				} 
			 if(searchavailspec($allspec, $spec248)<1)
			{
				echo '<div class="red">Нет ни одного главного специалиста по охране окружающей среды</div>';
				} 
			else
			{
				echo '<div class="green">Специалист по охране окружающей среды есть</div>';
				}	
			if((searchavailspec($allspec, $spec164)+
				searchavailspec($allspec, $spec700164))<1)
			{
				echo '<div class="red">Нет ни одного главного специалиста по организации строительства</div>';
				} 
			else
			{
				echo '<div class="green">Главный специалист по организации строительства есть</div>';
				}	
			if (searchavailspec($allspec, $spec249)<1)
			{
				echo '<div class="red">Нет ни одного главного специалиста по инженерно-техническим мероприятиям гражданской обороны</div>';
				}
			else {
			echo '<div class="green">Главный специалист по инженерно-техническим мероприятиям гражданской обороны есть</div>';
				}
		break;
					
		case $type196:
		break;
		
		case $type197:
			if((searchavailspec($allspec, $spec163)+
				searchavailspec($allspec, $spec700163))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (генеральный план)</div>';
				}
		break;
		
		case $type198:
			if((searchavailspec($allspec, $spec3)+
				searchavailspec($allspec, $spec64)+
				searchavailspec($allspec, $spec252)+
				searchavailspec($allspec, $spec700064))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (архитектурные решения) либо ГАПа</div>';
				}
		break;
		
		case $type199:
			if(searchavailspec($allspec, $spec139)+
			   searchavailspec($allspec, $spec700139)>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (сметная документация)</div>';
				}
		break;
		
		case $type200:			
			if((searchavailspec($allspec, $spec66)+
				searchavailspec($allspec, $spec700066)+
				searchavailspec($allspec, $spec17700066))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (конструктивные решения)</div>';
				}			
		break;
		
		case $type543:
		break;
		
		case $type5435:
			if((searchavailspec($allspec, $spec71)+
				searchavailspec($allspec, $spec700071)+
				searchavailspec($allspec, $spec17700071))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (холодоснабжение))</div>';
				}
		break;
		
		case $type5436:
		case $type5438:
		case $type5797:
			if((searchavailspec($allspec, $spec67)+
				searchavailspec($allspec, $spec700067)+
				searchavailspec($allspec, $spec17700067))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</div>';
				}
		break;
		
		case $type5441:
		case $type5442:
		case $type5443:
		case $type5798:
			if((searchavailspec($allspec, $spec72)+
				searchavailspec($allspec, $spec700072)+
				searchavailspec($allspec, $spec17700072))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</div>';
				}
		break;
		
		case $type5444:
		case $type5453:
		case $type5454:
		case $type5799:
			if((searchavailspec($allspec, $spec98)+
				searchavailspec($allspec, $spec700098)+
				searchavailspec($allspec, $spec17700098))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</div>';
				}
		break;

		case $type5439:
		case $type5440:
		case $type5795:
			if((searchavailspec($allspec, $spec68)+
				searchavailspec($allspec, $spec700068)+
				searchavailspec($allspec, $spec17700068))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (отопление, вентиляция и кондиционирование воздуха))</div>';
				}
		break;
		
		case $type5437:
			if((searchavailspec($allspec, $spec69)+
				searchavailspec($allspec, $spec700069)+
				searchavailspec($allspec, $spec17700069))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</div>';
				}
		break;

		case $type5445: /*4.6. наружные сети и системы:*/
		break;
		
		case $type5446:
		case $type5802:
			if((searchavailspec($allspec, $spec17700070)+searchavailspec($allspec, $spec700070)+searchavailspec($allspec, $spec70))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (тепловые сети))</div>';
				}
		break;
		
		case $type5447:
		case $type5449:
		case $type5803:
			if((searchavailspec($allspec, $spec67)+
				searchavailspec($allspec, $spec700067)+
				searchavailspec($allspec, $spec17700067))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</div>';
				}
		break;		
		
		case $type5450:
		case $type5804:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</div>';
				}
		break;
		
		case $type5451:
		case $type5455:
		case $type5456:
		case $type5805:
			if((searchavailspec($allspec, $spec98)+
				searchavailspec($allspec, $spec700098)+
				searchavailspec($allspec, $spec17700098))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</div>';
				}
		break;		
		
		case $type5448:
			if((searchavailspec($allspec, $spec69)+
				searchavailspec($allspec, $spec700069)+
				searchavailspec($allspec, $spec17700069))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</div>';
				}
		break;

		case $type202: 
		break;
		
		case $type5457: /*4.8.:*/
		break;
		
		case $type5459:
		case $type5460:
		case $type5461:
			if(searchavailspec($allspec, $spec249)>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерно-технические мероприятия гражданской обороны. Мероприятия по предупреждению чрезвычайных ситуаций)</div>';
				}
		break;
		
		case $type5462:
			if((searchavailspec($allspec, $spec164)+
				searchavailspec($allspec, $spec700164))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (организация строительства)</div>';
				}
		break;
		
		case $type5458:
			if(searchavailspec($allspec, $spec248)>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (охрана окружающей среды)</div>';
				}
		break;		
		
		case $type205:/*5. Выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов первого-четвертого классов сложности*/	
		case $type206:
		break;
		
		case $type207:
			$count=0;
			$count=countoverzero(searchavailspec($allspec, $spec24),$count);
			$count=countoverzero(searchavailspec($allspec, $spec26),$count);
			$count=countoverzero(searchavailspec($allspec, $spec30),$count);
			$count=countoverzero(searchavailspec($allspec, $spec33),$count);
			$count=countoverzero(searchavailspec($allspec, $spec34),$count);
			$count=countoverzero(searchavailspec($allspec, $spec57),$count);
			$count=countoverzero(searchavailspec($allspec, $spec61),$count);
			$count=countoverzero(searchavailspec($allspec, $spec84),$count);
			$count=countoverzero(searchavailspec($allspec, $spec85),$count);
			$count=countoverzero(searchavailspec($allspec, $spec95),$count);
			$count=countoverzero(searchavailspec($allspec, $spec97),$count);
			$count=countoverzero(searchavailspec($allspec, $spec113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec144),$count);
			$count=countoverzero(searchavailspec($allspec, $spec145),$count);
			$count=countoverzero(searchavailspec($allspec, $spec146),$count);
			$count=countoverzero(searchavailspec($allspec, $spec276),$count);
			$count=countoverzero(searchavailspec($allspec, $spec277),$count);
			$count=countoverzero(searchavailspec($allspec, $spec20113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700024),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700026),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700030),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700033),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700034),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700057),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700061),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700084),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700085),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700095),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700097),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec710113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700024),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700026),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700030),$count);			
			$count=countoverzero(searchavailspec($allspec, $spec17700033),$count);							
			$count=countoverzero(searchavailspec($allspec, $spec17700084),$count);	
			$count=countoverzero(searchavailspec($allspec, $spec17700085),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700061),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700097),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700024),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700026),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700030),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700033),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700034),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700057),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700061),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700084),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700085),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700095),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700097),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700276),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700277),$count);
			
			if((searchavailspec($allspec, $spec40)+
				searchavailspec($allspec, $spec187)+
				searchavailspec($allspec, $spec18700187)+
				searchavailspec($allspec, $spec188)+
				searchavailspec($allspec, $spec189)+
				searchavailspec($allspec, $spec700187))<3){
			echo '<div class="red">Количество руководителей проекта меньше 3</div>';
				}		
			else {
			echo '<div class="green">Количество руководителей проекта 3 или больше</div>';		
				}
			if	($count<8)
				{
				echo '<div class="red">Количество специалистов по техническому надзору меньше 8</div>';
				}		
			else {
				echo '<div class="green">Количество специалистов по техническому надзору 8 или больше</div>';
				}	
		break;
		
		case $type208:
			if((searchavailspec($allspec, $spec700024)+
				searchavailspec($allspec, $spec144)+
				searchavailspec($allspec, $spec145)+
				searchavailspec($allspec, $spec146)+
				searchavailspec($allspec, $spec24)+
				searchavailspec($allspec, $spec18700024)+
				searchavailspec($allspec, $spec17700024))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (общестроительные работы)</div>';
				}
		break;
		
		case $type209:
			if((searchavailspec($allspec, $spec700026)+
				searchavailspec($allspec, $spec26)+
				searchavailspec($allspec, $spec18700026)+
				searchavailspec($allspec, $spec17700026))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</div>';
				}
		break;
		
		case $type210:
			if((searchavailspec($allspec, $spec700026)+
				searchavailspec($allspec, $spec26)+
				searchavailspec($allspec, $spec18700026)+
				searchavailspec($allspec, $spec17700026))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</div>';
				}
		break;
		
		case $type211:
			if((searchavailspec($allspec, $spec700026)+
				searchavailspec($allspec, $spec26)+
				searchavailspec($allspec, $spec18700026)+
				searchavailspec($allspec, $spec17700026)+
				searchavailspec($allspec, $spec95)+
				searchavailspec($allspec, $spec18700095)+
				searchavailspec($allspec, $spec700095))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</div>';
				}
		break;
		
		case $type212:
			if((searchavailspec($allspec, $spec700057)+
			searchavailspec($allspec, $spec18700057)+
				searchavailspec($allspec, $spec57))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области газоснабжения)</div>';
				}
		break;

		case $type213:
			if((searchavailspec($allspec, $spec700030)+
				searchavailspec($allspec, $spec30)+
				searchavailspec($allspec, $spec18700030)+
				searchavailspec($allspec, $spec17700030))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области электроснабжения и автоматизации)</div>';
				}
		break;

		case $type214:
			if((searchavailspec($allspec, $spec700097)+
				searchavailspec($allspec, $spec97)+
				searchavailspec($allspec, $spec18700097)+
				searchavailspec($allspec, $spec17700097))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области связи, сигнализации)</div>';
				}
		break;

		case $type215:
			if((searchavailspec($allspec, $spec700033)+
				searchavailspec($allspec, $spec33)+
				searchavailspec($allspec, $spec18700033)+
				searchavailspec($allspec, $spec17700033))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (строительство автомобильных дорог и аэродромов, строительство мостов, транспортных эстакад и путепроводов)</div>';
				}
		break;

		case $type216:
			if((searchavailspec($allspec, $spec700084)+
				searchavailspec($allspec, $spec84)+
				searchavailspec($allspec, $spec18700084)+
				searchavailspec($allspec, $spec17700084))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (строительство железных дорог)</div>';
				}
		break;

		case $type217:
			if((searchavailspec($allspec, $spec700085)+
				searchavailspec($allspec, $spec85)+
				searchavailspec($allspec, $spec18700085)+
				searchavailspec($allspec, $spec17700085))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (строительство сооружений транспортных тоннелей, метрополитенов)</div>';
				}
		break;

		case $type218:
			if((searchavailspec($allspec, $spec700034)+
			searchavailspec($allspec, $spec18700034)+
				searchavailspec($allspec, $spec34))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (гидротехническое и мелиоративное строительство)</div>';
				}
		break;

		case $type219:
			if((searchavailspec($allspec, $spec710113)+
				searchavailspec($allspec, $spec20113)+
				searchavailspec($allspec, $spec700113)+
				searchavailspec($allspec, $spec18700113)+
				searchavailspec($allspec, $spec113))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (благоустройство территорий)</div>';
				}
		break;

		case $type220:
			if((searchavailspec($allspec, $spec700064)+
				searchavailspec($allspec, $spec3)+
				searchavailspec($allspec, $spec64))>=4 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Количество специалистов ГАП меньше 4</div>';
				}
		break;
		
		case $type221:
		case $type222:
		case $type223:
		case $type224:
		case $type225:
		case $type226:
		break;
		
		case $type227:
			if((searchavailspec($allspec, $spec71043)+
				searchavailspec($allspec, $spec71044)+
				searchavailspec($allspec, $spec71045)+
				searchavailspec($allspec, $spec71039)+
				searchavailspec($allspec, $spec71046)+
				searchavailspec($allspec, $spec71048)+
				searchavailspec($allspec, $spec71047)+
				searchavailspec($allspec, $spec71059)+
				searchavailspec($allspec, $spec71063)+
				searchavailspec($allspec, $spec71074)+
				searchavailspec($allspec, $spec700128)+
				searchavailspec($allspec, $spec700047)+
				searchavailspec($allspec, $spec710128)+
				searchavailspec($allspec, $spec700048)+
				searchavailspec($allspec, $spec700045)+
				searchavailspec($allspec, $spec700046)+
				searchavailspec($allspec, $spec700073)+
				searchavailspec($allspec, $spec700059)+
				searchavailspec($allspec, $spec700039)+
				searchavailspec($allspec, $spec700126)+
				searchavailspec($allspec, $spec700043)+
				searchavailspec($allspec, $spec700096)+
				searchavailspec($allspec, $spec700074)+
				searchavailspec($allspec, $spec700063)+
				searchavailspec($allspec, $spec700044)+
				searchavailspec($allspec, $spec150)+
				searchavailspec($allspec, $spec17700043)+
				searchavailspec($allspec, $spec17700044)+
				searchavailspec($allspec, $spec45)+
				searchavailspec($allspec, $spec39)+
				searchavailspec($allspec, $spec17700046)+
				searchavailspec($allspec, $spec17700048)+
				searchavailspec($allspec, $spec17700047)+
				searchavailspec($allspec, $spec17700059)+
				searchavailspec($allspec, $spec63)+
				searchavailspec($allspec, $spec73)+
				searchavailspec($allspec, $spec96)+
				searchavailspec($allspec, $spec17700074)+
				searchavailspec($allspec, $spec126)+
				searchavailspec($allspec, $spec128)+
				searchavailspec($allspec, $spec278)+
				searchavailspec($allspec, $spec43)+
				searchavailspec($allspec, $spec44)+
				searchavailspec($allspec, $spec46)+
				searchavailspec($allspec, $spec48)+
				searchavailspec($allspec, $spec47)+
				searchavailspec($allspec, $spec59)+
				searchavailspec($allspec, $spec74)+
				searchavailspec($allspec, $spec260)+
				searchavailspec($allspec, $spec261)+
				searchavailspec($allspec, $spec262)+
				searchavailspec($allspec, $spec263))<1){
			echo '<div class="red">Нет ни одного главного инженера<br></div>';
				}
			else{
			echo '<div class="green">Главный инженер есть<br></div>';}	

			if((searchavailspec($allspec, $spec710114)+
				searchavailspec($allspec, $spec710115)+
				searchavailspec($allspec, $spec710116)+
				searchavailspec($allspec, $spec710117)+
				searchavailspec($allspec, $spec710118)+
				searchavailspec($allspec, $spec710119)+
				searchavailspec($allspec, $spec710120)+
				searchavailspec($allspec, $spec710121)+
				searchavailspec($allspec, $spec710122)+
				searchavailspec($allspec, $spec710123)+
				searchavailspec($allspec, $spec710124)+
				searchavailspec($allspec, $spec710125)+
				searchavailspec($allspec, $spec700120)+
				searchavailspec($allspec, $spec700115)+
				searchavailspec($allspec, $spec700122)+
				searchavailspec($allspec, $spec700124)+
				searchavailspec($allspec, $spec700125)+
				searchavailspec($allspec, $spec700114)+
				searchavailspec($allspec, $spec700117)+
				searchavailspec($allspec, $spec700121)+
				searchavailspec($allspec, $spec700123)+
				searchavailspec($allspec, $spec700118)+
				searchavailspec($allspec, $spec700116)+
				searchavailspec($allspec, $spec700119)+
				searchavailspec($allspec, $spec700147)+
				searchavailspec($allspec, $spec247)+
				searchavailspec($allspec, $spec147)+
				searchavailspec($allspec, $spec17700114)+
				searchavailspec($allspec, $spec17700115)+
				searchavailspec($allspec, $spec116)+
				searchavailspec($allspec, $spec117)+
				searchavailspec($allspec, $spec17700118)+
				searchavailspec($allspec, $spec119)+
				searchavailspec($allspec, $spec17700120)+
				searchavailspec($allspec, $spec17700121)+
				searchavailspec($allspec, $spec122)+
				searchavailspec($allspec, $spec123)+
				searchavailspec($allspec, $spec17700124)+
				searchavailspec($allspec, $spec125)+
				searchavailspec($allspec, $spec114)+
				searchavailspec($allspec, $spec115)+
				searchavailspec($allspec, $spec118)+
				searchavailspec($allspec, $spec120)+
				searchavailspec($allspec, $spec121)+
				searchavailspec($allspec, $spec124)+
				searchavailspec($allspec, $spec264)+
				searchavailspec($allspec, $spec265)+
				searchavailspec($allspec, $spec266))<1){
			echo '<div class="red">Нет ни одного начальника (заместителя) ПТО<br></div>';
				}
			else {
			echo '<div class="green">Начальник (заместитель) ПТО есть<br></div>';}		
		
			if((searchavailspec($allspec, $spec700141)+
				searchavailspec($allspec, $spec141))<1){
			echo '<div class="red">Нет ни одного инженера по сметной работе<br></div>';
				}
			else {
			echo '<div class="green">Инженер по сметной работе есть<br></div>';}		

		break;
		
		case $type5827:
		break;
		
		case $type5828:
			if((searchavailspec($allspec, $spec71043)+
				searchavailspec($allspec, $spec71044)+
				searchavailspec($allspec, $spec71045)+
				searchavailspec($allspec, $spec71039)+
				searchavailspec($allspec, $spec71046)+
				searchavailspec($allspec, $spec71048)+
				searchavailspec($allspec, $spec71047)+
				searchavailspec($allspec, $spec71059)+
				searchavailspec($allspec, $spec71063)+
				searchavailspec($allspec, $spec71074)+
				searchavailspec($allspec, $spec700128)+
				searchavailspec($allspec, $spec700047)+
				searchavailspec($allspec, $spec710128)+
				searchavailspec($allspec, $spec700048)+
				searchavailspec($allspec, $spec700045)+
				searchavailspec($allspec, $spec700046)+
				searchavailspec($allspec, $spec700073)+
				searchavailspec($allspec, $spec700059)+
				searchavailspec($allspec, $spec700039)+
				searchavailspec($allspec, $spec700126)+
				searchavailspec($allspec, $spec700043)+
				searchavailspec($allspec, $spec700096)+
				searchavailspec($allspec, $spec700074)+
				searchavailspec($allspec, $spec700063)+
				searchavailspec($allspec, $spec700044)+
				searchavailspec($allspec, $spec150)+
				searchavailspec($allspec, $spec17700043)+
				searchavailspec($allspec, $spec17700044)+
				searchavailspec($allspec, $spec45)+
				searchavailspec($allspec, $spec39)+
				searchavailspec($allspec, $spec17700046)+
				searchavailspec($allspec, $spec17700048)+
				searchavailspec($allspec, $spec17700047)+
				searchavailspec($allspec, $spec17700059)+
				searchavailspec($allspec, $spec63)+
				searchavailspec($allspec, $spec73)+
				searchavailspec($allspec, $spec96)+
				searchavailspec($allspec, $spec17700074)+
				searchavailspec($allspec, $spec126)+
				searchavailspec($allspec, $spec128)+
				searchavailspec($allspec, $spec278)+
				searchavailspec($allspec, $spec43)+
				searchavailspec($allspec, $spec44)+
				searchavailspec($allspec, $spec46)+
				searchavailspec($allspec, $spec48)+
				searchavailspec($allspec, $spec47)+
				searchavailspec($allspec, $spec59)+
				searchavailspec($allspec, $spec74)+
				searchavailspec($allspec, $spec260)+
				searchavailspec($allspec, $spec261)+
				searchavailspec($allspec, $spec262)+
				searchavailspec($allspec, $spec263))<1){
			echo '<div class="red">Нет ни одного главного инженера<br></div>';
				}
			else {echo '<div class="green">Главный инженер есть<br></div>';}	

			if((searchavailspec($allspec, $spec710114)+
				searchavailspec($allspec, $spec710115)+
				searchavailspec($allspec, $spec710116)+
				searchavailspec($allspec, $spec710117)+
				searchavailspec($allspec, $spec710118)+
				searchavailspec($allspec, $spec710119)+
				searchavailspec($allspec, $spec710120)+
				searchavailspec($allspec, $spec710121)+
				searchavailspec($allspec, $spec710122)+
				searchavailspec($allspec, $spec710123)+
				searchavailspec($allspec, $spec710124)+
				searchavailspec($allspec, $spec710125)+
				searchavailspec($allspec, $spec700120)+
				searchavailspec($allspec, $spec700115)+
				searchavailspec($allspec, $spec700122)+
				searchavailspec($allspec, $spec700124)+
				searchavailspec($allspec, $spec700125)+
				searchavailspec($allspec, $spec700114)+
				searchavailspec($allspec, $spec700117)+
				searchavailspec($allspec, $spec700121)+
				searchavailspec($allspec, $spec700123)+
				searchavailspec($allspec, $spec700118)+
				searchavailspec($allspec, $spec700116)+
				searchavailspec($allspec, $spec700119)+
				searchavailspec($allspec, $spec700147)+
				searchavailspec($allspec, $spec247)+
				searchavailspec($allspec, $spec147)+
				searchavailspec($allspec, $spec17700114)+
				searchavailspec($allspec, $spec17700115)+
				searchavailspec($allspec, $spec116)+
				searchavailspec($allspec, $spec117)+
				searchavailspec($allspec, $spec17700118)+
				searchavailspec($allspec, $spec119)+
				searchavailspec($allspec, $spec17700120)+
				searchavailspec($allspec, $spec17700121)+
				searchavailspec($allspec, $spec122)+
				searchavailspec($allspec, $spec123)+
				searchavailspec($allspec, $spec17700124)+
				searchavailspec($allspec, $spec125)+
				searchavailspec($allspec, $spec114)+
				searchavailspec($allspec, $spec115)+
				searchavailspec($allspec, $spec118)+
				searchavailspec($allspec, $spec120)+
				searchavailspec($allspec, $spec121)+
				searchavailspec($allspec, $spec124)+
				searchavailspec($allspec, $spec264)+
				searchavailspec($allspec, $spec265)+
				searchavailspec($allspec, $spec266))<1){
			echo '<div class="red">Нет ни одного начальника (заместителя) ПТО<br></div>';
				}
			else {
			echo '<div class="green">Начальник (заместитель) ПТО есть<br></div>';}		
		
		if	
		((searchavailspec($allspec, $spec700141)+
		searchavailspec($allspec, $spec141))<1)
		
				{
				echo '<div class="red">Нет ни одного инженера по сметной работе<br></div>';
				}
		else {echo '<div class="green">Инженер по сметной работе есть<br></div>';}		

		break;		
		
		case $type5829:
		if((searchavailspec($allspec, $spec71043)+
		searchavailspec($allspec, $spec71044)+
		searchavailspec($allspec, $spec71045)+
		searchavailspec($allspec, $spec71039)+
		searchavailspec($allspec, $spec71046)+
		searchavailspec($allspec, $spec71048)+
		searchavailspec($allspec, $spec71047)+
		searchavailspec($allspec, $spec71059)+
		searchavailspec($allspec, $spec71063)+
		searchavailspec($allspec, $spec71074)+
		searchavailspec($allspec, $spec700128)+
		searchavailspec($allspec, $spec700047)+
		searchavailspec($allspec, $spec710128)+
		searchavailspec($allspec, $spec700048)+
		searchavailspec($allspec, $spec700045)+
		searchavailspec($allspec, $spec700046)+
		searchavailspec($allspec, $spec700073)+
		searchavailspec($allspec, $spec700059)+
		searchavailspec($allspec, $spec700039)+
		searchavailspec($allspec, $spec700126)+
		searchavailspec($allspec, $spec700043)+
		searchavailspec($allspec, $spec700096)+
		searchavailspec($allspec, $spec700074)+
		searchavailspec($allspec, $spec700063)+
		searchavailspec($allspec, $spec700044)+
		searchavailspec($allspec, $spec150)+
		searchavailspec($allspec, $spec17700043)+
		searchavailspec($allspec, $spec17700044)+
		searchavailspec($allspec, $spec45)+
		searchavailspec($allspec, $spec39)+
		searchavailspec($allspec, $spec17700046)+
		searchavailspec($allspec, $spec17700048)+
		searchavailspec($allspec, $spec17700047)+
		searchavailspec($allspec, $spec17700059)+
		searchavailspec($allspec, $spec63)+
		searchavailspec($allspec, $spec73)+
		searchavailspec($allspec, $spec96)+
		searchavailspec($allspec, $spec17700074)+
		searchavailspec($allspec, $spec126)+
		searchavailspec($allspec, $spec128)+
		searchavailspec($allspec, $spec278)+
		searchavailspec($allspec, $spec43)+
		searchavailspec($allspec, $spec44)+
		searchavailspec($allspec, $spec46)+
		searchavailspec($allspec, $spec48)+
		searchavailspec($allspec, $spec47)+
		searchavailspec($allspec, $spec59)+
		searchavailspec($allspec, $spec74)+
		searchavailspec($allspec, $spec260)+
		searchavailspec($allspec, $spec261)+
		searchavailspec($allspec, $spec262)+
		searchavailspec($allspec, $spec263))<1)
		{
				echo '<div class="red">Нет ни одного главного инженера<br></div>';
				}
				else {echo '<div class="green">Главный инженер есть<br></div>';}	

		if	
		((searchavailspec($allspec, $spec710114)+
		searchavailspec($allspec, $spec710115)+
		searchavailspec($allspec, $spec710116)+
		searchavailspec($allspec, $spec710117)+
		searchavailspec($allspec, $spec710118)+
		searchavailspec($allspec, $spec710119)+
		searchavailspec($allspec, $spec710120)+
		searchavailspec($allspec, $spec710121)+
		searchavailspec($allspec, $spec710122)+
		searchavailspec($allspec, $spec710123)+
		searchavailspec($allspec, $spec710124)+
		searchavailspec($allspec, $spec710125)+
		searchavailspec($allspec, $spec700120)+
		searchavailspec($allspec, $spec700115)+
		searchavailspec($allspec, $spec700122)+
		searchavailspec($allspec, $spec700124)+
		searchavailspec($allspec, $spec700125)+
		searchavailspec($allspec, $spec700114)+
		searchavailspec($allspec, $spec700117)+
		searchavailspec($allspec, $spec700121)+
		searchavailspec($allspec, $spec700123)+
		searchavailspec($allspec, $spec700118)+
		searchavailspec($allspec, $spec700116)+
		searchavailspec($allspec, $spec700119)+
		searchavailspec($allspec, $spec700147)+
		searchavailspec($allspec, $spec247)+
		searchavailspec($allspec, $spec147)+
		searchavailspec($allspec, $spec17700114)+
		searchavailspec($allspec, $spec17700115)+
		searchavailspec($allspec, $spec116)+
		searchavailspec($allspec, $spec117)+
		searchavailspec($allspec, $spec17700118)+
		searchavailspec($allspec, $spec119)+
		searchavailspec($allspec, $spec17700120)+
		searchavailspec($allspec, $spec17700121)+
		searchavailspec($allspec, $spec122)+
		searchavailspec($allspec, $spec123)+
		searchavailspec($allspec, $spec17700124)+
		searchavailspec($allspec, $spec125)+
		searchavailspec($allspec, $spec114)+
		searchavailspec($allspec, $spec115)+
		searchavailspec($allspec, $spec118)+
		searchavailspec($allspec, $spec120)+
		searchavailspec($allspec, $spec121)+
		searchavailspec($allspec, $spec124)+
		searchavailspec($allspec, $spec264)+
		searchavailspec($allspec, $spec265)+
		searchavailspec($allspec, $spec266))<1)
		
				{
				echo '<div class="red">Нет ни одного начальника (заместителя) ПТО<br></div>';
				}
				else {echo '<div class="green">Начальник (заместитель) ПТО есть<br></div>';}		
		
		if	
		((searchavailspec($allspec, $spec700141)+
		searchavailspec($allspec, $spec141))<1)
		
				{
				echo '<div class="red">Нет ни одного инженера по сметной работе<br></div>';
				}
		else {echo '<div class="green">Инженер по сметной работе есть<br></div>';}		

		break;
		
		
		case $type228:
		break;
		
		case $type229:
		case $type5864:
			if((searchavailspec($allspec, $spec140)+
				searchavailspec($allspec, $spec142)+
				searchavailspec($allspec, $spec700140)+
				searchavailspec($allspec, $spec700142))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного главного или ведущего геодезиста</div>';
				}
		break;
		
		case $type230:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type231:
			if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec15)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec16)+searchavailspec($allspec, $spec76)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec78)+
				searchavailspec($allspec, $spec79)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec81)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700216)+searchavailspec($allspec, $spec17700243)+
				searchavailspec($allspec, $spec17700245)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec245)+searchavailspec($allspec, $spec205)+
				searchavailspec($allspec, $spec231)+searchavailspec($allspec, $spec233)+
				searchavailspec($allspec, $spec234)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec215)+
				searchavailspec($allspec, $spec216)+searchavailspec($allspec, $spec243))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type232:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+					
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type233:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type234:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+				
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type235:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type236:
			if((searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+				
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700203)+				
				searchavailspec($allspec, $spec17700223)+								
				searchavailspec($allspec, $spec17700231))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type237:
				if((searchavailspec($allspec, $spec0)+
					searchavailspec($allspec, $spec9)+
					searchavailspec($allspec, $spec11)+
					searchavailspec($allspec, $spec12)+
					searchavailspec($allspec, $spec15)+
					searchavailspec($allspec, $spec18)+
					searchavailspec($allspec, $spec19)+
					searchavailspec($allspec, $spec16)+
					searchavailspec($allspec, $spec41)+
					searchavailspec($allspec, $spec76)+
					searchavailspec($allspec, $spec77)+
					searchavailspec($allspec, $spec78)+
					searchavailspec($allspec, $spec79)+
					searchavailspec($allspec, $spec80)+
					searchavailspec($allspec, $spec81)+
					searchavailspec($allspec, $spec82)+
					searchavailspec($allspec, $spec83)+
					searchavailspec($allspec, $spec194)+
					searchavailspec($allspec, $spec195)+
					searchavailspec($allspec, $spec196)+
					searchavailspec($allspec, $spec198)+
					searchavailspec($allspec, $spec199)+
					searchavailspec($allspec, $spec203)+
					searchavailspec($allspec, $spec205)+
					searchavailspec($allspec, $spec206)+
					searchavailspec($allspec, $spec208)+
					searchavailspec($allspec, $spec215)+
					searchavailspec($allspec, $spec216)+
					searchavailspec($allspec, $spec222)+
					searchavailspec($allspec, $spec223)+
					searchavailspec($allspec, $spec224)+
					searchavailspec($allspec, $spec226)+
					searchavailspec($allspec, $spec227)+
					searchavailspec($allspec, $spec231)+
					searchavailspec($allspec, $spec233)+
					searchavailspec($allspec, $spec234)+
					searchavailspec($allspec, $spec236)+
					searchavailspec($allspec, $spec243)+
					searchavailspec($allspec, $spec245)+
					searchavailspec($allspec, $spec17700195)+
					searchavailspec($allspec, $spec17700199)+
					searchavailspec($allspec, $spec17700203)+
					searchavailspec($allspec, $spec17700205)+
					searchavailspec($allspec, $spec17700209)+
					searchavailspec($allspec, $spec17700215)+
					searchavailspec($allspec, $spec17700216)+
					searchavailspec($allspec, $spec17700223)+
					searchavailspec($allspec, $spec17700231)+
					searchavailspec($allspec, $spec17700233)+
					searchavailspec($allspec, $spec17700234)+
					searchavailspec($allspec, $spec17700237)+
					searchavailspec($allspec, $spec17700243)+
					searchavailspec($allspec, $spec17700245))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type238:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;			
		
		case $type239:
				if((searchavailspec($allspec, $spec9)+
					searchavailspec($allspec, $spec18)+
					searchavailspec($allspec, $spec19)+
					searchavailspec($allspec, $spec41)+
					searchavailspec($allspec, $spec82)+
					searchavailspec($allspec, $spec83)+
					searchavailspec($allspec, $spec194)+
					searchavailspec($allspec, $spec195)+
					searchavailspec($allspec, $spec196)+
					searchavailspec($allspec, $spec198)+
					searchavailspec($allspec, $spec199)+
					searchavailspec($allspec, $spec209)+
					searchavailspec($allspec, $spec222)+
					searchavailspec($allspec, $spec223)+
					searchavailspec($allspec, $spec224)+
					searchavailspec($allspec, $spec226)+
					searchavailspec($allspec, $spec227)+
					searchavailspec($allspec, $spec237)+
					searchavailspec($allspec, $spec17700195)+
					searchavailspec($allspec, $spec17700199)+
					searchavailspec($allspec, $spec17700209)+
					searchavailspec($allspec, $spec17700223)+
					searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type240:
		case $type5869:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec267)+searchavailspec($allspec, $spec271))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type241:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type242:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type243:
		case $type5872:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type244:
		case $type5873:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type245:
		case $type5874:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec76)+searchavailspec($allspec, $spec77)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec17700195)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700197)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec17700203)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec197)+searchavailspec($allspec, $spec225)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec205)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec233)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type246:
		case $type5875:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type247:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

	
		case $type248:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec110)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700211)+searchavailspec($allspec, $spec17700239)+
				searchavailspec($allspec, $spec211)+searchavailspec($allspec, $spec239)+				
				searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type249:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type250:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type251:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type252:
				if((searchavailspec($allspec, $spec11)+
					searchavailspec($allspec, $spec76)+
					searchavailspec($allspec, $spec203)+
					searchavailspec($allspec, $spec205)+
					searchavailspec($allspec, $spec212)+
					searchavailspec($allspec, $spec231)+
					searchavailspec($allspec, $spec233)+
					searchavailspec($allspec, $spec235)+
					searchavailspec($allspec, $spec17700203)+
					searchavailspec($allspec, $spec17700205)+
					searchavailspec($allspec, $spec17700231)+
					searchavailspec($allspec, $spec17700233))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}	
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;	

		case $type253:
				if((searchavailspec($allspec, $spec11)+
					searchavailspec($allspec, $spec77)+
					searchavailspec($allspec, $spec203)+
					searchavailspec($allspec, $spec204)+
					searchavailspec($allspec, $spec231)+
					searchavailspec($allspec, $spec232)+
					searchavailspec($allspec, $spec17700203)+
					searchavailspec($allspec, $spec17700204)+
					searchavailspec($allspec, $spec17700231)+
					searchavailspec($allspec, $spec17700232))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
			else if ((searchavailspec($allspec, $spec62)+
					  searchavailspec($allspec, $spec240)+
					  searchavailspec($allspec, $spec212))<1)	
			{
				echo '<div class="red">Нет прораба(мастера) по установке приборов учета тепло- и водопотребления</div>';
				}	
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;
		
		case $type254:
				if((searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec234))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;		
		
		case $type255:
				if((searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec207)+searchavailspec($allspec, $spec234))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))<1)	
			{
				echo '<div class="red">Нет прораба(мастера) по установке приборов учета тепло- и водопотребления</div>';
				}	
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;		
		
		case $type256:
		case $type5885:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec17700216)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700245)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec245)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec216))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;

		case $type257:
		case $type5886:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec81)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700246)+
				searchavailspec($allspec, $spec17700217)+searchavailspec($allspec, $spec17700215)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec217)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec246))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type258:
		break;		
		
		case $type259:
				if((searchavailspec($allspec, $spec13)+searchavailspec($allspec, $spec193)+searchavailspec($allspec, $spec221))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type260:
		case $type5888:
				if((searchavailspec($allspec, $spec0)+searchavailspec($allspec, $spec16)+
				searchavailspec($allspec, $spec218)+searchavailspec($allspec, $spec244))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type261:
				if((searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec206)+searchavailspec($allspec, $spec207)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec234))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type262:
				if((searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec222))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type263:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type264:
		case $type5892:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type265:
				if((searchavailspec($allspec, $spec710112)+searchavailspec($allspec, $spec112)+
				searchavailspec($allspec, $spec20112)+searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec220))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;			
		
		case $type266:
				if((searchavailspec($allspec, $spec82)+searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec224))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;			
		
		case $type267:
				if((searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700237)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type268:
		break;		
		
		case $type269:
		break;		


		case $type270:
						if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)
					+searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type271:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5753:
		if((searchavailspec($allspec, $spec700093)+searchavailspec($allspec, $spec700135)+
				searchavailspec($allspec, $spec800135)+searchavailspec($allspec, $spec93)+
				searchavailspec($allspec, $spec17700135))>=5){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		}
			
		}

	}
	else{	

for ($i = 0; $i <= count($types_of_jobs[$k]->field_field_vidy_rabot_13_05_2017_); $i++) 
		{ 
			$types_of_jobs2=$types_of_jobs[$k]->field_field_vidy_rabot_13_05_2017_[$i][raw];
			$types_of_jobs3=$types_of_jobs2[taxonomy_term]->name;
			$vidyrabot[$k][$i]=$types_of_jobs3; // переменная для вывода вне массива
			$condition2=substr_count($types_of_jobs3, $type5594);
			print_r ("</br>".$types_of_jobs3."</br>");
		
		switch ($types_of_jobs3) {
        case $type5594:
		case $type5907:
		break;
		
		case $type5595:
		case $type5908:
		if((searchavailspec($allspec, $spec700166)+searchavailspec($allspec, $spec166)+searchavailspec($allspec, $spec173))>=10){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-геодезические изыскания меньше 10</div>';
				}
		break;		
			
		case $type5616:
		case $type5909:
			if((searchavailspec($allspec, $spec700167)+searchavailspec($allspec, $spec167)+searchavailspec($allspec, $spec174))>=10){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-геологические изыскания меньше 10</div>';
				}
		break;		
		
		case $type5625:
		case $type5910:
			if((searchavailspec($allspec, $spec700168)+searchavailspec($allspec, $spec168))>=10){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-гидрометеорологические изыскания меньше 10</div>';
				}
		break;		
			
		case $type5630:
			if((searchavailspec($allspec, $spec700169)+searchavailspec($allspec, $spec169))>=10){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-экологические изыскания меньше 10</div>';
				}
		break;		
		
		case $type5647:
			if((searchavailspec($allspec, $spec700170)+searchavailspec($allspec, $spec170))>=10){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-геотехнические изыскания меньше 10</div>';
				}
		break;	

       case $type5648:
	   break;
	   case $type5649:
	   break;
	   case $type5650:
	   break;
	   case $type5651:
	   break;
	   case $type5652:
	   break;
	   case $type5653:
	   break;
		
		case $type5654:
			if((searchavailspec($allspec, $spec171)+searchavailspec($allspec, $spec171))>=10){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих обследование состояния грунтов оснований зданий и сооружений меньше 10</div>';
				}
		break;	
			
		case $type5655:
			if((searchavailspec($allspec, $spec700064)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3))>=1 or 
			(searchavailspec($allspec, $spec4)+searchavailspec($allspec, $spec700129)+searchavailspec($allspec, $spec700004)+searchavailspec($allspec, $spec148)+searchavailspec($allspec, $spec17700129)+searchavailspec($allspec, $spec129)+searchavailspec($allspec, $spec275))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного специалиста ГАП или ГИП</div>';
				}
		break;		
			
		case $type5656:
		case $type5911:
			if((searchavailspec($allspec, $spec101)+
				searchavailspec($allspec, $spec102)+
				searchavailspec($allspec, $spec103)+
				searchavailspec($allspec, $spec104)+
				searchavailspec($allspec, $spec105)+
				searchavailspec($allspec, $spec106)+
				searchavailspec($allspec, $spec107)+
				searchavailspec($allspec, $spec108)+
				searchavailspec($allspec, $spec109)+
				searchavailspec($allspec, $spec137)+
				searchavailspec($allspec, $spec138)+
				searchavailspec($allspec, $spec162)+		
				searchavailspec($allspec, $spec700101)+
				searchavailspec($allspec, $spec700102)+
				searchavailspec($allspec, $spec700103)+
				searchavailspec($allspec, $spec700104)+
				searchavailspec($allspec, $spec700105)+
				searchavailspec($allspec, $spec700106)+
				searchavailspec($allspec, $spec700107)+
				searchavailspec($allspec, $spec700108)+
				searchavailspec($allspec, $spec700109)+
				searchavailspec($allspec, $spec700137)+
				searchavailspec($allspec, $spec700138)+
				searchavailspec($allspec, $spec700162)+
				searchavailspec($allspec, $spec17700101)+
				searchavailspec($allspec, $spec17700102)+
				searchavailspec($allspec, $spec17700103)+
				searchavailspec($allspec, $spec17700104)+
				searchavailspec($allspec, $spec17700105)+
				searchavailspec($allspec, $spec17700106)+
				searchavailspec($allspec, $spec17700107)+
				searchavailspec($allspec, $spec17700108)+
				searchavailspec($allspec, $spec17700109))<1) 
			 {
				echo '<div class="red">Нет ни одного аттестованного начальника (заведующего) структурного подразделения</div>';
				}
			else
				{
				echo '<div class="green">Начальник (заведующий) структурного подразделения есть</div>';
				}			
			if	((searchavailspec($allspec, $spec3)+
					  searchavailspec($allspec, $spec64)+
					  searchavailspec($allspec, $spec700064))<4
					  and
					 (searchavailspec($allspec, $spec4)+
					  searchavailspec($allspec, $spec129)+
					  searchavailspec($allspec, $spec148)+
					  searchavailspec($allspec, $spec275)+
					  searchavailspec($allspec, $spec700004)+
					  searchavailspec($allspec, $spec700129)+
					  searchavailspec($allspec, $spec17700129))<4)
             {
				echo '<div class="red">Количество специалистов ГАП или ГИП меньше 4</div>';
				}
			 else
				{
				echo '<div class="green">Количество специалистов ГАП или ГИП 4 или более</div>';
				} 
			 if (searchavailspec($allspec, $spec248)<1)
			{
				echo '<div class="red">Нет ни одного главного специалиста по охране окружающей среды</div>';
				} 
			else
			{
				echo '<div class="green">Специалист по охране окружающей среды есть</div>';
				}	
			if ((searchavailspec($allspec, $spec164)+
					 searchavailspec($allspec, $spec700164))<1)
			{
				echo '<div class="red">Нет ни одного главного специалиста по организации строительства</div>';
				} 
			else
			{
				echo '<div class="green">Главный специалист по организации строительства есть</div>';
				}	
			if (searchavailspec($allspec, $spec249)<1)
			{
				echo '<div class="red">Нет ни одного главного специалиста по инженерно-техническим мероприятиям гражданской обороны</div>';
				}
			else {
			echo '<div class="green">Главный специалист по инженерно-техническим мероприятиям гражданской обороны есть</div>';
				}
		break;		
		
		case $type5657:
        case $type5912:
		break;
		
		case $type5658:
		case $type5913:
			if((searchavailspec($allspec, $spec700163)+searchavailspec($allspec, $spec163))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (генеральный план)</div>';
				}
		break;		
			
		case $type5659:
		case $type5914:
			if((searchavailspec($allspec, $spec252)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3)+searchavailspec($allspec, $spec700064))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (архитектурные решения) либо ГАПа</div>';
				}
		break;		
				
		case $type5660:
		case $type5915:
			if(searchavailspec($allspec, $spec139)+
			   searchavailspec($allspec, $spec700139)>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (сметная документация)</div>';
				}
		break;		
		
		case $type5661:
		case $type5916:
		if((searchavailspec($allspec, $spec66)+searchavailspec($allspec, $spec17700066)+searchavailspec($allspec, $spec700066))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (конструктивные решения)</div>';
				}			
		break;		
		
		case $type5662:
		case $type5917:
		break;
		
		case $type5664:
		case $type5919:
			if((searchavailspec($allspec, $spec17700071)+searchavailspec($allspec, $spec700071)+searchavailspec($allspec, $spec71))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (холодоснабжение))</div>';
				}
		break;		
				
		case $type5665:
		case $type5920:
			if((searchavailspec($allspec, $spec17700067)+searchavailspec($allspec, $spec700067)+searchavailspec($allspec, $spec67))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</div>';
				}
		break;		
		
		case $type5666:
		case $type5921:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</div>';
				}
		break;
				
		case $type5667:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</div>';
				}
		break;		
		
		case $type5663:
		case $type5918:
			if((searchavailspec($allspec, $spec17700068)+searchavailspec($allspec, $spec700068)+searchavailspec($allspec, $spec68))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (отопление, вентиляция и кондиционирование воздуха))</div>';
				}
		break;		
							
		case $type5668:
		case $type5922:
			if((searchavailspec($allspec, $spec17700099)+searchavailspec($allspec, $spec700099)+searchavailspec($allspec, $spec99))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</div>';
				}
		break;		
		
		case $type5669:
		case $type5923:
			if((searchavailspec($allspec, $spec17700069)+searchavailspec($allspec, $spec700069)+searchavailspec($allspec, $spec69))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</div>';
				}
		break;
		
		case $type5670:
		case $type5924:
		break;			
		
		case $type5671:
		case $type5925:
			if((searchavailspec($allspec, $spec17700070)+searchavailspec($allspec, $spec700070)+searchavailspec($allspec, $spec70))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (тепловые сети))</div>';
				}
		break;		
			
		case $type5672:
		case $type5926:
			if((searchavailspec($allspec, $spec67)+
				searchavailspec($allspec, $spec700067)+
				searchavailspec($allspec, $spec17700067))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</div>';
				}
		break;		
		
		case $type5673:
		case $type5927:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</div>';
				}
		break;		
		
		case $type5674:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</div>';
				}
		break;

		case $type5675:
		case $type5928:
			if((searchavailspec($allspec, $spec17700069)+searchavailspec($allspec, $spec700069)+searchavailspec($allspec, $spec69))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</div>';
				}
		break;		
		
		case $type5676: 
		break;
		
		
		case $type5677:
		case $type5929:
			if(searchavailspec($allspec, $spec249)>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (охрана окружающей среды)</div>';
				}
		break;	
		
		
		case $type5678:
			if((searchavailspec($allspec, $spec700164)+searchavailspec($allspec, $spec164))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (организация строительства)</div>';
				}
		break;		
		
		case $type5679:
		case $type5930:
			if(searchavailspec($allspec, $spec248)>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (охрана окружающей среды)</div>';
				}
		break;		

		case $type5680:	
		case $type5681:
		case $type5931:
		case $type5932:
		break;
		
		case $type5682:
		case $type5933:
			$count=0;
			$count=countoverzero(searchavailspec($allspec, $spec24),$count);
			$count=countoverzero(searchavailspec($allspec, $spec26),$count);
			$count=countoverzero(searchavailspec($allspec, $spec30),$count);
			$count=countoverzero(searchavailspec($allspec, $spec33),$count);
			$count=countoverzero(searchavailspec($allspec, $spec34),$count);
			$count=countoverzero(searchavailspec($allspec, $spec57),$count);
			$count=countoverzero(searchavailspec($allspec, $spec61),$count);
			$count=countoverzero(searchavailspec($allspec, $spec84),$count);
			$count=countoverzero(searchavailspec($allspec, $spec85),$count);
			$count=countoverzero(searchavailspec($allspec, $spec95),$count);
			$count=countoverzero(searchavailspec($allspec, $spec97),$count);
			$count=countoverzero(searchavailspec($allspec, $spec113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec144),$count);
			$count=countoverzero(searchavailspec($allspec, $spec145),$count);
			$count=countoverzero(searchavailspec($allspec, $spec146),$count);
			$count=countoverzero(searchavailspec($allspec, $spec276),$count);
			$count=countoverzero(searchavailspec($allspec, $spec277),$count);
			$count=countoverzero(searchavailspec($allspec, $spec20113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700024),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700026),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700030),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700033),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700034),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700057),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700061),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700084),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700085),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700095),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700097),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec710113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700024),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700026),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700030),$count);			
			$count=countoverzero(searchavailspec($allspec, $spec17700033),$count);							
			$count=countoverzero(searchavailspec($allspec, $spec17700084),$count);	
			$count=countoverzero(searchavailspec($allspec, $spec17700085),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700061),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700097),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700024),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700026),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700030),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700033),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700034),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700057),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700061),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700084),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700085),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700095),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700097),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700276),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700277),$count);
			
			if((searchavailspec($allspec, $spec40)+
				searchavailspec($allspec, $spec187)+
				searchavailspec($allspec, $spec18700187)+
				searchavailspec($allspec, $spec188)+
				searchavailspec($allspec, $spec189)+
				searchavailspec($allspec, $spec700187))<3){
			echo '<div class="red">Количество руководителей проекта меньше 3</div>';
				}		
			else {
			echo '<div class="green">Количество руководителей проекта 3 или больше</div>';		
				}
			if	($count<8)
				{
				echo '<div class="red">Количество специалистов по техническому надзору меньше 8</div>';
				}		
			else {
				echo '<div class="green">Количество специалистов по техническому надзору 8 или больше</div>';
				}	
		break;		
		
		case $type5683:
		case $type5934:
			if((searchavailspec($allspec, $spec700024)+
				searchavailspec($allspec, $spec144)+
				searchavailspec($allspec, $spec145)+
				searchavailspec($allspec, $spec146)+
				searchavailspec($allspec, $spec24)+
				searchavailspec($allspec, $spec18700024)+
				searchavailspec($allspec, $spec17700024))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (общестроительные работы)</div>';
				}
		break;		
		
		case $type5684:
		case $type5935:
			if((searchavailspec($allspec, $spec700026)+
				searchavailspec($allspec, $spec26)+
				searchavailspec($allspec, $spec18700026)+
				searchavailspec($allspec, $spec17700026))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</div>';
				}
		break;		
		
		case $type5685:
		case $type5936:
			if((searchavailspec($allspec, $spec700026)+
				searchavailspec($allspec, $spec26)+
				searchavailspec($allspec, $spec18700026)+
				searchavailspec($allspec, $spec17700026))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</div>';
				}
		break;		
		
		case $type5686:
		case $type5937:
			if((searchavailspec($allspec, $spec277)+
		searchavailspec($allspec, $spec18700277))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (устройство систем холодоснабжения)</div>';
				}
		break;			
		
		case $type5687:
		case $type5938:
			if((searchavailspec($allspec, $spec700026)+
				searchavailspec($allspec, $spec26)+
				searchavailspec($allspec, $spec18700026)+
				searchavailspec($allspec, $spec17700026)+
				searchavailspec($allspec, $spec95)+
				searchavailspec($allspec, $spec18700095)+
				searchavailspec($allspec, $spec700095))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</div>';
				}
		break;		
		
		case $type5688:
		case $type5939:
			if((searchavailspec($allspec, $spec700057)+
			searchavailspec($allspec, $spec18700057)+
				searchavailspec($allspec, $spec57))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области газоснабжения)</div>';
				}
		break;
		
		case $type5689:
		case $type5940:
			if((searchavailspec($allspec, $spec700030)+
				searchavailspec($allspec, $spec30)+
				searchavailspec($allspec, $spec18700030)+
				searchavailspec($allspec, $spec17700030))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области электроснабжения и автоматизации)</div>';
				}
		break;	
				
		case $type5690:
		case $type5941:
			if((searchavailspec($allspec, $spec700097)+
				searchavailspec($allspec, $spec97)+
				searchavailspec($allspec, $spec18700097)+
				searchavailspec($allspec, $spec17700097))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области связи, сигнализации)</div>';
				}
		break;	
		
		case $type5691:
		case $type5942:
			if((searchavailspec($allspec, $spec700033)+
				searchavailspec($allspec, $spec33)+
				searchavailspec($allspec, $spec18700033)+
				searchavailspec($allspec, $spec17700033))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (строительство автомобильных дорог и аэродромов, строительство мостов, транспортных эстакад и путепроводов)</div>';
				}
		break;		
		
		case $type5692:
		case $type5943:
			if((searchavailspec($allspec, $spec700084)+
				searchavailspec($allspec, $spec84)+
				searchavailspec($allspec, $spec18700084)+
				searchavailspec($allspec, $spec17700084))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (строительство железных дорог)</div>';
				}
		break;		
		
		case $type5693:
		case $type5944:
		if((searchavailspec($allspec, $spec700085)+
		searchavailspec($allspec, $spec85)+
		searchavailspec($allspec, $spec18700085)+
		searchavailspec($allspec, $spec17700085))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (строительство сооружений транспортных тоннелей, метрополитенов)</div>';
				}
		break;	
		
		case $type5694:
		case $type5945:
		if((searchavailspec($allspec, $spec700034)+
		searchavailspec($allspec, $spec18700034)+
		searchavailspec($allspec, $spec34))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (гидротехническое и мелиоративное строительство)</div>';
				}
		break;	
		
		case $type5695:
		if((searchavailspec($allspec, $spec710113)+
		searchavailspec($allspec, $spec20113)+
		searchavailspec($allspec, $spec700113)+
		searchavailspec($allspec, $spec18700113)+
		searchavailspec($allspec, $spec113))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (благоустройство территорий)</div>';
				}
		break;		
		
		
		case $type5696:
		case $type5946:
		if((searchavailspec($allspec, $spec276)+
		searchavailspec($allspec, $spec18700276))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (монтаж технологических трубопроводов и оборудования)</div>';
				}
		break;		

		case $type5697:
		case $type5947:
		if((searchavailspec($allspec, $spec700061)+
		searchavailspec($allspec, $spec17700061)+
		searchavailspec($allspec, $spec18700061)+
		searchavailspec($allspec, $spec61))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (устройство магистральных трубопроводов для транспортирования нефти, газа, нефтепродуктов)</div>';
				}
		break;		
		
		case $type5698:
		case $type5948:
		if((searchavailspec($allspec, $spec700064)+searchavailspec($allspec, $spec3)+searchavailspec($allspec, $spec64))>=4 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов ГАП меньше 4</div>';
				}
		break;		
		
		case $type5699:
		case $type5700:
		case $type5701:
		case $type5702:
		case $type5703:
		case $type5704:
		case $type5705:
		case $type5949:
		case $type5950:
		case $type5951:
		case $type5952:
		case $type5953:
		case $type5954:
		break;
		
		case $type5706:
		case $type5955:
			if((searchavailspec($allspec, $spec71043)+
				searchavailspec($allspec, $spec71044)+
				searchavailspec($allspec, $spec71045)+
				searchavailspec($allspec, $spec71039)+
				searchavailspec($allspec, $spec71046)+
				searchavailspec($allspec, $spec71048)+
				searchavailspec($allspec, $spec71047)+
				searchavailspec($allspec, $spec71059)+
				searchavailspec($allspec, $spec71063)+
				searchavailspec($allspec, $spec71074)+
				searchavailspec($allspec, $spec700128)+
				searchavailspec($allspec, $spec700047)+
				searchavailspec($allspec, $spec710128)+
				searchavailspec($allspec, $spec700048)+
				searchavailspec($allspec, $spec700045)+
				searchavailspec($allspec, $spec700046)+
				searchavailspec($allspec, $spec700073)+
				searchavailspec($allspec, $spec700059)+
				searchavailspec($allspec, $spec700039)+
				searchavailspec($allspec, $spec700126)+
				searchavailspec($allspec, $spec700043)+
				searchavailspec($allspec, $spec700096)+
				searchavailspec($allspec, $spec700074)+
				searchavailspec($allspec, $spec700063)+
				searchavailspec($allspec, $spec700044)+
				searchavailspec($allspec, $spec150)+
				searchavailspec($allspec, $spec17700043)+
				searchavailspec($allspec, $spec17700044)+
				searchavailspec($allspec, $spec45)+
				searchavailspec($allspec, $spec39)+
				searchavailspec($allspec, $spec17700046)+
				searchavailspec($allspec, $spec17700048)+
				searchavailspec($allspec, $spec17700047)+
				searchavailspec($allspec, $spec17700059)+
				searchavailspec($allspec, $spec63)+
				searchavailspec($allspec, $spec73)+
				searchavailspec($allspec, $spec96)+
				searchavailspec($allspec, $spec17700074)+
				searchavailspec($allspec, $spec126)+
				searchavailspec($allspec, $spec128)+
				searchavailspec($allspec, $spec278)+
				searchavailspec($allspec, $spec43)+
				searchavailspec($allspec, $spec44)+
				searchavailspec($allspec, $spec46)+
				searchavailspec($allspec, $spec48)+
				searchavailspec($allspec, $spec47)+
				searchavailspec($allspec, $spec59)+
				searchavailspec($allspec, $spec74)+
				searchavailspec($allspec, $spec260)+
				searchavailspec($allspec, $spec261)+
				searchavailspec($allspec, $spec262)+
				searchavailspec($allspec, $spec263))<1){
			echo '<div class="red">Нет ни одного главного инженера<br></div>';
				}
			else {echo '<div class="green">Главный инженер есть<br></div>';}	

			if((searchavailspec($allspec, $spec710114)+
				searchavailspec($allspec, $spec710115)+
				searchavailspec($allspec, $spec710116)+
				searchavailspec($allspec, $spec710117)+
				searchavailspec($allspec, $spec710118)+
				searchavailspec($allspec, $spec710119)+
				searchavailspec($allspec, $spec710120)+
				searchavailspec($allspec, $spec710121)+
				searchavailspec($allspec, $spec710122)+
				searchavailspec($allspec, $spec710123)+
				searchavailspec($allspec, $spec710124)+
				searchavailspec($allspec, $spec710125)+
				searchavailspec($allspec, $spec700120)+
				searchavailspec($allspec, $spec700115)+
				searchavailspec($allspec, $spec700122)+
				searchavailspec($allspec, $spec700124)+
				searchavailspec($allspec, $spec700125)+
				searchavailspec($allspec, $spec700114)+
				searchavailspec($allspec, $spec700117)+
				searchavailspec($allspec, $spec700121)+
				searchavailspec($allspec, $spec700123)+
				searchavailspec($allspec, $spec700118)+
				searchavailspec($allspec, $spec700116)+
				searchavailspec($allspec, $spec700119)+
				searchavailspec($allspec, $spec700147)+
				searchavailspec($allspec, $spec247)+
				searchavailspec($allspec, $spec147)+
				searchavailspec($allspec, $spec17700114)+
				searchavailspec($allspec, $spec17700115)+
				searchavailspec($allspec, $spec116)+
				searchavailspec($allspec, $spec117)+
				searchavailspec($allspec, $spec17700118)+
				searchavailspec($allspec, $spec119)+
				searchavailspec($allspec, $spec17700120)+
				searchavailspec($allspec, $spec17700121)+
				searchavailspec($allspec, $spec122)+
				searchavailspec($allspec, $spec123)+
				searchavailspec($allspec, $spec17700124)+
				searchavailspec($allspec, $spec125)+
				searchavailspec($allspec, $spec114)+
				searchavailspec($allspec, $spec115)+
				searchavailspec($allspec, $spec118)+
				searchavailspec($allspec, $spec120)+
				searchavailspec($allspec, $spec121)+
				searchavailspec($allspec, $spec124)+
				searchavailspec($allspec, $spec264)+
				searchavailspec($allspec, $spec265)+
				searchavailspec($allspec, $spec266))<1){
			echo '<div class="red">Нет ни одного начальника (заместителя) ПТО<br></div>';
				}
			else {
			echo '<div class="green">Начальник (заместитель) ПТО есть<br></div>';}		
		
		if	
		((searchavailspec($allspec, $spec700141)+
		searchavailspec($allspec, $spec141))<1)
		
				{
				echo '<div class="red">Нет ни одного инженера по сметной работе<br></div>';
				}
		else {echo '<div class="green">Инженер по сметной работе есть<br></div>';}		

		break;		
		
		case $type5707:
		case $type5956:
		if((searchavailspec($allspec, $spec71043)+
		searchavailspec($allspec, $spec71044)+
		searchavailspec($allspec, $spec71045)+
		searchavailspec($allspec, $spec71039)+
		searchavailspec($allspec, $spec71046)+
		searchavailspec($allspec, $spec71048)+
		searchavailspec($allspec, $spec71047)+
		searchavailspec($allspec, $spec71059)+
		searchavailspec($allspec, $spec71063)+
		searchavailspec($allspec, $spec71074)+
		searchavailspec($allspec, $spec700128)+
		searchavailspec($allspec, $spec700047)+
		searchavailspec($allspec, $spec710128)+
		searchavailspec($allspec, $spec700048)+
		searchavailspec($allspec, $spec700045)+
		searchavailspec($allspec, $spec700046)+
		searchavailspec($allspec, $spec700073)+
		searchavailspec($allspec, $spec700059)+
		searchavailspec($allspec, $spec700039)+
		searchavailspec($allspec, $spec700126)+
		searchavailspec($allspec, $spec700043)+
		searchavailspec($allspec, $spec700096)+
		searchavailspec($allspec, $spec700074)+
		searchavailspec($allspec, $spec700063)+
		searchavailspec($allspec, $spec700044)+
		searchavailspec($allspec, $spec150)+
		searchavailspec($allspec, $spec17700043)+
		searchavailspec($allspec, $spec17700044)+
		searchavailspec($allspec, $spec45)+
		searchavailspec($allspec, $spec39)+
		searchavailspec($allspec, $spec17700046)+
		searchavailspec($allspec, $spec17700048)+
		searchavailspec($allspec, $spec17700047)+
		searchavailspec($allspec, $spec17700059)+
		searchavailspec($allspec, $spec63)+
		searchavailspec($allspec, $spec73)+
		searchavailspec($allspec, $spec96)+
		searchavailspec($allspec, $spec17700074)+
		searchavailspec($allspec, $spec126)+
		searchavailspec($allspec, $spec128)+
		searchavailspec($allspec, $spec278)+
		searchavailspec($allspec, $spec43)+
		searchavailspec($allspec, $spec44)+
		searchavailspec($allspec, $spec46)+
		searchavailspec($allspec, $spec48)+
		searchavailspec($allspec, $spec47)+
		searchavailspec($allspec, $spec59)+
		searchavailspec($allspec, $spec74)+
		searchavailspec($allspec, $spec260)+
		searchavailspec($allspec, $spec261)+
		searchavailspec($allspec, $spec262)+
		searchavailspec($allspec, $spec263))<1)
		{
				echo '<div class="red">Нет ни одного главного инженера<br></div>';
				}
				else {echo '<div class="green">Главный инженер есть<br></div>';}	

		if	
		((searchavailspec($allspec, $spec710114)+
		searchavailspec($allspec, $spec710115)+
		searchavailspec($allspec, $spec710116)+
		searchavailspec($allspec, $spec710117)+
		searchavailspec($allspec, $spec710118)+
		searchavailspec($allspec, $spec710119)+
		searchavailspec($allspec, $spec710120)+
		searchavailspec($allspec, $spec710121)+
		searchavailspec($allspec, $spec710122)+
		searchavailspec($allspec, $spec710123)+
		searchavailspec($allspec, $spec710124)+
		searchavailspec($allspec, $spec710125)+
		searchavailspec($allspec, $spec700120)+
		searchavailspec($allspec, $spec700115)+
		searchavailspec($allspec, $spec700122)+
		searchavailspec($allspec, $spec700124)+
		searchavailspec($allspec, $spec700125)+
		searchavailspec($allspec, $spec700114)+
		searchavailspec($allspec, $spec700117)+
		searchavailspec($allspec, $spec700121)+
		searchavailspec($allspec, $spec700123)+
		searchavailspec($allspec, $spec700118)+
		searchavailspec($allspec, $spec700116)+
		searchavailspec($allspec, $spec700119)+
		searchavailspec($allspec, $spec700147)+
		searchavailspec($allspec, $spec247)+
		searchavailspec($allspec, $spec147)+
		searchavailspec($allspec, $spec17700114)+
		searchavailspec($allspec, $spec17700115)+
		searchavailspec($allspec, $spec116)+
		searchavailspec($allspec, $spec117)+
		searchavailspec($allspec, $spec17700118)+
		searchavailspec($allspec, $spec119)+
		searchavailspec($allspec, $spec17700120)+
		searchavailspec($allspec, $spec17700121)+
		searchavailspec($allspec, $spec122)+
		searchavailspec($allspec, $spec123)+
		searchavailspec($allspec, $spec17700124)+
		searchavailspec($allspec, $spec125)+
		searchavailspec($allspec, $spec114)+
		searchavailspec($allspec, $spec115)+
		searchavailspec($allspec, $spec118)+
		searchavailspec($allspec, $spec120)+
		searchavailspec($allspec, $spec121)+
		searchavailspec($allspec, $spec124)+
		searchavailspec($allspec, $spec264)+
		searchavailspec($allspec, $spec265)+
		searchavailspec($allspec, $spec266))<1)
		
				{
				echo '<div class="red">Нет ни одного начальника (заместителя) ПТО<br></div>';
				}
				else {echo '<div class="green">Начальник (заместитель) ПТО есть<br></div>';}		
		
		if	
		((searchavailspec($allspec, $spec700141)+
		searchavailspec($allspec, $spec141))<1)
		
				{
				echo '<div class="red">Нет ни одного инженера по сметной работе<br></div>';
				}
		else {echo '<div class="green">Инженер по сметной работе есть<br></div>';}		

		break;	

		
		case $type5708:
		case $type5957:
		break;
			
		case $type5709:
		case $type5958:
				if((searchavailspec($allspec, $spec140)+searchavailspec($allspec, $spec142)+
				searchavailspec($allspec, $spec700140)+searchavailspec($allspec, $spec700142))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного или ведущего геодезиста</div>';
				}
		break;		
		
		
		case $type5710:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5711:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec15)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec16)+searchavailspec($allspec, $spec76)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec78)+
				searchavailspec($allspec, $spec79)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec81)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700216)+searchavailspec($allspec, $spec17700243)+
				searchavailspec($allspec, $spec17700245)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec245)+searchavailspec($allspec, $spec205)+
				searchavailspec($allspec, $spec231)+searchavailspec($allspec, $spec233)+
				searchavailspec($allspec, $spec234)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec215)+
				searchavailspec($allspec, $spec216)+searchavailspec($allspec, $spec243))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5712:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+					
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5713:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;

		case $type5714:
		case $type5959:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+				
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5715:
		case $type5960:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5716:
			if((searchavailspec($allspec, $spec270)+
				searchavailspec($allspec, $spec274))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5717:
				if((searchavailspec($allspec, $spec0)+
					searchavailspec($allspec, $spec9)+
					searchavailspec($allspec, $spec11)+
					searchavailspec($allspec, $spec12)+
					searchavailspec($allspec, $spec15)+
					searchavailspec($allspec, $spec18)+
					searchavailspec($allspec, $spec19)+
					searchavailspec($allspec, $spec16)+
					searchavailspec($allspec, $spec41)+
					searchavailspec($allspec, $spec76)+
					searchavailspec($allspec, $spec77)+
					searchavailspec($allspec, $spec78)+
					searchavailspec($allspec, $spec79)+
					searchavailspec($allspec, $spec80)+
					searchavailspec($allspec, $spec81)+
					searchavailspec($allspec, $spec82)+
					searchavailspec($allspec, $spec83)+
					searchavailspec($allspec, $spec194)+
					searchavailspec($allspec, $spec195)+
					searchavailspec($allspec, $spec196)+
					searchavailspec($allspec, $spec198)+
					searchavailspec($allspec, $spec199)+
					searchavailspec($allspec, $spec203)+
					searchavailspec($allspec, $spec205)+
					searchavailspec($allspec, $spec206)+
					searchavailspec($allspec, $spec208)+
					searchavailspec($allspec, $spec215)+
					searchavailspec($allspec, $spec216)+
					searchavailspec($allspec, $spec222)+
					searchavailspec($allspec, $spec223)+
					searchavailspec($allspec, $spec224)+
					searchavailspec($allspec, $spec226)+
					searchavailspec($allspec, $spec227)+
					searchavailspec($allspec, $spec231)+
					searchavailspec($allspec, $spec233)+
					searchavailspec($allspec, $spec234)+
					searchavailspec($allspec, $spec236)+
					searchavailspec($allspec, $spec243)+
					searchavailspec($allspec, $spec245)+
					searchavailspec($allspec, $spec17700195)+
					searchavailspec($allspec, $spec17700199)+
					searchavailspec($allspec, $spec17700203)+
					searchavailspec($allspec, $spec17700205)+
					searchavailspec($allspec, $spec17700209)+
					searchavailspec($allspec, $spec17700215)+
					searchavailspec($allspec, $spec17700216)+
					searchavailspec($allspec, $spec17700223)+
					searchavailspec($allspec, $spec17700231)+
					searchavailspec($allspec, $spec17700233)+
					searchavailspec($allspec, $spec17700234)+
					searchavailspec($allspec, $spec17700237)+
					searchavailspec($allspec, $spec17700243)+
					searchavailspec($allspec, $spec17700245))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type5718:
		case $type5961:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5719:
		case $type5962:
				if((searchavailspec($allspec, $spec9)+
					searchavailspec($allspec, $spec18)+
					searchavailspec($allspec, $spec19)+
					searchavailspec($allspec, $spec41)+
					searchavailspec($allspec, $spec82)+
					searchavailspec($allspec, $spec83)+
					searchavailspec($allspec, $spec194)+
					searchavailspec($allspec, $spec195)+
					searchavailspec($allspec, $spec196)+
					searchavailspec($allspec, $spec198)+
					searchavailspec($allspec, $spec199)+
					searchavailspec($allspec, $spec209)+
					searchavailspec($allspec, $spec222)+
					searchavailspec($allspec, $spec223)+
					searchavailspec($allspec, $spec224)+
					searchavailspec($allspec, $spec226)+
					searchavailspec($allspec, $spec227)+
					searchavailspec($allspec, $spec237)+
					searchavailspec($allspec, $spec17700195)+
					searchavailspec($allspec, $spec17700199)+
					searchavailspec($allspec, $spec17700209)+
					searchavailspec($allspec, $spec17700223)+
					searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5720:
		case $type5963:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec267)+searchavailspec($allspec, $spec271))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5721:
		case $type5964:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5722:
		case $type5965:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5723:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;			
		
		case $type5724:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
				
		case $type5725:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec76)+searchavailspec($allspec, $spec77)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec17700195)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700197)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec17700203)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec197)+searchavailspec($allspec, $spec225)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec205)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec233)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		
		case $type5726:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5727:
		case $type5966:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;			
		
		case $type5728:
		case $type5967:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec110)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700211)+searchavailspec($allspec, $spec17700239)+
				searchavailspec($allspec, $spec211)+searchavailspec($allspec, $spec239)+				
				searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;			
		
		case $type5729:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type5730:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;			
		
		case $type5731:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5732:
		case $type5968:
				if((searchavailspec($allspec, $spec11)+
					searchavailspec($allspec, $spec76)+
					searchavailspec($allspec, $spec203)+
					searchavailspec($allspec, $spec205)+
					searchavailspec($allspec, $spec212)+
					searchavailspec($allspec, $spec231)+
					searchavailspec($allspec, $spec233)+
					searchavailspec($allspec, $spec235)+
					searchavailspec($allspec, $spec17700203)+
					searchavailspec($allspec, $spec17700205)+
					searchavailspec($allspec, $spec17700231)+
					searchavailspec($allspec, $spec17700233))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}	
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;

		case $type5733:
		case $type5969:
				if((searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec17700204)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700232)+
				searchavailspec($allspec, $spec204)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec232))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))<1)	
			{
				echo '<div class="red">Нет прораба(мастера) по установке приборов учета тепло- и водопотребления</div>';
				}	
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;
		
		case $type5734:
		case $type5970:
				if((searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec234))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}	
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;			

		case $type5735:
		case $type5971:
				if((searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec207)+searchavailspec($allspec, $spec234))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))<1)	
			{
				echo '<div class="red">Нет прораба(мастера) по установке приборов учета тепло- и водопотребления</div>';
				}	
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;		
		
		case $type5736:
		case $type5972:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec17700216)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700245)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec245)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec216))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5737:
		case $type5973:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec81)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700246)+
				searchavailspec($allspec, $spec17700217)+searchavailspec($allspec, $spec17700215)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec217)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec246))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5738:
		case $type5974:
				if((searchavailspec($allspec, $spec13)+searchavailspec($allspec, $spec193)+
				searchavailspec($allspec, $spec221))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type5739:
				if((searchavailspec($allspec, $spec0)+searchavailspec($allspec, $spec16)+
				searchavailspec($allspec, $spec218)+searchavailspec($allspec, $spec244))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;	
		
	
		case $type5740:
		case $type5975:
				if((searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec206)+searchavailspec($allspec, $spec207)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec234))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5741:
		case $type5976:
				if((searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226)+searchavailspec($allspec, $spec226))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5742:
		case $type5977:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5743:
		case $type5978:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
				
		case $type5744:
				if((searchavailspec($allspec, $spec710112)+searchavailspec($allspec, $spec112)+
				searchavailspec($allspec, $spec20112)+searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec220))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5745:
		case $type5979:
				if((searchavailspec($allspec, $spec82)+searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec224))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
						
		case $type5746:
		case $type5980:
				if((searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700237)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5747:
		case $type5981:		
				if((searchavailspec($allspec, $spec269)+searchavailspec($allspec, $spec273))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type5748:
		case $type5982:		
				if((searchavailspec($allspec, $spec17)+searchavailspec($allspec, $spec214)
					+searchavailspec($allspec, $spec242))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5749:
						if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)
					+searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type5750:
		case $type5983:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5751:
		case $type5984:
				if((searchavailspec($allspec, $spec268)+searchavailspec($allspec, $spec272))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5752:
		case $type5985:
		break;		
		
		case $type5901:
		case $type5986:
				if((searchavailspec($allspec, $spec700093)+searchavailspec($allspec, $spec700135)+searchavailspec($allspec, $spec800135)+searchavailspec($allspec, $spec93)+
				searchavailspec($allspec, $spec17700135))>=5){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
				else {
				echo '<div class="red">Не достаточно аттестованных специалистов</div>';
				}
		break;		
			
		case $type5903:
		case $type5987:
				if(searchavailspec($allspec, $spec250)>=5){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
				else {
				echo '<div class="red">Не достаточно специалистов, осуществляющих обследование автомобильных дорог и мостовых сооружений</div>';
				}
		break;
				
        case $type5902:
				if((searchavailspec($allspec, $spec253)+searchavailspec($allspec, $spec254)+
				searchavailspec($allspec, $spec255)+searchavailspec($allspec, $spec256)+searchavailspec($allspec, $spec257)+searchavailspec($allspec, $spec258)+
				searchavailspec($allspec, $spec259))>=5){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
				else {
				echo '<div class="red">Не достаточно аттестованных специалистов</div>';
				}
		break;		
		}			
		} 
	}
    break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////CASE 2//////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
    case 2:
	if($vidyrabot1 < $outdate){
        for ($i = 0; $i <= count($types_of_jobs[$k]->field_field_vidyrab); $i++) 
		{ 
			$types_of_jobs2=$types_of_jobs[$k]->field_field_vidyrab[$i][raw];
			$types_of_jobs3=$types_of_jobs2[taxonomy_term]->name;
			$vidyrabot[$k][$i]=$types_of_jobs3; // переменная для вывода вне массива
			print_r ("</br>".$types_of_jobs3."</br>");

			
		switch ($types_of_jobs3) {
        	
		case $type163:
		break;
		
		case $type164:
		if((searchavailspec($allspec, $spec700166)+searchavailspec($allspec, $spec166)+searchavailspec($allspec, $spec173))>=5){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-геодезические изыскания меньше 5</div>';
				}
		break;
		
		case $type165:
			if((searchavailspec($allspec, $spec700167)+searchavailspec($allspec, $spec167)+searchavailspec($allspec, $spec174))>=5){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-геологические изыскания меньше 5</div>';
				}
		break;
		
		case $type166:
			if((searchavailspec($allspec, $spec700168)+searchavailspec($allspec, $spec168))>=5){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-гидрометеорологические изыскания меньше 5</div>';
				}
		break;
		
		case $type167:
			if((searchavailspec($allspec, $spec700169)+searchavailspec($allspec, $spec169))>=5){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-экологические изыскания меньше 5</div>';
				}
		break;
		
		case $type168:
			if((searchavailspec($allspec, $spec700170)+searchavailspec($allspec, $spec170))>=5){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-геотехнические изыскания меньше 5</div>';
				}
		break;
		
		case $type169:
			if((searchavailspec($allspec, $spec700171)+searchavailspec($allspec, $spec171))>=5){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих обследование состояния грунтов оснований зданий и сооружений меньше 5</div>';
				}
		break;
		
		case $type170:
			if((searchavailspec($allspec, $spec700064)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3))>=1 or 
			(searchavailspec($allspec, $spec4)+searchavailspec($allspec, $spec700129)+searchavailspec($allspec, $spec700004)+searchavailspec($allspec, $spec148)+searchavailspec($allspec, $spec17700129)+searchavailspec($allspec, $spec129)+searchavailspec($allspec, $spec275))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного специалиста ГАП или ГИП</div>';
				}
		break;
		
		case $type171:
			if((searchavailspec($allspec, $spec101)+
				searchavailspec($allspec, $spec102)+
				searchavailspec($allspec, $spec103)+
				searchavailspec($allspec, $spec104)+
				searchavailspec($allspec, $spec105)+
				searchavailspec($allspec, $spec106)+
				searchavailspec($allspec, $spec107)+
				searchavailspec($allspec, $spec108)+
				searchavailspec($allspec, $spec109)+
				searchavailspec($allspec, $spec137)+
				searchavailspec($allspec, $spec138)+
				searchavailspec($allspec, $spec162)+		
				searchavailspec($allspec, $spec700101)+
				searchavailspec($allspec, $spec700102)+
				searchavailspec($allspec, $spec700103)+
				searchavailspec($allspec, $spec700104)+
				searchavailspec($allspec, $spec700105)+
				searchavailspec($allspec, $spec700106)+
				searchavailspec($allspec, $spec700107)+
				searchavailspec($allspec, $spec700108)+
				searchavailspec($allspec, $spec700109)+
				searchavailspec($allspec, $spec700137)+
				searchavailspec($allspec, $spec700138)+
				searchavailspec($allspec, $spec700162)+
				searchavailspec($allspec, $spec17700101)+
				searchavailspec($allspec, $spec17700102)+
				searchavailspec($allspec, $spec17700103)+
				searchavailspec($allspec, $spec17700104)+
				searchavailspec($allspec, $spec17700105)+
				searchavailspec($allspec, $spec17700106)+
				searchavailspec($allspec, $spec17700107)+
				searchavailspec($allspec, $spec17700108)+
				searchavailspec($allspec, $spec17700109))<1) 
			 {
				echo '<div class="red">Нет ни одного аттестованного начальника (заведующего) структурного подразделения</div>';
				}
			else
				{
				echo '<div class="green">Начальник (заведующий) структурного подразделения есть</div>';
				}			
			if	((searchavailspec($allspec, $spec3)+
					  searchavailspec($allspec, $spec64)+
					  searchavailspec($allspec, $spec700064))<4
					  and
					 (searchavailspec($allspec, $spec4)+
					  searchavailspec($allspec, $spec129)+
					  searchavailspec($allspec, $spec148)+
					  searchavailspec($allspec, $spec275)+
					  searchavailspec($allspec, $spec700004)+
					  searchavailspec($allspec, $spec700129)+
					  searchavailspec($allspec, $spec17700129))<4)
             {
				echo '<div class="red">Количество специалистов ГАП или ГИП меньше 4</div>';
				}
			 else
				{
				echo '<div class="green">Количество специалистов ГАП или ГИП 4 или более</div>';
				} 
			 if (searchavailspec($allspec, $spec248)<1)
			{
				echo '<div class="red">Нет ни одного главного специалиста по охране окружающей среды</div>';
				} 
			else
			{
				echo '<div class="green">Специалист по охране окружающей среды есть</div>';
				}	
			if ((searchavailspec($allspec, $spec164)+
					 searchavailspec($allspec, $spec700164))<1)
			{
				echo '<div class="red">Нет ни одного главного специалиста по организации строительства</div>';
				} 
			else
			{
				echo '<div class="green">Главный специалист по организации строительства есть</div>';
				}	
			if (searchavailspec($allspec, $spec249)<1)
			{
				echo '<div class="red">Нет ни одного главного специалиста по инженерно-техническим мероприятиям гражданской обороны</div>';
				}
			else {
			echo '<div class="green">Главный специалист по инженерно-техническим мероприятиям гражданской обороны есть</div>';
				}
		break;
					
		case $type196:
		break;
		
		case $type197:
			if((searchavailspec($allspec, $spec700163)+searchavailspec($allspec, $spec163))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (генеральный план)</div>';
				}
		break;
			
		case $type198:
			if((searchavailspec($allspec, $spec252)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3)+searchavailspec($allspec, $spec700064))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (архитектурные решения) либо ГАПа</div>';
				}
		break;
						
		case $type199:
			if(searchavailspec($allspec, $spec139)+
			   searchavailspec($allspec, $spec700139)>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (сметная документация)</div>';
				}
		break;
				
		case $type200:			
		if((searchavailspec($allspec, $spec66)+searchavailspec($allspec, $spec17700066)+searchavailspec($allspec, $spec700066))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (конструктивные решения)</div>';
				}			
		break;
				
		case $type543:
		break;
		
		case $type5435:
			if((searchavailspec($allspec, $spec17700071)+searchavailspec($allspec, $spec700071)+searchavailspec($allspec, $spec71))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (холодоснабжение))</div>';
				}
		break;
						
		case $type5436:
		case $type5438:
		case $type5797:
			if((searchavailspec($allspec, $spec17700067)+searchavailspec($allspec, $spec700067)+searchavailspec($allspec, $spec67))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</div>';
				}
		break;
		
		case $type5441:
		case $type5442:
		case $type5443:
		case $type5798:
			if((searchavailspec($allspec, $spec72)+
				searchavailspec($allspec, $spec700072)+
				searchavailspec($allspec, $spec17700072))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</div>';
				}
		break;
		
		case $type5444:
		case $type5453:
		case $type5454:
		case $type5799:
			if((searchavailspec($allspec, $spec98)+
				searchavailspec($allspec, $spec700098)+
				searchavailspec($allspec, $spec17700098))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</div>';
				}
		break;
		
		case $type5439:
		case $type5440:
		case $type5795:
			if((searchavailspec($allspec, $spec68)+
				searchavailspec($allspec, $spec700068)+
				searchavailspec($allspec, $spec17700068))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (отопление, вентиляция и кондиционирование воздуха))</div>';
				}
		break;	
		
		case $type5437:
			if((searchavailspec($allspec, $spec17700069)+searchavailspec($allspec, $spec700069)+searchavailspec($allspec, $spec69))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</div>';
				}
		break;

		case $type5445: /*4.6. наружные сети и системы:*/
		break;
		
		case $type5446:
		case $type5802:
			if((searchavailspec($allspec, $spec17700070)+searchavailspec($allspec, $spec700070)+searchavailspec($allspec, $spec70))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (тепловые сети))</div>';
				}
		break;
		
		case $type5447:
		case $type5449:
		case $type5803:
			if((searchavailspec($allspec, $spec67)+
				searchavailspec($allspec, $spec700067)+
				searchavailspec($allspec, $spec17700067))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</div>';
				}
		break;	
		
		case $type5450:
		case $type5804:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</div>';
				}
		break;
		
		
		case $type5451:
		case $type5455:
		case $type5456:
		case $type5805:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</div>';
				}
		break;
		
		case $type5448:
			if((searchavailspec($allspec, $spec17700069)+searchavailspec($allspec, $spec700069)+searchavailspec($allspec, $spec69))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</div>';
				}
		break;

		case $type202: 
		break;
		
		case $type5457: /*4.8.:*/
		break;
		
		case $type5459:
				if(searchavailspec($allspec, $spec249)>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерно-технические мероприятия гражданской обороны. Мероприятия по предупреждению чрезвычайных ситуаций)</div>';
				}
		break;
		
		case $type5460:
				if(searchavailspec($allspec, $spec249)>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерно-технические мероприятия гражданской обороны. Мероприятия по предупреждению чрезвычайных ситуаций)</div>';
				}
		break;
		
		case $type5461:
				if(searchavailspec($allspec, $spec249)>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерно-технические мероприятия гражданской обороны. Мероприятия по предупреждению чрезвычайных ситуаций)</div>';
				}
		break;
		
		case $type5462:
			if((searchavailspec($allspec, $spec700164)+searchavailspec($allspec, $spec164))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (организация строительства)</div>';
				}
		break;
		
		case $type5458:
			if(searchavailspec($allspec, $spec248)>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (охрана окружающей среды)</div>';
				}
		break;		
		
		case $type205:/*5. Выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов первого-четвертого классов сложности*/
		case $type206:
		break;
		
		case $type207:
			$count=0;
			$count=countoverzero(searchavailspec($allspec, $spec24),$count);
			$count=countoverzero(searchavailspec($allspec, $spec26),$count);
			$count=countoverzero(searchavailspec($allspec, $spec30),$count);
			$count=countoverzero(searchavailspec($allspec, $spec33),$count);
			$count=countoverzero(searchavailspec($allspec, $spec34),$count);
			$count=countoverzero(searchavailspec($allspec, $spec57),$count);
			$count=countoverzero(searchavailspec($allspec, $spec61),$count);
			$count=countoverzero(searchavailspec($allspec, $spec84),$count);
			$count=countoverzero(searchavailspec($allspec, $spec85),$count);
			$count=countoverzero(searchavailspec($allspec, $spec95),$count);
			$count=countoverzero(searchavailspec($allspec, $spec97),$count);
			$count=countoverzero(searchavailspec($allspec, $spec113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec144),$count);
			$count=countoverzero(searchavailspec($allspec, $spec145),$count);
			$count=countoverzero(searchavailspec($allspec, $spec146),$count);
			$count=countoverzero(searchavailspec($allspec, $spec276),$count);
			$count=countoverzero(searchavailspec($allspec, $spec277),$count);
			$count=countoverzero(searchavailspec($allspec, $spec20113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700024),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700026),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700030),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700033),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700034),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700057),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700061),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700084),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700085),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700095),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700097),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec710113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700024),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700026),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700030),$count);			
			$count=countoverzero(searchavailspec($allspec, $spec17700033),$count);							
			$count=countoverzero(searchavailspec($allspec, $spec17700084),$count);	
			$count=countoverzero(searchavailspec($allspec, $spec17700085),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700061),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700097),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700024),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700026),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700030),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700033),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700034),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700057),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700061),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700084),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700085),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700095),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700097),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700276),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700277),$count);
				
		if((searchavailspec($allspec, $spec40)+searchavailspec($allspec, $spec700187)
			+searchavailspec($allspec, $spec188)+searchavailspec($allspec, $spec189)+
		searchavailspec($allspec, $spec18700187)+
		searchavailspec($allspec, $spec187))<2)
		{
			echo '<div class="red">Количество руководителей проекта меньше 2</div>';
				}		
			else {
			echo '<div class="green">Количество руководителей проекта 2 или больше</div>';		
				}
			if	($count<6)
				{
				echo '<div class="red">Количество специалистов по техническому надзору меньше 6</div>';
				}		
			else {
				echo '<div class="green">Количество специалистов по техническому надзору 6 или больше</div>';
				}	
		break;
		
		case $type208:
		if((searchavailspec($allspec, $spec700024)+
		searchavailspec($allspec, $spec144)+
		searchavailspec($allspec, $spec145)+
		searchavailspec($allspec, $spec146)+
		searchavailspec($allspec, $spec24)+
		searchavailspec($allspec, $spec18700024)+
		searchavailspec($allspec, $spec17700024))<0 ){
			echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (общестроительные работы)</div>';
				}
			else {
				echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;
		
		case $type209:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec18700026)+
		searchavailspec($allspec, $spec17700026))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</div>';
				}
		break;
		
		case $type210:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec18700026)+
		searchavailspec($allspec, $spec17700026))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</div>';
				}
		break;
		
		case $type211:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec18700026)+
		searchavailspec($allspec, $spec17700026)+
		searchavailspec($allspec, $spec95)+
		searchavailspec($allspec, $spec18700095)+
		searchavailspec($allspec, $spec700095))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</div>';
				}
		break;
		
		case $type212:
		if((searchavailspec($allspec, $spec700057)+
		searchavailspec($allspec, $spec18700057)+
		searchavailspec($allspec, $spec57))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области газоснабжения)</div>';
				}
		break;

		case $type213:
		if((searchavailspec($allspec, $spec700030)+
		searchavailspec($allspec, $spec30)+
		searchavailspec($allspec, $spec18700030)+
		searchavailspec($allspec, $spec17700030))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области электроснабжения и автоматизации)</div>';
				}
		break;

		case $type214:
		if((searchavailspec($allspec, $spec700097)+
		searchavailspec($allspec, $spec97)+
		searchavailspec($allspec, $spec18700097)+
		searchavailspec($allspec, $spec17700097))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области связи, сигнализации)</div>';
				}
		break;

		case $type215:
		if((searchavailspec($allspec, $spec700033)+
		searchavailspec($allspec, $spec33)+
		searchavailspec($allspec, $spec18700033)+
		searchavailspec($allspec, $spec17700033))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (строительство автомобильных дорог и аэродромов, строительство мостов, транспортных эстакад и путепроводов)</div>';
				}
		break;

		case $type216:
		if((searchavailspec($allspec, $spec700084)+
		searchavailspec($allspec, $spec84)+
		searchavailspec($allspec, $spec18700084)+
		searchavailspec($allspec, $spec17700084))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (строительство железных дорог)</div>';
				}
		break;

		case $type217:
		if((searchavailspec($allspec, $spec700085)+
		searchavailspec($allspec, $spec85)+
		searchavailspec($allspec, $spec18700085)+
		searchavailspec($allspec, $spec17700085))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (строительство сооружений транспортных тоннелей, метрополитенов)</div>';
				}
		break;

		case $type218:
		if((searchavailspec($allspec, $spec700034)+
		searchavailspec($allspec, $spec18700034)+
		searchavailspec($allspec, $spec34))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (гидротехническое и мелиоративное строительство)</div>';
				}
		break;

		case $type219:
		if((searchavailspec($allspec, $spec710113)+
		searchavailspec($allspec, $spec20113)+
		searchavailspec($allspec, $spec700113)+
		searchavailspec($allspec, $spec18700113)+
		searchavailspec($allspec, $spec113))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (благоустройство территорий)</div>';
				}
		break;

		case $type220:
		if((searchavailspec($allspec, $spec700064)+
		searchavailspec($allspec, $spec3)+
		searchavailspec($allspec, $spec64))>=3 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов ГАП меньше 3</div>';
				}
		break;
				
		case $type221:
		case $type222:
		case $type223:
		case $type224:
		case $type225:
		case $type226:
		break;
		
		case $type227:
		if((searchavailspec($allspec, $spec71043)+
		searchavailspec($allspec, $spec71044)+
		searchavailspec($allspec, $spec71045)+
		searchavailspec($allspec, $spec71039)+
		searchavailspec($allspec, $spec71046)+
		searchavailspec($allspec, $spec71048)+
		searchavailspec($allspec, $spec71047)+
		searchavailspec($allspec, $spec71059)+
		searchavailspec($allspec, $spec71063)+
		searchavailspec($allspec, $spec71074)+
		searchavailspec($allspec, $spec700128)+
		searchavailspec($allspec, $spec700047)+
		searchavailspec($allspec, $spec710128)+
		searchavailspec($allspec, $spec700048)+
		searchavailspec($allspec, $spec700045)+
		searchavailspec($allspec, $spec700046)+
		searchavailspec($allspec, $spec700073)+
		searchavailspec($allspec, $spec700059)+
		searchavailspec($allspec, $spec700039)+
		searchavailspec($allspec, $spec700126)+
		searchavailspec($allspec, $spec700043)+
		searchavailspec($allspec, $spec700096)+
		searchavailspec($allspec, $spec700074)+
		searchavailspec($allspec, $spec700063)+
		searchavailspec($allspec, $spec700044)+
		searchavailspec($allspec, $spec150)+
		searchavailspec($allspec, $spec17700043)+
		searchavailspec($allspec, $spec17700044)+
		searchavailspec($allspec, $spec45)+
		searchavailspec($allspec, $spec39)+
		searchavailspec($allspec, $spec17700046)+
		searchavailspec($allspec, $spec17700048)+
		searchavailspec($allspec, $spec17700047)+
		searchavailspec($allspec, $spec17700059)+
		searchavailspec($allspec, $spec63)+
		searchavailspec($allspec, $spec73)+
		searchavailspec($allspec, $spec96)+
		searchavailspec($allspec, $spec17700074)+
		searchavailspec($allspec, $spec126)+
		searchavailspec($allspec, $spec128)+
		searchavailspec($allspec, $spec278)+
		searchavailspec($allspec, $spec43)+
		searchavailspec($allspec, $spec44)+
		searchavailspec($allspec, $spec46)+
		searchavailspec($allspec, $spec48)+
		searchavailspec($allspec, $spec47)+
		searchavailspec($allspec, $spec59)+
		searchavailspec($allspec, $spec74)+
		searchavailspec($allspec, $spec260)+
		searchavailspec($allspec, $spec261)+
		searchavailspec($allspec, $spec262)+
		searchavailspec($allspec, $spec263))<1)
		{
				echo '<div class="red">Нет ни одного главного инженера<br></div>';
				}
				else {echo '<div class="green">Главный инженер есть<br></div>';}	

		if	
		((searchavailspec($allspec, $spec710114)+
		searchavailspec($allspec, $spec710115)+
		searchavailspec($allspec, $spec710116)+
		searchavailspec($allspec, $spec710117)+
		searchavailspec($allspec, $spec710118)+
		searchavailspec($allspec, $spec710119)+
		searchavailspec($allspec, $spec710120)+
		searchavailspec($allspec, $spec710121)+
		searchavailspec($allspec, $spec710122)+
		searchavailspec($allspec, $spec710123)+
		searchavailspec($allspec, $spec710124)+
		searchavailspec($allspec, $spec710125)+
		searchavailspec($allspec, $spec700120)+
		searchavailspec($allspec, $spec700115)+
		searchavailspec($allspec, $spec700122)+
		searchavailspec($allspec, $spec700124)+
		searchavailspec($allspec, $spec700125)+
		searchavailspec($allspec, $spec700114)+
		searchavailspec($allspec, $spec700117)+
		searchavailspec($allspec, $spec700121)+
		searchavailspec($allspec, $spec700123)+
		searchavailspec($allspec, $spec700118)+
		searchavailspec($allspec, $spec700116)+
		searchavailspec($allspec, $spec700119)+
		searchavailspec($allspec, $spec700147)+
		searchavailspec($allspec, $spec247)+
		searchavailspec($allspec, $spec147)+
		searchavailspec($allspec, $spec17700114)+
		searchavailspec($allspec, $spec17700115)+
		searchavailspec($allspec, $spec116)+
		searchavailspec($allspec, $spec117)+
		searchavailspec($allspec, $spec17700118)+
		searchavailspec($allspec, $spec119)+
		searchavailspec($allspec, $spec17700120)+
		searchavailspec($allspec, $spec17700121)+
		searchavailspec($allspec, $spec122)+
		searchavailspec($allspec, $spec123)+
		searchavailspec($allspec, $spec17700124)+
		searchavailspec($allspec, $spec125)+
		searchavailspec($allspec, $spec114)+
		searchavailspec($allspec, $spec115)+
		searchavailspec($allspec, $spec118)+
		searchavailspec($allspec, $spec120)+
		searchavailspec($allspec, $spec121)+
		searchavailspec($allspec, $spec124)+
		searchavailspec($allspec, $spec264)+
		searchavailspec($allspec, $spec265)+
		searchavailspec($allspec, $spec266))<1)
				{
				echo '<div class="red">Нет ни одного начальника (заместителя) ПТО<br></div>';
				}
				else {echo '<div class="green">Начальник (заместитель) ПТО есть<br></div>';}		
		
		if	
		((searchavailspec($allspec, $spec700141)+
		searchavailspec($allspec, $spec141))<1)
		
				{
				echo '<div class="red">Нет ни одного инженера по сметной работе<br></div>';
				}
		else {echo '<div class="green">Инженер по сметной работе есть<br></div>';}		
		break;
		
		case $type5827:
		break;
		
		case $type5828:
		if((searchavailspec($allspec, $spec71043)+
		searchavailspec($allspec, $spec71044)+
		searchavailspec($allspec, $spec71045)+
		searchavailspec($allspec, $spec71039)+
		searchavailspec($allspec, $spec71046)+
		searchavailspec($allspec, $spec71048)+
		searchavailspec($allspec, $spec71047)+
		searchavailspec($allspec, $spec71059)+
		searchavailspec($allspec, $spec71063)+
		searchavailspec($allspec, $spec71074)+
		searchavailspec($allspec, $spec700128)+
		searchavailspec($allspec, $spec700047)+
		searchavailspec($allspec, $spec710128)+
		searchavailspec($allspec, $spec700048)+
		searchavailspec($allspec, $spec700045)+
		searchavailspec($allspec, $spec700046)+
		searchavailspec($allspec, $spec700073)+
		searchavailspec($allspec, $spec700059)+
		searchavailspec($allspec, $spec700039)+
		searchavailspec($allspec, $spec700126)+
		searchavailspec($allspec, $spec700043)+
		searchavailspec($allspec, $spec700096)+
		searchavailspec($allspec, $spec700074)+
		searchavailspec($allspec, $spec700063)+
		searchavailspec($allspec, $spec700044)+
		searchavailspec($allspec, $spec150)+
		searchavailspec($allspec, $spec17700043)+
		searchavailspec($allspec, $spec17700044)+
		searchavailspec($allspec, $spec45)+
		searchavailspec($allspec, $spec39)+
		searchavailspec($allspec, $spec17700046)+
		searchavailspec($allspec, $spec17700048)+
		searchavailspec($allspec, $spec17700047)+
		searchavailspec($allspec, $spec17700059)+
		searchavailspec($allspec, $spec63)+
		searchavailspec($allspec, $spec73)+
		searchavailspec($allspec, $spec96)+
		searchavailspec($allspec, $spec17700074)+
		searchavailspec($allspec, $spec126)+
		searchavailspec($allspec, $spec128)+
		searchavailspec($allspec, $spec278)+
		searchavailspec($allspec, $spec43)+
		searchavailspec($allspec, $spec44)+
		searchavailspec($allspec, $spec46)+
		searchavailspec($allspec, $spec48)+
		searchavailspec($allspec, $spec47)+
		searchavailspec($allspec, $spec59)+
		searchavailspec($allspec, $spec74)+
		searchavailspec($allspec, $spec260)+
		searchavailspec($allspec, $spec261)+
		searchavailspec($allspec, $spec262)+
		searchavailspec($allspec, $spec263))<1)
		{
				echo '<div class="red">Нет ни одного главного инженера<br></div>';
				}
				else {echo '<div class="green">Главный инженер есть<br></div>';}	

		if	
		((searchavailspec($allspec, $spec710114)+
		searchavailspec($allspec, $spec710115)+
		searchavailspec($allspec, $spec710116)+
		searchavailspec($allspec, $spec710117)+
		searchavailspec($allspec, $spec710118)+
		searchavailspec($allspec, $spec710119)+
		searchavailspec($allspec, $spec710120)+
		searchavailspec($allspec, $spec710121)+
		searchavailspec($allspec, $spec710122)+
		searchavailspec($allspec, $spec710123)+
		searchavailspec($allspec, $spec710124)+
		searchavailspec($allspec, $spec710125)+
		searchavailspec($allspec, $spec700120)+
		searchavailspec($allspec, $spec700115)+
		searchavailspec($allspec, $spec700122)+
		searchavailspec($allspec, $spec700124)+
		searchavailspec($allspec, $spec700125)+
		searchavailspec($allspec, $spec700114)+
		searchavailspec($allspec, $spec700117)+
		searchavailspec($allspec, $spec700121)+
		searchavailspec($allspec, $spec700123)+
		searchavailspec($allspec, $spec700118)+
		searchavailspec($allspec, $spec700116)+
		searchavailspec($allspec, $spec700119)+
		searchavailspec($allspec, $spec700147)+
		searchavailspec($allspec, $spec247)+
		searchavailspec($allspec, $spec147)+
		searchavailspec($allspec, $spec17700114)+
		searchavailspec($allspec, $spec17700115)+
		searchavailspec($allspec, $spec116)+
		searchavailspec($allspec, $spec117)+
		searchavailspec($allspec, $spec17700118)+
		searchavailspec($allspec, $spec119)+
		searchavailspec($allspec, $spec17700120)+
		searchavailspec($allspec, $spec17700121)+
		searchavailspec($allspec, $spec122)+
		searchavailspec($allspec, $spec123)+
		searchavailspec($allspec, $spec17700124)+
		searchavailspec($allspec, $spec125)+
		searchavailspec($allspec, $spec114)+
		searchavailspec($allspec, $spec115)+
		searchavailspec($allspec, $spec118)+
		searchavailspec($allspec, $spec120)+
		searchavailspec($allspec, $spec121)+
		searchavailspec($allspec, $spec124)+
		searchavailspec($allspec, $spec264)+
		searchavailspec($allspec, $spec265)+
		searchavailspec($allspec, $spec266))<1)
		
				{
				echo '<div class="red">Нет ни одного начальника (заместителя) ПТО<br></div>';
				}
				else {echo '<div class="green">Начальник (заместитель) ПТО есть<br></div>';}		
		
		if	
		((searchavailspec($allspec, $spec700141)+
		searchavailspec($allspec, $spec141))<1)
		
				{
				echo '<div class="red">Нет ни одного инженера по сметной работе<br></div>';
				}
		else {echo '<div class="green">Инженер по сметной работе есть<br></div>';}		
		break;		
		
		case $type5829:
		if((searchavailspec($allspec, $spec71043)+
		searchavailspec($allspec, $spec71044)+
		searchavailspec($allspec, $spec71045)+
		searchavailspec($allspec, $spec71039)+
		searchavailspec($allspec, $spec71046)+
		searchavailspec($allspec, $spec71048)+
		searchavailspec($allspec, $spec71047)+
		searchavailspec($allspec, $spec71059)+
		searchavailspec($allspec, $spec71063)+
		searchavailspec($allspec, $spec71074)+
		searchavailspec($allspec, $spec700128)+
		searchavailspec($allspec, $spec700047)+
		searchavailspec($allspec, $spec710128)+
		searchavailspec($allspec, $spec700048)+
		searchavailspec($allspec, $spec700045)+
		searchavailspec($allspec, $spec700046)+
		searchavailspec($allspec, $spec700073)+
		searchavailspec($allspec, $spec700059)+
		searchavailspec($allspec, $spec700039)+
		searchavailspec($allspec, $spec700126)+
		searchavailspec($allspec, $spec700043)+
		searchavailspec($allspec, $spec700096)+
		searchavailspec($allspec, $spec700074)+
		searchavailspec($allspec, $spec700063)+
		searchavailspec($allspec, $spec700044)+
		searchavailspec($allspec, $spec150)+
		searchavailspec($allspec, $spec17700043)+
		searchavailspec($allspec, $spec17700044)+
		searchavailspec($allspec, $spec45)+
		searchavailspec($allspec, $spec39)+
		searchavailspec($allspec, $spec17700046)+
		searchavailspec($allspec, $spec17700048)+
		searchavailspec($allspec, $spec17700047)+
		searchavailspec($allspec, $spec17700059)+
		searchavailspec($allspec, $spec63)+
		searchavailspec($allspec, $spec73)+
		searchavailspec($allspec, $spec96)+
		searchavailspec($allspec, $spec17700074)+
		searchavailspec($allspec, $spec126)+
		searchavailspec($allspec, $spec128)+
		searchavailspec($allspec, $spec278)+
		searchavailspec($allspec, $spec43)+
		searchavailspec($allspec, $spec44)+
		searchavailspec($allspec, $spec46)+
		searchavailspec($allspec, $spec48)+
		searchavailspec($allspec, $spec47)+
		searchavailspec($allspec, $spec59)+
		searchavailspec($allspec, $spec74)+
		searchavailspec($allspec, $spec260)+
		searchavailspec($allspec, $spec261)+
		searchavailspec($allspec, $spec262)+
		searchavailspec($allspec, $spec263))<1)
		{
				echo '<div class="red">Нет ни одного главного инженера<br></div>';
				}
				else {echo '<div class="green">Главный инженер есть<br></div>';}	

		if	
		((searchavailspec($allspec, $spec710114)+
		searchavailspec($allspec, $spec710115)+
		searchavailspec($allspec, $spec710116)+
		searchavailspec($allspec, $spec710117)+
		searchavailspec($allspec, $spec710118)+
		searchavailspec($allspec, $spec710119)+
		searchavailspec($allspec, $spec710120)+
		searchavailspec($allspec, $spec710121)+
		searchavailspec($allspec, $spec710122)+
		searchavailspec($allspec, $spec710123)+
		searchavailspec($allspec, $spec710124)+
		searchavailspec($allspec, $spec710125)+
		searchavailspec($allspec, $spec700120)+
		searchavailspec($allspec, $spec700115)+
		searchavailspec($allspec, $spec700122)+
		searchavailspec($allspec, $spec700124)+
		searchavailspec($allspec, $spec700125)+
		searchavailspec($allspec, $spec700114)+
		searchavailspec($allspec, $spec700117)+
		searchavailspec($allspec, $spec700121)+
		searchavailspec($allspec, $spec700123)+
		searchavailspec($allspec, $spec700118)+
		searchavailspec($allspec, $spec700116)+
		searchavailspec($allspec, $spec700119)+
		searchavailspec($allspec, $spec700147)+
		searchavailspec($allspec, $spec247)+
		searchavailspec($allspec, $spec147)+
		searchavailspec($allspec, $spec17700114)+
		searchavailspec($allspec, $spec17700115)+
		searchavailspec($allspec, $spec116)+
		searchavailspec($allspec, $spec117)+
		searchavailspec($allspec, $spec17700118)+
		searchavailspec($allspec, $spec119)+
		searchavailspec($allspec, $spec17700120)+
		searchavailspec($allspec, $spec17700121)+
		searchavailspec($allspec, $spec122)+
		searchavailspec($allspec, $spec123)+
		searchavailspec($allspec, $spec17700124)+
		searchavailspec($allspec, $spec125)+
		searchavailspec($allspec, $spec114)+
		searchavailspec($allspec, $spec115)+
		searchavailspec($allspec, $spec118)+
		searchavailspec($allspec, $spec120)+
		searchavailspec($allspec, $spec121)+
		searchavailspec($allspec, $spec124)+
		searchavailspec($allspec, $spec264)+
		searchavailspec($allspec, $spec265)+
		searchavailspec($allspec, $spec266))<1)
		
				{
				echo '<div class="red">Нет ни одного начальника (заместителя) ПТО<br></div>';
				}
				else {echo '<div class="green">Начальник (заместитель) ПТО есть<br></div>';}		
		
		if	
		((searchavailspec($allspec, $spec700141)+
		searchavailspec($allspec, $spec141))<1)
		
				{
				echo '<div class="red">Нет ни одного инженера по сметной работе<br></div>';
				}
		else {echo '<div class="green">Инженер по сметной работе есть<br></div>';}		
		break;
		
		case $type228:
		break;
		
		case $type229:
		case $type5864:
				if((searchavailspec($allspec, $spec140)+searchavailspec($allspec, $spec142)+
				searchavailspec($allspec, $spec700140)+searchavailspec($allspec, $spec700142))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного или ведущего геодезиста</div>';
				}
		break;
		
		case $type230:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type231:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec15)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec16)+searchavailspec($allspec, $spec76)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec78)+
				searchavailspec($allspec, $spec79)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec81)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700216)+searchavailspec($allspec, $spec17700243)+
				searchavailspec($allspec, $spec17700245)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec245)+searchavailspec($allspec, $spec205)+
				searchavailspec($allspec, $spec231)+searchavailspec($allspec, $spec233)+
				searchavailspec($allspec, $spec234)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec215)+
				searchavailspec($allspec, $spec216)+searchavailspec($allspec, $spec243))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type232:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+					
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type233:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type234:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+				
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
				
		case $type235:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type236:
			if((searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+				
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700203)+				
				searchavailspec($allspec, $spec17700223)+								
				searchavailspec($allspec, $spec17700231))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
			
		case $type237:
				if((searchavailspec($allspec, $spec0)+
					searchavailspec($allspec, $spec9)+
					searchavailspec($allspec, $spec11)+
					searchavailspec($allspec, $spec12)+
					searchavailspec($allspec, $spec15)+
					searchavailspec($allspec, $spec18)+
					searchavailspec($allspec, $spec19)+
					searchavailspec($allspec, $spec16)+
					searchavailspec($allspec, $spec41)+
					searchavailspec($allspec, $spec76)+
					searchavailspec($allspec, $spec77)+
					searchavailspec($allspec, $spec78)+
					searchavailspec($allspec, $spec79)+
					searchavailspec($allspec, $spec80)+
					searchavailspec($allspec, $spec81)+
					searchavailspec($allspec, $spec82)+
					searchavailspec($allspec, $spec83)+
					searchavailspec($allspec, $spec194)+
					searchavailspec($allspec, $spec195)+
					searchavailspec($allspec, $spec196)+
					searchavailspec($allspec, $spec198)+
					searchavailspec($allspec, $spec199)+
					searchavailspec($allspec, $spec203)+
					searchavailspec($allspec, $spec205)+
					searchavailspec($allspec, $spec206)+
					searchavailspec($allspec, $spec208)+
					searchavailspec($allspec, $spec215)+
					searchavailspec($allspec, $spec216)+
					searchavailspec($allspec, $spec222)+
					searchavailspec($allspec, $spec223)+
					searchavailspec($allspec, $spec224)+
					searchavailspec($allspec, $spec226)+
					searchavailspec($allspec, $spec227)+
					searchavailspec($allspec, $spec231)+
					searchavailspec($allspec, $spec233)+
					searchavailspec($allspec, $spec234)+
					searchavailspec($allspec, $spec236)+
					searchavailspec($allspec, $spec243)+
					searchavailspec($allspec, $spec245)+
					searchavailspec($allspec, $spec17700195)+
					searchavailspec($allspec, $spec17700199)+
					searchavailspec($allspec, $spec17700203)+
					searchavailspec($allspec, $spec17700205)+
					searchavailspec($allspec, $spec17700209)+
					searchavailspec($allspec, $spec17700215)+
					searchavailspec($allspec, $spec17700216)+
					searchavailspec($allspec, $spec17700223)+
					searchavailspec($allspec, $spec17700231)+
					searchavailspec($allspec, $spec17700233)+
					searchavailspec($allspec, $spec17700234)+
					searchavailspec($allspec, $spec17700237)+
					searchavailspec($allspec, $spec17700243)+
					searchavailspec($allspec, $spec17700245))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type238:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;			
		
case $type239:
				if((searchavailspec($allspec, $spec9)+
					searchavailspec($allspec, $spec18)+
					searchavailspec($allspec, $spec19)+
					searchavailspec($allspec, $spec41)+
					searchavailspec($allspec, $spec82)+
					searchavailspec($allspec, $spec83)+
					searchavailspec($allspec, $spec194)+
					searchavailspec($allspec, $spec195)+
					searchavailspec($allspec, $spec196)+
					searchavailspec($allspec, $spec198)+
					searchavailspec($allspec, $spec199)+
					searchavailspec($allspec, $spec209)+
					searchavailspec($allspec, $spec222)+
					searchavailspec($allspec, $spec223)+
					searchavailspec($allspec, $spec224)+
					searchavailspec($allspec, $spec226)+
					searchavailspec($allspec, $spec227)+
					searchavailspec($allspec, $spec237)+
					searchavailspec($allspec, $spec17700195)+
					searchavailspec($allspec, $spec17700199)+
					searchavailspec($allspec, $spec17700209)+
					searchavailspec($allspec, $spec17700223)+
					searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
				
		case $type240:
		case $type5869:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec267)+searchavailspec($allspec, $spec271))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type241:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type242:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type243:
		case $type5872:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
			
		case $type244:
		case $type5873:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
						
		case $type245:
		case $type5874:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec76)+searchavailspec($allspec, $spec77)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec17700195)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700197)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec17700203)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec197)+searchavailspec($allspec, $spec225)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec205)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec233)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
				
		case $type246:
		case $type5875:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type247:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type248:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec110)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700211)+searchavailspec($allspec, $spec17700239)+
				searchavailspec($allspec, $spec211)+searchavailspec($allspec, $spec239)+				
				searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
	
		case $type249:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type250:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type251:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type252:
				if((searchavailspec($allspec, $spec11)+
					searchavailspec($allspec, $spec76)+
					searchavailspec($allspec, $spec203)+
					searchavailspec($allspec, $spec205)+
					searchavailspec($allspec, $spec212)+
					searchavailspec($allspec, $spec231)+
					searchavailspec($allspec, $spec233)+
					searchavailspec($allspec, $spec235)+
					searchavailspec($allspec, $spec17700203)+
					searchavailspec($allspec, $spec17700205)+
					searchavailspec($allspec, $spec17700231)+
					searchavailspec($allspec, $spec17700233))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}	
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;		

		case $type253:
				if((searchavailspec($allspec, $spec11)+
					searchavailspec($allspec, $spec77)+
					searchavailspec($allspec, $spec203)+
					searchavailspec($allspec, $spec204)+
					searchavailspec($allspec, $spec231)+
					searchavailspec($allspec, $spec232)+
					searchavailspec($allspec, $spec17700203)+
					searchavailspec($allspec, $spec17700204)+
					searchavailspec($allspec, $spec17700231)+
					searchavailspec($allspec, $spec17700232))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
			else if ((searchavailspec($allspec, $spec62)+
					  searchavailspec($allspec, $spec240)+
					  searchavailspec($allspec, $spec212))<1)	
			{
				echo '<div class="red">Нет прораба(мастера) по установке приборов учета тепло- и водопотребления</div>';
				}	
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;
			
		case $type254:
				if((searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec234))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;		
		
		case $type255:
				if((searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec207)+searchavailspec($allspec, $spec234))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))<1)	
			{
				echo '<div class="red">Нет прораба(мастера) по установке приборов учета тепло- и водопотребления</div>';
				}	
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;		
				
		case $type256:
		case $type5885:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec17700216)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700245)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec245)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec216))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type257:
		case $type5886:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec81)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700246)+
				searchavailspec($allspec, $spec17700217)+searchavailspec($allspec, $spec17700215)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec217)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec246))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type258:
		break;		
		
		case $type259:
				if((searchavailspec($allspec, $spec13)+searchavailspec($allspec, $spec193)+searchavailspec($allspec, $spec221))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
				
		case $type260:
		case $type5888:
				if((searchavailspec($allspec, $spec0)+searchavailspec($allspec, $spec16)+
				searchavailspec($allspec, $spec218)+searchavailspec($allspec, $spec244))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type261:
				if((searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec206)+searchavailspec($allspec, $spec207)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec234))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type262:
				if((searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec222))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type263:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type264:
		case $type5892:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type265:
				if((searchavailspec($allspec, $spec710112)+searchavailspec($allspec, $spec112)+
				searchavailspec($allspec, $spec20112)+searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec220))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;			
		
		case $type266:
				if((searchavailspec($allspec, $spec82)+searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec224))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;			
						
		case $type267:
				if((searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700237)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type268:
		case $type269:
		break;		

		case $type270:
						if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)
					+searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
			
		case $type271:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5753:
		if((searchavailspec($allspec, $spec700093)+searchavailspec($allspec, $spec700135)+
				searchavailspec($allspec, $spec800135)+searchavailspec($allspec, $spec93)+
				searchavailspec($allspec, $spec17700135))>=4){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		}			
		}
	}
	else {
	        for ($i = 0; $i <= count($types_of_jobs[$k]->field_field_vidy_rabot_13_05_2017_); $i++) 
		{ 
			$types_of_jobs2=$types_of_jobs[$k]->field_field_vidy_rabot_13_05_2017_[$i][raw];
			$types_of_jobs3=$types_of_jobs2[taxonomy_term]->name;
			$vidyrabot[$k][$i]=$types_of_jobs3; // переменная для вывода вне массива
			print_r ("</br>".$types_of_jobs3."</br>");

			
		switch ($types_of_jobs3) {
 		
		case $type5594:
		case $type5907:
		break;
		
		case $type5595:
		case $type5908:
		if((searchavailspec($allspec, $spec700166)+searchavailspec($allspec, $spec166)+searchavailspec($allspec, $spec173))>=5){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-геодезические изыскания меньше 5</div>';
				}
		break;
		
		case $type5616:
		case $type5909:
			if((searchavailspec($allspec, $spec700167)+searchavailspec($allspec, $spec167)+searchavailspec($allspec, $spec174))>=5){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-геологические изыскания меньше 5</div>';
				}
		break;
		
		case $type5625:
		case $type5910:
			if((searchavailspec($allspec, $spec700168)+searchavailspec($allspec, $spec168))>=5){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-гидрометеорологические изыскания меньше 5</div>';
				}
		break;	
	
		case $type5630:
			if((searchavailspec($allspec, $spec700169)+searchavailspec($allspec, $spec169))>=5){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-экологические изыскания меньше 5</div>';
				}
		break;
		
		case $type5647:
			if((searchavailspec($allspec, $spec700170)+searchavailspec($allspec, $spec170))>=5){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-геотехнические изыскания меньше 5</div>';
				}
		break;
		
	   case $type5648:
	   case $type5649:
	   case $type5650:
	   case $type5651:
	   case $type5652:
	   case $type5653:
	   break;
	   
		case $type5654:
			if((searchavailspec($allspec, $spec171)+searchavailspec($allspec, $spec171))>=5){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих обследование состояния грунтов оснований зданий и сооружений меньше 5</div>';
				}
		break;
	
		case $type5655:
			if((searchavailspec($allspec, $spec700064)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3))>=1 or 
			(searchavailspec($allspec, $spec4)+searchavailspec($allspec, $spec700129)+searchavailspec($allspec, $spec700004)+searchavailspec($allspec, $spec148)+searchavailspec($allspec, $spec17700129)+searchavailspec($allspec, $spec129)+searchavailspec($allspec, $spec275))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного специалиста ГАП или ГИП</div>';
				}
		break;
		
		case $type5656:
		case $type5911:
			if((searchavailspec($allspec, $spec101)+
				searchavailspec($allspec, $spec102)+
				searchavailspec($allspec, $spec103)+
				searchavailspec($allspec, $spec104)+
				searchavailspec($allspec, $spec105)+
				searchavailspec($allspec, $spec106)+
				searchavailspec($allspec, $spec107)+
				searchavailspec($allspec, $spec108)+
				searchavailspec($allspec, $spec109)+
				searchavailspec($allspec, $spec137)+
				searchavailspec($allspec, $spec138)+
				searchavailspec($allspec, $spec162)+		
				searchavailspec($allspec, $spec700101)+
				searchavailspec($allspec, $spec700102)+
				searchavailspec($allspec, $spec700103)+
				searchavailspec($allspec, $spec700104)+
				searchavailspec($allspec, $spec700105)+
				searchavailspec($allspec, $spec700106)+
				searchavailspec($allspec, $spec700107)+
				searchavailspec($allspec, $spec700108)+
				searchavailspec($allspec, $spec700109)+
				searchavailspec($allspec, $spec700137)+
				searchavailspec($allspec, $spec700138)+
				searchavailspec($allspec, $spec700162)+
				searchavailspec($allspec, $spec17700101)+
				searchavailspec($allspec, $spec17700102)+
				searchavailspec($allspec, $spec17700103)+
				searchavailspec($allspec, $spec17700104)+
				searchavailspec($allspec, $spec17700105)+
				searchavailspec($allspec, $spec17700106)+
				searchavailspec($allspec, $spec17700107)+
				searchavailspec($allspec, $spec17700108)+
				searchavailspec($allspec, $spec17700109))<1) 
			 {
				echo '<div class="red">Нет ни одного аттестованного начальника (заведующего) структурного подразделения</div>';
				}
			else
				{
				echo '<div class="green">Начальник (заведующий) структурного подразделения есть</div>';
				}			
			if	((
				searchavailspec($allspec, $spec3)+
				searchavailspec($allspec, $spec64)+
				searchavailspec($allspec, $spec700064))<4
				and (
				searchavailspec($allspec, $spec4)+
				searchavailspec($allspec, $spec129)+
				searchavailspec($allspec, $spec148)+
				searchavailspec($allspec, $spec275)+
				searchavailspec($allspec, $spec700004)+
				searchavailspec($allspec, $spec700129)+
				searchavailspec($allspec, $spec17700129))<4)
             {
				echo '<div class="red">Количество специалистов ГАП или ГИП меньше 4</div>';
				}
			 else
				{
				echo '<div class="green">Количество специалистов ГАП или ГИП 4 или более</div>';
				} 
			 if (searchavailspec($allspec, $spec248)<1)
			{
				echo '<div class="red">Нет ни одного главного специалиста по охране окружающей среды</div>';
				} 
			else
			{
				echo '<div class="green">Специалист по охране окружающей среды есть</div>';
				}	
			if ((searchavailspec($allspec, $spec164)+
				 searchavailspec($allspec, $spec700164))<1)
			{
				echo '<div class="red">Нет ни одного главного специалиста по организации строительства</div>';
				} 
			else
			{
				echo '<div class="green">Главный специалист по организации строительства есть</div>';
				}	
			if (searchavailspec($allspec, $spec249)<1)
			{
				echo '<div class="red">Нет ни одного главного специалиста по инженерно-техническим мероприятиям гражданской обороны</div>';
				}
			else {
			echo '<div class="green">Главный специалист по инженерно-техническим мероприятиям гражданской обороны есть</div>';
				}
		break;

		case $type5657:
        case $type5912:
		break;
		
		case $type5658:
		case $type5913:
			if((searchavailspec($allspec, $spec700163)+searchavailspec($allspec, $spec163))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (генеральный план)</div>';
				}
		break;		
		
		case $type5659:
		case $type5914:
			if((searchavailspec($allspec, $spec252)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3)+searchavailspec($allspec, $spec700064))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (архитектурные решения) либо ГАПа</div>';
				}
		break;		
				
		case $type5660:
		case $type5915:
			if(searchavailspec($allspec, $spec139)+
			   searchavailspec($allspec, $spec700139)>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (сметная документация)</div>';
				}
		break;		
			
		case $type5661:
		case $type5916:
		if((searchavailspec($allspec, $spec66)+searchavailspec($allspec, $spec17700066)+searchavailspec($allspec, $spec700066))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (конструктивные решения)</div>';
				}			
		break;		
		
		case $type5662:
		case $type5917:
		break;
		
		case $type5664:
		case $type5919:
			if((searchavailspec($allspec, $spec17700071)+searchavailspec($allspec, $spec700071)+searchavailspec($allspec, $spec71))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (холодоснабжение))</div>';
				}
		break;		
				
		case $type5665:
		case $type5920:
			if((searchavailspec($allspec, $spec17700067)+searchavailspec($allspec, $spec700067)+searchavailspec($allspec, $spec67))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</div>';
				}
		break;		
		
		case $type5666:
		case $type5921:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</div>';
				}
		break;
				
		case $type5667:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</div>';
				}
		break;		
		
		case $type5663:
		case $type5918:
			if((searchavailspec($allspec, $spec17700068)+searchavailspec($allspec, $spec700068)+searchavailspec($allspec, $spec68))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (отопление, вентиляция и кондиционирование воздуха))</div>';
				}
		break;		
		
		case $type5668:
		case $type5922:
			if((searchavailspec($allspec, $spec17700099)+searchavailspec($allspec, $spec700099)+searchavailspec($allspec, $spec99))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</div>';
				}
		break;
		
		case $type5669:
		case $type5923:
			if((searchavailspec($allspec, $spec17700069)+searchavailspec($allspec, $spec700069)+searchavailspec($allspec, $spec69))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</div>';
				}
		break;

		case $type5670:
		case $type5924:
		break;
		
		case $type5671:
		case $type5925:
			if((searchavailspec($allspec, $spec17700070)+searchavailspec($allspec, $spec700070)+searchavailspec($allspec, $spec70))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (тепловые сети))</div>';
				}
		break;		
					
		case $type5672:
		case $type5926:
			if((searchavailspec($allspec, $spec67)+
				searchavailspec($allspec, $spec700067)+
				searchavailspec($allspec, $spec17700067))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</div>';
				}
		break;		
		
		case $type5673:
		case $type5927:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</div>';
				}
		break;		
		
		case $type5674:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</div>';
				}
		break;	

		case $type5675:
		case $type5928:
			if((searchavailspec($allspec, $spec17700069)+searchavailspec($allspec, $spec700069)+searchavailspec($allspec, $spec69))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</div>';
				}
		break;		
			
		case $type5676: 
		break;
		
		
		case $type5677:
		case $type5929:
			if(searchavailspec($allspec, $spec249)>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (охрана окружающей среды)</div>';
				}
		break;
		
		case $type5678:
			if((searchavailspec($allspec, $spec700164)+searchavailspec($allspec, $spec164))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (организация строительства)</div>';
				}
		break;		
		
		case $type5679:
		case $type5930:
			if(searchavailspec($allspec, $spec248)>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (охрана окружающей среды)</div>';
				}
		break;
		
		case $type5680:
		case $type5681:
		case $type5931:
		case $type5932:
		break;
				
		case $type5682:
		case $type5933:
			$count=0;
			$count=countoverzero(searchavailspec($allspec, $spec24),$count);
			$count=countoverzero(searchavailspec($allspec, $spec26),$count);
			$count=countoverzero(searchavailspec($allspec, $spec30),$count);
			$count=countoverzero(searchavailspec($allspec, $spec33),$count);
			$count=countoverzero(searchavailspec($allspec, $spec34),$count);
			$count=countoverzero(searchavailspec($allspec, $spec57),$count);
			$count=countoverzero(searchavailspec($allspec, $spec61),$count);
			$count=countoverzero(searchavailspec($allspec, $spec84),$count);
			$count=countoverzero(searchavailspec($allspec, $spec85),$count);
			$count=countoverzero(searchavailspec($allspec, $spec95),$count);
			$count=countoverzero(searchavailspec($allspec, $spec97),$count);
			$count=countoverzero(searchavailspec($allspec, $spec113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec144),$count);
			$count=countoverzero(searchavailspec($allspec, $spec145),$count);
			$count=countoverzero(searchavailspec($allspec, $spec146),$count);
			$count=countoverzero(searchavailspec($allspec, $spec276),$count);
			$count=countoverzero(searchavailspec($allspec, $spec277),$count);
			$count=countoverzero(searchavailspec($allspec, $spec20113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700024),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700026),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700030),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700033),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700034),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700057),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700061),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700084),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700085),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700095),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700097),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec710113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700024),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700026),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700030),$count);			
			$count=countoverzero(searchavailspec($allspec, $spec17700033),$count);							
			$count=countoverzero(searchavailspec($allspec, $spec17700084),$count);	
			$count=countoverzero(searchavailspec($allspec, $spec17700085),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700061),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700097),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700024),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700026),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700030),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700033),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700034),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700057),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700061),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700084),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700085),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700095),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700097),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700276),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700277),$count);
				
		if((searchavailspec($allspec, $spec40)+searchavailspec($allspec, $spec700187)
			+searchavailspec($allspec, $spec188)+searchavailspec($allspec, $spec189)+
		    searchavailspec($allspec, $spec18700187)+
			searchavailspec($allspec, $spec187))<2)
		{
			echo '<div class="red">Количество руководителей проекта меньше 2</div>';
				}		
			else {
			echo '<div class="green">Количество руководителей проекта 2 или больше</div>';		
				}
			if	($count<6)
				{
				echo '<div class="red">Количество специалистов по техническому надзору меньше 6</div>';
				}		
			else {
				echo '<div class="green">Количество специалистов по техническому надзору 6 или больше</div>';
				}	
		break;
		
		case $type5683:
		case $type5934:
		if((searchavailspec($allspec, $spec700024)+
		searchavailspec($allspec, $spec144)+
		searchavailspec($allspec, $spec145)+
		searchavailspec($allspec, $spec146)+
		searchavailspec($allspec, $spec24)+
		searchavailspec($allspec, $spec18700024)+
		searchavailspec($allspec, $spec17700024))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (общестроительные работы)</div>';
				}
		break;		
		
		case $type5684:
		case $type5935:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec18700026)+
		searchavailspec($allspec, $spec17700026))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</div>';
				}
		break;		

		case $type5685:
		case $type5936:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec18700026)+
		searchavailspec($allspec, $spec17700026))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</div>';
				}
		break;		
		
		case $type5686:
		case $type5937:
		if((searchavailspec($allspec, $spec277)+
		searchavailspec($allspec, $spec18700277))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (устройство систем холодоснабжения)</div>';
				}
		break;			
		
		case $type5687:
		case $type5938:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec18700026)+
		searchavailspec($allspec, $spec17700026)+
		searchavailspec($allspec, $spec95)+
		searchavailspec($allspec, $spec18700095)+
		searchavailspec($allspec, $spec700095))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</div>';
				}
		break;		
		
		case $type5688:
		case $type5939:
		if((searchavailspec($allspec, $spec700057)+
		searchavailspec($allspec, $spec18700057)+
		searchavailspec($allspec, $spec57))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области газоснабжения)</div>';
				}
		break;
		
		case $type5689:
		case $type5940:
		if((searchavailspec($allspec, $spec700030)+
		searchavailspec($allspec, $spec30)+
		searchavailspec($allspec, $spec18700030)+
		searchavailspec($allspec, $spec17700030))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области электроснабжения и автоматизации)</div>';
				}
		break;	
				
		case $type5690:
		case $type5941:
		if((searchavailspec($allspec, $spec700097)+
		searchavailspec($allspec, $spec97)+
		searchavailspec($allspec, $spec18700097)+
		searchavailspec($allspec, $spec17700097))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области связи, сигнализации)</div>';
				}
		break;	
		
		case $type5691:
		case $type5942:
		if((searchavailspec($allspec, $spec700033)+
		searchavailspec($allspec, $spec33)+
		searchavailspec($allspec, $spec18700033)+
		searchavailspec($allspec, $spec17700033))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (строительство автомобильных дорог и аэродромов, строительство мостов, транспортных эстакад и путепроводов)</div>';
				}
		break;		
		
		case $type5692:
		case $type5943:
		if((searchavailspec($allspec, $spec700084)+
		searchavailspec($allspec, $spec84)+
		searchavailspec($allspec, $spec18700084)+
		searchavailspec($allspec, $spec17700084))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (строительство железных дорог)</div>';
				}
		break;		
		
		case $type5693:
		case $type5944:
		if((searchavailspec($allspec, $spec700085)+
		searchavailspec($allspec, $spec85)+
		searchavailspec($allspec, $spec18700085)+
		searchavailspec($allspec, $spec17700085))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (строительство сооружений транспортных тоннелей, метрополитенов)</div>';
				}
		break;	
		
		case $type5694:
		case $type5945:
		if((searchavailspec($allspec, $spec700034)+
		searchavailspec($allspec, $spec18700034)+
		searchavailspec($allspec, $spec34))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (гидротехническое и мелиоративное строительство)</div>';
				}
		break;	
		
		case $type5695:
		if((searchavailspec($allspec, $spec710113)+
		searchavailspec($allspec, $spec20113)+
		searchavailspec($allspec, $spec700113)+
		searchavailspec($allspec, $spec18700113)+
		searchavailspec($allspec, $spec113))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (благоустройство территорий)</div>';
				}
		break;		
			
		case $type5696:
		case $type5946:
		if((searchavailspec($allspec, $spec276)+
		searchavailspec($allspec, $spec18700276))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (монтаж технологических трубопроводов и оборудования)</div>';
				}
		break;		

		case $type5697:
		case $type5947:
		if((searchavailspec($allspec, $spec700061)+
		searchavailspec($allspec, $spec17700061)+
		searchavailspec($allspec, $spec18700061)+
		searchavailspec($allspec, $spec61))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (устройство магистральных трубопроводов для транспортирования нефти, газа, нефтепродуктов)</div>';
				}
		break;
		
		case $type5698:
		case $type5948:
		if((searchavailspec($allspec, $spec700064)+searchavailspec($allspec, $spec3)+searchavailspec($allspec, $spec64))>=3 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов ГАП меньше 3</div>';
				}
		break;		
		
		case $type5699:
		case $type5700:	
		case $type5701:
		case $type5702:
		case $type5703:		
		case $type5704:	
		case $type5705:
		case $type5949:
		case $type5950:
		case $type5951:
		case $type5952:
		case $type5953:
		case $type5954:
		break;
		
		case $type5706:
		case $type5955:
		if((searchavailspec($allspec, $spec71043)+
		searchavailspec($allspec, $spec71044)+
		searchavailspec($allspec, $spec71045)+
		searchavailspec($allspec, $spec71039)+
		searchavailspec($allspec, $spec71046)+
		searchavailspec($allspec, $spec71048)+
		searchavailspec($allspec, $spec71047)+
		searchavailspec($allspec, $spec71059)+
		searchavailspec($allspec, $spec71063)+
		searchavailspec($allspec, $spec71074)+
		searchavailspec($allspec, $spec700128)+
		searchavailspec($allspec, $spec700047)+
		searchavailspec($allspec, $spec710128)+
		searchavailspec($allspec, $spec700048)+
		searchavailspec($allspec, $spec700045)+
		searchavailspec($allspec, $spec700046)+
		searchavailspec($allspec, $spec700073)+
		searchavailspec($allspec, $spec700059)+
		searchavailspec($allspec, $spec700039)+
		searchavailspec($allspec, $spec700126)+
		searchavailspec($allspec, $spec700043)+
		searchavailspec($allspec, $spec700096)+
		searchavailspec($allspec, $spec700074)+
		searchavailspec($allspec, $spec700063)+
		searchavailspec($allspec, $spec700044)+
		searchavailspec($allspec, $spec150)+
		searchavailspec($allspec, $spec17700043)+
		searchavailspec($allspec, $spec17700044)+
		searchavailspec($allspec, $spec45)+
		searchavailspec($allspec, $spec39)+
		searchavailspec($allspec, $spec17700046)+
		searchavailspec($allspec, $spec17700048)+
		searchavailspec($allspec, $spec17700047)+
		searchavailspec($allspec, $spec17700059)+
		searchavailspec($allspec, $spec63)+
		searchavailspec($allspec, $spec73)+
		searchavailspec($allspec, $spec96)+
		searchavailspec($allspec, $spec17700074)+
		searchavailspec($allspec, $spec126)+
		searchavailspec($allspec, $spec128)+
		searchavailspec($allspec, $spec278)+
		searchavailspec($allspec, $spec43)+
		searchavailspec($allspec, $spec44)+
		searchavailspec($allspec, $spec46)+
		searchavailspec($allspec, $spec48)+
		searchavailspec($allspec, $spec47)+
		searchavailspec($allspec, $spec59)+
		searchavailspec($allspec, $spec74)+
		searchavailspec($allspec, $spec260)+
		searchavailspec($allspec, $spec261)+
		searchavailspec($allspec, $spec262)+
		searchavailspec($allspec, $spec263))<1)
		{
				echo '<div class="red">Нет ни одного главного инженера<br></div>';
				}
				else {echo '<div class="green">Главный инженер есть<br></div>';}	

		if	
		((searchavailspec($allspec, $spec710114)+
		searchavailspec($allspec, $spec710115)+
		searchavailspec($allspec, $spec710116)+
		searchavailspec($allspec, $spec710117)+
		searchavailspec($allspec, $spec710118)+
		searchavailspec($allspec, $spec710119)+
		searchavailspec($allspec, $spec710120)+
		searchavailspec($allspec, $spec710121)+
		searchavailspec($allspec, $spec710122)+
		searchavailspec($allspec, $spec710123)+
		searchavailspec($allspec, $spec710124)+
		searchavailspec($allspec, $spec710125)+
		searchavailspec($allspec, $spec700120)+
		searchavailspec($allspec, $spec700115)+
		searchavailspec($allspec, $spec700122)+
		searchavailspec($allspec, $spec700124)+
		searchavailspec($allspec, $spec700125)+
		searchavailspec($allspec, $spec700114)+
		searchavailspec($allspec, $spec700117)+
		searchavailspec($allspec, $spec700121)+
		searchavailspec($allspec, $spec700123)+
		searchavailspec($allspec, $spec700118)+
		searchavailspec($allspec, $spec700116)+
		searchavailspec($allspec, $spec700119)+
		searchavailspec($allspec, $spec700147)+
		searchavailspec($allspec, $spec247)+
		searchavailspec($allspec, $spec147)+
		searchavailspec($allspec, $spec17700114)+
		searchavailspec($allspec, $spec17700115)+
		searchavailspec($allspec, $spec116)+
		searchavailspec($allspec, $spec117)+
		searchavailspec($allspec, $spec17700118)+
		searchavailspec($allspec, $spec119)+
		searchavailspec($allspec, $spec17700120)+
		searchavailspec($allspec, $spec17700121)+
		searchavailspec($allspec, $spec122)+
		searchavailspec($allspec, $spec123)+
		searchavailspec($allspec, $spec17700124)+
		searchavailspec($allspec, $spec125)+
		searchavailspec($allspec, $spec114)+
		searchavailspec($allspec, $spec115)+
		searchavailspec($allspec, $spec118)+
		searchavailspec($allspec, $spec120)+
		searchavailspec($allspec, $spec121)+
		searchavailspec($allspec, $spec124)+
		searchavailspec($allspec, $spec264)+
		searchavailspec($allspec, $spec265)+
		searchavailspec($allspec, $spec266))<1)
		
				{
				echo '<div class="red">Нет ни одного начальника (заместителя) ПТО<br></div>';
				}
				else {echo '<div class="green">Начальник (заместитель) ПТО есть<br></div>';}		
		
		if	
		((searchavailspec($allspec, $spec700141)+
		searchavailspec($allspec, $spec141))<1)
		
				{
				echo '<div class="red">Нет ни одного инженера по сметной работе<br></div>';
				}
		else {echo '<div class="green">Инженер по сметной работе есть<br></div>';}		
		break;		
		
		case $type5707:
		case $type5956:
		if((searchavailspec($allspec, $spec71043)+
		searchavailspec($allspec, $spec71044)+
		searchavailspec($allspec, $spec71045)+
		searchavailspec($allspec, $spec71039)+
		searchavailspec($allspec, $spec71046)+
		searchavailspec($allspec, $spec71048)+
		searchavailspec($allspec, $spec71047)+
		searchavailspec($allspec, $spec71059)+
		searchavailspec($allspec, $spec71063)+
		searchavailspec($allspec, $spec71074)+
		searchavailspec($allspec, $spec700128)+
		searchavailspec($allspec, $spec700047)+
		searchavailspec($allspec, $spec710128)+
		searchavailspec($allspec, $spec700048)+
		searchavailspec($allspec, $spec700045)+
		searchavailspec($allspec, $spec700046)+
		searchavailspec($allspec, $spec700073)+
		searchavailspec($allspec, $spec700059)+
		searchavailspec($allspec, $spec700039)+
		searchavailspec($allspec, $spec700126)+
		searchavailspec($allspec, $spec700043)+
		searchavailspec($allspec, $spec700096)+
		searchavailspec($allspec, $spec700074)+
		searchavailspec($allspec, $spec700063)+
		searchavailspec($allspec, $spec700044)+
		searchavailspec($allspec, $spec150)+
		searchavailspec($allspec, $spec17700043)+
		searchavailspec($allspec, $spec17700044)+
		searchavailspec($allspec, $spec45)+
		searchavailspec($allspec, $spec39)+
		searchavailspec($allspec, $spec17700046)+
		searchavailspec($allspec, $spec17700048)+
		searchavailspec($allspec, $spec17700047)+
		searchavailspec($allspec, $spec17700059)+
		searchavailspec($allspec, $spec63)+
		searchavailspec($allspec, $spec73)+
		searchavailspec($allspec, $spec96)+
		searchavailspec($allspec, $spec17700074)+
		searchavailspec($allspec, $spec126)+
		searchavailspec($allspec, $spec128)+
		searchavailspec($allspec, $spec278)+
		searchavailspec($allspec, $spec43)+
		searchavailspec($allspec, $spec44)+
		searchavailspec($allspec, $spec46)+
		searchavailspec($allspec, $spec48)+
		searchavailspec($allspec, $spec47)+
		searchavailspec($allspec, $spec59)+
		searchavailspec($allspec, $spec74)+
		searchavailspec($allspec, $spec260)+
		searchavailspec($allspec, $spec261)+
		searchavailspec($allspec, $spec262)+
		searchavailspec($allspec, $spec263))<1)
		{
				echo '<div class="red">Нет ни одного главного инженера<br></div>';
				}
				else {echo '<div class="green">Главный инженер есть<br></div>';}	

		if	
		((searchavailspec($allspec, $spec710114)+
		searchavailspec($allspec, $spec710115)+
		searchavailspec($allspec, $spec710116)+
		searchavailspec($allspec, $spec710117)+
		searchavailspec($allspec, $spec710118)+
		searchavailspec($allspec, $spec710119)+
		searchavailspec($allspec, $spec710120)+
		searchavailspec($allspec, $spec710121)+
		searchavailspec($allspec, $spec710122)+
		searchavailspec($allspec, $spec710123)+
		searchavailspec($allspec, $spec710124)+
		searchavailspec($allspec, $spec710125)+
		searchavailspec($allspec, $spec700120)+
		searchavailspec($allspec, $spec700115)+
		searchavailspec($allspec, $spec700122)+
		searchavailspec($allspec, $spec700124)+
		searchavailspec($allspec, $spec700125)+
		searchavailspec($allspec, $spec700114)+
		searchavailspec($allspec, $spec700117)+
		searchavailspec($allspec, $spec700121)+
		searchavailspec($allspec, $spec700123)+
		searchavailspec($allspec, $spec700118)+
		searchavailspec($allspec, $spec700116)+
		searchavailspec($allspec, $spec700119)+
		searchavailspec($allspec, $spec700147)+
		searchavailspec($allspec, $spec247)+
		searchavailspec($allspec, $spec147)+
		searchavailspec($allspec, $spec17700114)+
		searchavailspec($allspec, $spec17700115)+
		searchavailspec($allspec, $spec116)+
		searchavailspec($allspec, $spec117)+
		searchavailspec($allspec, $spec17700118)+
		searchavailspec($allspec, $spec119)+
		searchavailspec($allspec, $spec17700120)+
		searchavailspec($allspec, $spec17700121)+
		searchavailspec($allspec, $spec122)+
		searchavailspec($allspec, $spec123)+
		searchavailspec($allspec, $spec17700124)+
		searchavailspec($allspec, $spec125)+
		searchavailspec($allspec, $spec114)+
		searchavailspec($allspec, $spec115)+
		searchavailspec($allspec, $spec118)+
		searchavailspec($allspec, $spec120)+
		searchavailspec($allspec, $spec121)+
		searchavailspec($allspec, $spec124)+
		searchavailspec($allspec, $spec264)+
		searchavailspec($allspec, $spec265)+
		searchavailspec($allspec, $spec266))<1)
		
				{
				echo '<div class="red">Нет ни одного начальника (заместителя) ПТО<br></div>';
				}
				else {echo '<div class="green">Начальник (заместитель) ПТО есть<br></div>';}		
		
		if	
		((searchavailspec($allspec, $spec700141)+
		searchavailspec($allspec, $spec141))<1)
		
				{
				echo '<div class="red">Нет ни одного инженера по сметной работе<br></div>';
				}
		else {echo '<div class="green">Инженер по сметной работе есть<br></div>';}		
		break;
		
		case $type5708:
		case $type5957:
		break;
			
		
		case $type5709:
		case $type5958:
				if((searchavailspec($allspec, $spec140)+searchavailspec($allspec, $spec142)+
				searchavailspec($allspec, $spec700140)+searchavailspec($allspec, $spec700142))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного или ведущего геодезиста</div>';
				}
		break;		
				
		case $type5710:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5711:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec15)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec16)+searchavailspec($allspec, $spec76)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec78)+
				searchavailspec($allspec, $spec79)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec81)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700216)+searchavailspec($allspec, $spec17700243)+
				searchavailspec($allspec, $spec17700245)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec245)+searchavailspec($allspec, $spec205)+
				searchavailspec($allspec, $spec231)+searchavailspec($allspec, $spec233)+
				searchavailspec($allspec, $spec234)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec215)+
				searchavailspec($allspec, $spec216)+searchavailspec($allspec, $spec243))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5712:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+					
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5713:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;

		case $type5714:
		case $type5959:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+				
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5715:
		case $type5960:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5716:
			if((searchavailspec($allspec, $spec270)+
				searchavailspec($allspec, $spec274))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5717:
				if((searchavailspec($allspec, $spec0)+
					searchavailspec($allspec, $spec9)+
					searchavailspec($allspec, $spec11)+
					searchavailspec($allspec, $spec12)+
					searchavailspec($allspec, $spec15)+
					searchavailspec($allspec, $spec18)+
					searchavailspec($allspec, $spec19)+
					searchavailspec($allspec, $spec16)+
					searchavailspec($allspec, $spec41)+
					searchavailspec($allspec, $spec76)+
					searchavailspec($allspec, $spec77)+
					searchavailspec($allspec, $spec78)+
					searchavailspec($allspec, $spec79)+
					searchavailspec($allspec, $spec80)+
					searchavailspec($allspec, $spec81)+
					searchavailspec($allspec, $spec82)+
					searchavailspec($allspec, $spec83)+
					searchavailspec($allspec, $spec194)+
					searchavailspec($allspec, $spec195)+
					searchavailspec($allspec, $spec196)+
					searchavailspec($allspec, $spec198)+
					searchavailspec($allspec, $spec199)+
					searchavailspec($allspec, $spec203)+
					searchavailspec($allspec, $spec205)+
					searchavailspec($allspec, $spec206)+
					searchavailspec($allspec, $spec208)+
					searchavailspec($allspec, $spec215)+
					searchavailspec($allspec, $spec216)+
					searchavailspec($allspec, $spec222)+
					searchavailspec($allspec, $spec223)+
					searchavailspec($allspec, $spec224)+
					searchavailspec($allspec, $spec226)+
					searchavailspec($allspec, $spec227)+
					searchavailspec($allspec, $spec231)+
					searchavailspec($allspec, $spec233)+
					searchavailspec($allspec, $spec234)+
					searchavailspec($allspec, $spec236)+
					searchavailspec($allspec, $spec243)+
					searchavailspec($allspec, $spec245)+
					searchavailspec($allspec, $spec17700195)+
					searchavailspec($allspec, $spec17700199)+
					searchavailspec($allspec, $spec17700203)+
					searchavailspec($allspec, $spec17700205)+
					searchavailspec($allspec, $spec17700209)+
					searchavailspec($allspec, $spec17700215)+
					searchavailspec($allspec, $spec17700216)+
					searchavailspec($allspec, $spec17700223)+
					searchavailspec($allspec, $spec17700231)+
					searchavailspec($allspec, $spec17700233)+
					searchavailspec($allspec, $spec17700234)+
					searchavailspec($allspec, $spec17700237)+
					searchavailspec($allspec, $spec17700243)+
					searchavailspec($allspec, $spec17700245))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type5718:
		case $type5961:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5719:
		case $type5962:
				if((searchavailspec($allspec, $spec9)+
					searchavailspec($allspec, $spec18)+
					searchavailspec($allspec, $spec19)+
					searchavailspec($allspec, $spec41)+
					searchavailspec($allspec, $spec82)+
					searchavailspec($allspec, $spec83)+
					searchavailspec($allspec, $spec194)+
					searchavailspec($allspec, $spec195)+
					searchavailspec($allspec, $spec196)+
					searchavailspec($allspec, $spec198)+
					searchavailspec($allspec, $spec199)+
					searchavailspec($allspec, $spec209)+
					searchavailspec($allspec, $spec222)+
					searchavailspec($allspec, $spec223)+
					searchavailspec($allspec, $spec224)+
					searchavailspec($allspec, $spec226)+
					searchavailspec($allspec, $spec227)+
					searchavailspec($allspec, $spec237)+
					searchavailspec($allspec, $spec17700195)+
					searchavailspec($allspec, $spec17700199)+
					searchavailspec($allspec, $spec17700209)+
					searchavailspec($allspec, $spec17700223)+
					searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;	
		
		case $type5720:
		case $type5963:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec267)+searchavailspec($allspec, $spec271))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5721:
		case $type5964:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5722:
		case $type5965:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5723:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;			
		
		case $type5724:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
				
		case $type5725:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec76)+searchavailspec($allspec, $spec77)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec17700195)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700197)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec17700203)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec197)+searchavailspec($allspec, $spec225)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec205)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec233)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
				
		case $type5726:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5727:
		case $type5966:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;			
		
		case $type5728:
		case $type5967:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec110)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700211)+searchavailspec($allspec, $spec17700239)+
				searchavailspec($allspec, $spec211)+searchavailspec($allspec, $spec239)+				
				searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;			
				
		case $type5729:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type5730:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;			
		
		case $type5731:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5732:
		case $type5968:
				if((searchavailspec($allspec, $spec11)+
					searchavailspec($allspec, $spec76)+
					searchavailspec($allspec, $spec203)+
					searchavailspec($allspec, $spec205)+
					searchavailspec($allspec, $spec212)+
					searchavailspec($allspec, $spec231)+
					searchavailspec($allspec, $spec233)+
					searchavailspec($allspec, $spec235)+
					searchavailspec($allspec, $spec17700203)+
					searchavailspec($allspec, $spec17700205)+
					searchavailspec($allspec, $spec17700231)+
					searchavailspec($allspec, $spec17700233))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}	
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;

		case $type5733:
		case $type5969:
				if((searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec17700204)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700232)+
				searchavailspec($allspec, $spec204)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec232))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))<1)	
			{
				echo '<div class="red">Нет прораба(мастера) по установке приборов учета тепло- и водопотребления</div>';
				}	
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;
		
		case $type5734:
		case $type5970:
				if((searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec234))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}	
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;			

		case $type5735:
		case $type5971:
				if((searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec207)+searchavailspec($allspec, $spec234))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))<1)	
			{
				echo '<div class="red">Нет прораба(мастера) по установке приборов учета тепло- и водопотребления</div>';
				}	
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;		
		
		case $type5736:
		case $type5972:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec17700216)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700245)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec245)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec216))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
				
		case $type5737:
		case $type5973:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec81)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700246)+
				searchavailspec($allspec, $spec17700217)+searchavailspec($allspec, $spec17700215)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec217)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec246))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5738:
		case $type5974:
				if((searchavailspec($allspec, $spec13)+searchavailspec($allspec, $spec193)+
				searchavailspec($allspec, $spec221))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
				
		case $type5739:
				if((searchavailspec($allspec, $spec0)+searchavailspec($allspec, $spec16)+
				searchavailspec($allspec, $spec218)+searchavailspec($allspec, $spec244))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;	
				
		case $type5740:
		case $type5975:
				if((searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec206)+searchavailspec($allspec, $spec207)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec234))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5741:
		case $type5976:
				if((searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226)+searchavailspec($allspec, $spec226))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5742:
		case $type5977:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5743:
		case $type5978:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
				
		case $type5744:
				if((searchavailspec($allspec, $spec710112)+searchavailspec($allspec, $spec112)+
				searchavailspec($allspec, $spec20112)+searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec220))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5745:
		case $type5979:
				if((searchavailspec($allspec, $spec82)+searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec224))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
						
		case $type5746:
		case $type5980:
				if((searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700237)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5747:	
		case $type5981:
				if((searchavailspec($allspec, $spec269)+searchavailspec($allspec, $spec273))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type5748:	
		case $type5982:
				if((searchavailspec($allspec, $spec17)+searchavailspec($allspec, $spec214)
					+searchavailspec($allspec, $spec242))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5749:
						if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)
					+searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
				
		case $type5750:
		case $type5983:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5751:
		case $type5984:
				if((searchavailspec($allspec, $spec268)+searchavailspec($allspec, $spec272))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;	
		
		case $type5752:
		case $type5985:
		break;
	
		case $type5901:
		case $type5986:
				if((searchavailspec($allspec, $spec700093)+searchavailspec($allspec, $spec700135)+
				searchavailspec($allspec, $spec800135)+searchavailspec($allspec, $spec93)+searchavailspec($allspec, $spec17700135))>=4){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
				else {
				echo '<div class="red">Не достаточно аттестованных специалистов</div>';
				}
		break;		
		
		case $type5903:
		case $type5987:
				if(searchavailspec($allspec, $spec250)>=4){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
				else {
				echo '<div class="red">Не достаточно специалистов, осуществляющих обследование автомобильных дорог и мостовых сооружений</div>';
				}
		break;
		
        case $type5902:
				if((searchavailspec($allspec, $spec253)+searchavailspec($allspec, $spec254)+
				searchavailspec($allspec, $spec255)+searchavailspec($allspec, $spec256)+
				searchavailspec($allspec, $spec257)+searchavailspec($allspec, $spec258)+searchavailspec($allspec, $spec259))>=4){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
				else {
				echo '<div class="red">Не достаточно аттестованных специалистов</div>';
				}
		break;		
		}	
		} 
}		
    break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////CASE 3//////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	  
    case 3:
	if($vidyrabot1 < $outdate){
	 for ($i = 0; $i <= count($types_of_jobs[$k]->field_field_vidyrab); $i++) 
		{ 
			$types_of_jobs2=$types_of_jobs[$k]->field_field_vidyrab[$i][raw];
			$types_of_jobs3=$types_of_jobs2[taxonomy_term]->name;
			$vidyrabot[$k][$i]=$types_of_jobs3; // переменная для вывода вне массива
			print_r ("</br>".$types_of_jobs3."</br>");
	
	

	switch ($types_of_jobs3) {
		
		
		
        case $type163:
		break;
		
		case $type164:
		if((searchavailspec($allspec, $spec700166)+searchavailspec($allspec, $spec166)+searchavailspec($allspec, $spec173))>=3){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-геодезические изыскания меньше 3</div>';
				}
		break;
		
		case $type165:
			if((searchavailspec($allspec, $spec700167)+searchavailspec($allspec, $spec167)+searchavailspec($allspec, $spec174))>=3){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-геологические изыскания меньше 3</div>';
				}
		break;
		
		case $type166:
			if((searchavailspec($allspec, $spec700168)+searchavailspec($allspec, $spec168))>=3){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-гидрометеорологические изыскания меньше 3</div>';
				}
		break;
		
		case $type167:
			if((searchavailspec($allspec, $spec700169)+searchavailspec($allspec, $spec169))>=3){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-экологические изыскания меньше 3</div>';
				}
		break;
		
		case $type168:
			if((searchavailspec($allspec, $spec700170)+searchavailspec($allspec, $spec170))>=3){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-геотехнические изыскания меньше 3</div>';
				}
		break;
		
		case $type169:
			if((searchavailspec($allspec, $spec700171)+searchavailspec($allspec, $spec171))>=3){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих 
				обследование состояния грунтов оснований зданий и сооружений меньше 3</div>';
				}
		break;
			
		case $type170:
			if((searchavailspec($allspec, $spec700064)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3))>=1 or 
			(searchavailspec($allspec, $spec4)+searchavailspec($allspec, $spec700129)+searchavailspec($allspec, $spec700004)+searchavailspec($allspec, $spec148)+searchavailspec($allspec, $spec17700129)+searchavailspec($allspec, $spec129)+searchavailspec($allspec, $spec275))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного специалиста ГАП или ГИП</div>';
				}
		break;
		
		case $type171:
			if	((
					searchavailspec($allspec, $spec3)+
					searchavailspec($allspec, $spec64)+
					searchavailspec($allspec, $spec700064))<2
					and (
					searchavailspec($allspec, $spec4)+
					searchavailspec($allspec, $spec129)+
					searchavailspec($allspec, $spec148)+
					searchavailspec($allspec, $spec275)+
					searchavailspec($allspec, $spec700004)+
					searchavailspec($allspec, $spec700129)+
					searchavailspec($allspec, $spec17700129))<2)
             {
				echo '<div class="red">Количество специалистов ГАП или ГИП меньше 2</div>';
				}
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;
					
		case $type196:
		break;
		
		case $type197:
			if((searchavailspec($allspec, $spec700163)+searchavailspec($allspec, $spec163))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (генеральный план)</div>';
				}
		break;
		
		case $type198:
			if((searchavailspec($allspec, $spec252)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3)+searchavailspec($allspec, $spec700064))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (архитектурные решения) либо ГАПа</div>';
				}
		break;
		
		case $type199:
			if(searchavailspec($allspec, $spec139)+
			   searchavailspec($allspec, $spec700139)>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (сметная документация)</div>';
				}
		break;
			
		case $type200:			
		if((searchavailspec($allspec, $spec66)+searchavailspec($allspec, $spec17700066)+searchavailspec($allspec, $spec700066))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (конструктивные решения)</div>';
				}			
		break;
		
		case $type543:
		break;
		
		case $type5435:
			if((searchavailspec($allspec, $spec17700071)+searchavailspec($allspec, $spec700071)+searchavailspec($allspec, $spec71))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (холодоснабжение))</div>';
				}
		break;
						
		case $type5436:
		case $type5438:
		case $type5797:
			if((searchavailspec($allspec, $spec17700067)+searchavailspec($allspec, $spec700067)+searchavailspec($allspec, $spec67))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</div>';
				}
		break;
			
		case $type5441:
		case $type5442:
		case $type5443:
		case $type5798:
			if((searchavailspec($allspec, $spec72)+
				searchavailspec($allspec, $spec700072)+
				searchavailspec($allspec, $spec17700072))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</div>';
				}
		break;
		
		case $type5444:
		case $type5453:
		case $type5454:
		case $type5799:
			if((searchavailspec($allspec, $spec98)+
				searchavailspec($allspec, $spec700098)+
				searchavailspec($allspec, $spec17700098))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</div>';
				}
		break;
			
		case $type5439:
		case $type5440:
		case $type5795:
			if((searchavailspec($allspec, $spec68)+
				searchavailspec($allspec, $spec700068)+
				searchavailspec($allspec, $spec17700068))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (отопление, вентиляция и кондиционирование воздуха))</div>';
				}
		break;	
		
		case $type5437:
			if((searchavailspec($allspec, $spec17700069)+searchavailspec($allspec, $spec700069)+searchavailspec($allspec, $spec69))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</div>';
				}
		break;

		case $type5445: /*4.6. наружные сети и системы:*/
		break;
		
		case $type5446:
		case $type5802:
			if((searchavailspec($allspec, $spec17700070)+searchavailspec($allspec, $spec700070)+searchavailspec($allspec, $spec70))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (тепловые сети))</div>';
				}
		break;
			
		case $type5447:
		case $type5449:
		case $type5803:
			if((searchavailspec($allspec, $spec67)+
				searchavailspec($allspec, $spec700067)+
				searchavailspec($allspec, $spec17700067))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</div>';
				}
		break;	
		
		case $type5450:
		case $type5804:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</div>';
				}
		break;
		
		case $type5451:
		case $type5455:
		case $type5456:
		case $type5805:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</div>';
				}
		break;
		
		case $type5448:
			if((searchavailspec($allspec, $spec17700069)+searchavailspec($allspec, $spec700069)+searchavailspec($allspec, $spec69))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</div>';
				}
		break;

		case $type202: 		
		case $type5457: /*4.8.:*/
		break;
		
		case $type5459:
				if(searchavailspec($allspec, $spec249)>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерно-технические мероприятия гражданской обороны. Мероприятия по предупреждению чрезвычайных ситуаций)</div>';
				}
		break;
		case $type5460:
				if(searchavailspec($allspec, $spec249)>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерно-технические мероприятия гражданской обороны. Мероприятия по предупреждению чрезвычайных ситуаций)</div>';
				}
		break;
		case $type5461:
				if(searchavailspec($allspec, $spec249)>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерно-технические мероприятия гражданской обороны. Мероприятия по предупреждению чрезвычайных ситуаций)</div>';
				}
		break;
		
		case $type5462:
			if((searchavailspec($allspec, $spec700164)+searchavailspec($allspec, $spec164))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (организация строительства)</div>';
				}
		break;
		
		case $type5458:
			if(searchavailspec($allspec, $spec248)>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (охрана окружающей среды)</div>';
				}
		break;		
		
		case $type205:/*5. Выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов первого-четвертого классов сложности*/
		case $type206:
		break;
		
		case $type207:
			$count=0;
			$count=countoverzero(searchavailspec($allspec, $spec24),$count);
			$count=countoverzero(searchavailspec($allspec, $spec26),$count);
			$count=countoverzero(searchavailspec($allspec, $spec30),$count);
			$count=countoverzero(searchavailspec($allspec, $spec33),$count);
			$count=countoverzero(searchavailspec($allspec, $spec34),$count);
			$count=countoverzero(searchavailspec($allspec, $spec57),$count);
			$count=countoverzero(searchavailspec($allspec, $spec61),$count);
			$count=countoverzero(searchavailspec($allspec, $spec84),$count);
			$count=countoverzero(searchavailspec($allspec, $spec85),$count);
			$count=countoverzero(searchavailspec($allspec, $spec95),$count);
			$count=countoverzero(searchavailspec($allspec, $spec97),$count);
			$count=countoverzero(searchavailspec($allspec, $spec113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec144),$count);
			$count=countoverzero(searchavailspec($allspec, $spec145),$count);
			$count=countoverzero(searchavailspec($allspec, $spec146),$count);
			$count=countoverzero(searchavailspec($allspec, $spec276),$count);
			$count=countoverzero(searchavailspec($allspec, $spec277),$count);
			$count=countoverzero(searchavailspec($allspec, $spec20113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700024),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700026),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700030),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700033),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700034),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700057),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700061),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700084),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700085),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700095),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700097),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec710113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700024),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700026),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700030),$count);			
			$count=countoverzero(searchavailspec($allspec, $spec17700033),$count);							
			$count=countoverzero(searchavailspec($allspec, $spec17700084),$count);	
			$count=countoverzero(searchavailspec($allspec, $spec17700085),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700061),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700097),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700024),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700026),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700030),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700033),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700034),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700057),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700061),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700084),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700085),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700095),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700097),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700276),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700277),$count);
			
		if((searchavailspec($allspec, $spec40)+searchavailspec($allspec, $spec700187)+searchavailspec($allspec, $spec188)+searchavailspec($allspec, $spec189)+
		searchavailspec($allspec, $spec18700187)+
		searchavailspec($allspec, $spec187))<1)
		{
				echo '<div class="red">Нет ни одного руководителя проекта</div>';
				}						
			else {
			echo '<div class="green">Руководитель проекта есть</div>';		
				}
		if	($count<4)
				{
				echo '<div class="red">Количество специалистов по техническому надзору меньше 4</div>';
				}		
			else {
				echo '<div class="green">Количество специалистов по техническому надзору 4 или больше</div>';
				}	
		break;
		
		case $type208:
		if((searchavailspec($allspec, $spec700024)+
		searchavailspec($allspec, $spec144)+
		searchavailspec($allspec, $spec145)+
		searchavailspec($allspec, $spec146)+
		searchavailspec($allspec, $spec24)+
		searchavailspec($allspec, $spec18700024)+
		searchavailspec($allspec, $spec17700024))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (общестроительные работы)</div>';
				}
		break;
		
		case $type209:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec18700026)+
		searchavailspec($allspec, $spec17700026))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</div>';
				}
		break;
		
		case $type210:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec18700026)+
		searchavailspec($allspec, $spec17700026))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</div>';
				}
		break;
		
		case $type211:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec18700026)+
		searchavailspec($allspec, $spec17700026)+
		searchavailspec($allspec, $spec95)+
		searchavailspec($allspec, $spec18700095)+
		searchavailspec($allspec, $spec700095))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</div>';
				}
		break;
		
		case $type212:
		if((searchavailspec($allspec, $spec700057)+
		searchavailspec($allspec, $spec18700057)+
		searchavailspec($allspec, $spec57))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области газоснабжения)</div>';
				}
		break;

		case $type213:
		if((searchavailspec($allspec, $spec700030)+
		searchavailspec($allspec, $spec30)+
		searchavailspec($allspec, $spec18700030)+
		searchavailspec($allspec, $spec17700030))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области электроснабжения и автоматизации)</div>';
				}
		break;

		case $type214:
		if((searchavailspec($allspec, $spec700097)+
		searchavailspec($allspec, $spec97)+
		searchavailspec($allspec, $spec18700097)+
		searchavailspec($allspec, $spec17700097))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области связи, сигнализации)</div>';
				}
		break;

		case $type215:
		if((searchavailspec($allspec, $spec700033)+
		searchavailspec($allspec, $spec33)+
		searchavailspec($allspec, $spec18700033)+
		searchavailspec($allspec, $spec17700033))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (строительство автомобильных дорог и аэродромов, строительство мостов, транспортных эстакад и путепроводов)</div>';
				}
		break;

		case $type216:
		if((searchavailspec($allspec, $spec700084)+
		searchavailspec($allspec, $spec84)+
		searchavailspec($allspec, $spec18700084)+
		searchavailspec($allspec, $spec17700084))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (строительство железных дорог)</div>';
				}
		break;

		case $type217:
		if((searchavailspec($allspec, $spec700085)+
		searchavailspec($allspec, $spec85)+
		searchavailspec($allspec, $spec18700085)+
		searchavailspec($allspec, $spec17700085))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (строительство сооружений транспортных тоннелей, метрополитенов)</div>';
				}
		break;

		case $type218:
		if((searchavailspec($allspec, $spec700034)+
		searchavailspec($allspec, $spec18700034)+
		searchavailspec($allspec, $spec34))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (гидротехническое и мелиоративное строительство)</div>';
				}
		break;

		case $type219:
		if((searchavailspec($allspec, $spec710113)+
		searchavailspec($allspec, $spec20113)+
		searchavailspec($allspec, $spec700113)+
		searchavailspec($allspec, $spec18700113)+
		searchavailspec($allspec, $spec113))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (благоустройство территорий)</div>';
				}
		break;

		case $type220:
		if((searchavailspec($allspec, $spec700064)+searchavailspec($allspec, $spec3)+searchavailspec($allspec, $spec64))>=2 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов ГАП меньше 2</div>';
				}
		break;
				
		case $type221:
		case $type222:
		case $type223:
		case $type224:
		case $type225:
		case $type226:
		break;
			
		case $type227:
		if((searchavailspec($allspec, $spec71043)+
		searchavailspec($allspec, $spec71044)+
		searchavailspec($allspec, $spec71045)+
		searchavailspec($allspec, $spec71039)+
		searchavailspec($allspec, $spec71046)+
		searchavailspec($allspec, $spec71048)+
		searchavailspec($allspec, $spec71047)+
		searchavailspec($allspec, $spec71059)+
		searchavailspec($allspec, $spec71063)+
		searchavailspec($allspec, $spec71074)+
		searchavailspec($allspec, $spec700128)+
		searchavailspec($allspec, $spec700047)+
		searchavailspec($allspec, $spec710128)+
		searchavailspec($allspec, $spec700048)+
		searchavailspec($allspec, $spec700045)+
		searchavailspec($allspec, $spec700046)+
		searchavailspec($allspec, $spec700073)+
		searchavailspec($allspec, $spec700059)+
		searchavailspec($allspec, $spec700039)+
		searchavailspec($allspec, $spec700126)+
		searchavailspec($allspec, $spec700043)+
		searchavailspec($allspec, $spec700096)+
		searchavailspec($allspec, $spec700074)+
		searchavailspec($allspec, $spec700063)+
		searchavailspec($allspec, $spec700044)+
		searchavailspec($allspec, $spec150)+
		searchavailspec($allspec, $spec17700043)+
		searchavailspec($allspec, $spec17700044)+
		searchavailspec($allspec, $spec45)+
		searchavailspec($allspec, $spec39)+
		searchavailspec($allspec, $spec17700046)+
		searchavailspec($allspec, $spec17700048)+
		searchavailspec($allspec, $spec17700047)+
		searchavailspec($allspec, $spec17700059)+
		searchavailspec($allspec, $spec63)+
		searchavailspec($allspec, $spec73)+
		searchavailspec($allspec, $spec96)+
		searchavailspec($allspec, $spec17700074)+
		searchavailspec($allspec, $spec126)+
		searchavailspec($allspec, $spec128)+
		searchavailspec($allspec, $spec278)+
		searchavailspec($allspec, $spec43)+
		searchavailspec($allspec, $spec44)+
		searchavailspec($allspec, $spec46)+
		searchavailspec($allspec, $spec48)+
		searchavailspec($allspec, $spec47)+
		searchavailspec($allspec, $spec59)+
		searchavailspec($allspec, $spec74)+
		searchavailspec($allspec, $spec260)+
		searchavailspec($allspec, $spec261)+
		searchavailspec($allspec, $spec262)+
		searchavailspec($allspec, $spec263))<1)
		{
				echo '<div class="red">Нет ни одного главного инженера</div>';
				}					
			
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';		
				}
		break;
		
		case $type5827:
		break;
		
		case $type5828:
		if((searchavailspec($allspec, $spec71043)+
		searchavailspec($allspec, $spec71044)+
		searchavailspec($allspec, $spec71045)+
		searchavailspec($allspec, $spec71039)+
		searchavailspec($allspec, $spec71046)+
		searchavailspec($allspec, $spec71048)+
		searchavailspec($allspec, $spec71047)+
		searchavailspec($allspec, $spec71059)+
		searchavailspec($allspec, $spec71063)+
		searchavailspec($allspec, $spec71074)+
		searchavailspec($allspec, $spec700128)+
		searchavailspec($allspec, $spec700047)+
		searchavailspec($allspec, $spec710128)+
		searchavailspec($allspec, $spec700048)+
		searchavailspec($allspec, $spec700045)+
		searchavailspec($allspec, $spec700046)+
		searchavailspec($allspec, $spec700073)+
		searchavailspec($allspec, $spec700059)+
		searchavailspec($allspec, $spec700039)+
		searchavailspec($allspec, $spec700126)+
		searchavailspec($allspec, $spec700043)+
		searchavailspec($allspec, $spec700096)+
		searchavailspec($allspec, $spec700074)+
		searchavailspec($allspec, $spec700063)+
		searchavailspec($allspec, $spec700044)+
		searchavailspec($allspec, $spec150)+
		searchavailspec($allspec, $spec17700043)+
		searchavailspec($allspec, $spec17700044)+
		searchavailspec($allspec, $spec45)+
		searchavailspec($allspec, $spec39)+
		searchavailspec($allspec, $spec17700046)+
		searchavailspec($allspec, $spec17700048)+
		searchavailspec($allspec, $spec17700047)+
		searchavailspec($allspec, $spec17700059)+
		searchavailspec($allspec, $spec63)+
		searchavailspec($allspec, $spec73)+
		searchavailspec($allspec, $spec96)+
		searchavailspec($allspec, $spec17700074)+
		searchavailspec($allspec, $spec126)+
		searchavailspec($allspec, $spec128)+
		searchavailspec($allspec, $spec278)+
		searchavailspec($allspec, $spec43)+
		searchavailspec($allspec, $spec44)+
		searchavailspec($allspec, $spec46)+
		searchavailspec($allspec, $spec48)+
		searchavailspec($allspec, $spec47)+
		searchavailspec($allspec, $spec59)+
		searchavailspec($allspec, $spec74)+
		searchavailspec($allspec, $spec260)+
		searchavailspec($allspec, $spec261)+
		searchavailspec($allspec, $spec262)+
		searchavailspec($allspec, $spec263))<1)
		{
				echo '<div class="red">Нет ни одного главного инженера</div>';
				}					
			
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';		
				}
		break;		
		
		case $type5829:
		if((searchavailspec($allspec, $spec71043)+
		searchavailspec($allspec, $spec71044)+
		searchavailspec($allspec, $spec71045)+
		searchavailspec($allspec, $spec71039)+
		searchavailspec($allspec, $spec71046)+
		searchavailspec($allspec, $spec71048)+
		searchavailspec($allspec, $spec71047)+
		searchavailspec($allspec, $spec71059)+
		searchavailspec($allspec, $spec71063)+
		searchavailspec($allspec, $spec71074)+
		searchavailspec($allspec, $spec700128)+
		searchavailspec($allspec, $spec700047)+
		searchavailspec($allspec, $spec710128)+
		searchavailspec($allspec, $spec700048)+
		searchavailspec($allspec, $spec700045)+
		searchavailspec($allspec, $spec700046)+
		searchavailspec($allspec, $spec700073)+
		searchavailspec($allspec, $spec700059)+
		searchavailspec($allspec, $spec700039)+
		searchavailspec($allspec, $spec700126)+
		searchavailspec($allspec, $spec700043)+
		searchavailspec($allspec, $spec700096)+
		searchavailspec($allspec, $spec700074)+
		searchavailspec($allspec, $spec700063)+
		searchavailspec($allspec, $spec700044)+
		searchavailspec($allspec, $spec150)+
		searchavailspec($allspec, $spec17700043)+
		searchavailspec($allspec, $spec17700044)+
		searchavailspec($allspec, $spec45)+
		searchavailspec($allspec, $spec39)+
		searchavailspec($allspec, $spec17700046)+
		searchavailspec($allspec, $spec17700048)+
		searchavailspec($allspec, $spec17700047)+
		searchavailspec($allspec, $spec17700059)+
		searchavailspec($allspec, $spec63)+
		searchavailspec($allspec, $spec73)+
		searchavailspec($allspec, $spec96)+
		searchavailspec($allspec, $spec17700074)+
		searchavailspec($allspec, $spec126)+
		searchavailspec($allspec, $spec128)+
		searchavailspec($allspec, $spec278)+
		searchavailspec($allspec, $spec43)+
		searchavailspec($allspec, $spec44)+
		searchavailspec($allspec, $spec46)+
		searchavailspec($allspec, $spec48)+
		searchavailspec($allspec, $spec47)+
		searchavailspec($allspec, $spec59)+
		searchavailspec($allspec, $spec74)+
		searchavailspec($allspec, $spec260)+
		searchavailspec($allspec, $spec261)+
		searchavailspec($allspec, $spec262)+
		searchavailspec($allspec, $spec263))<1)
		{
				echo '<div class="red">Нет ни одного главного инженера</div>';
				}					
			
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';		
				}
		break;
		
		case $type228:
		break;
		
		case $type229:
		case $type5864:
				if((searchavailspec($allspec, $spec140)+searchavailspec($allspec, $spec142)+
				searchavailspec($allspec, $spec700140)+searchavailspec($allspec, $spec700142))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного или ведущего геодезиста</div>';
				}
		break;
		
		case $type230:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type231:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec15)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec16)+searchavailspec($allspec, $spec76)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec78)+
				searchavailspec($allspec, $spec79)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec81)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700216)+searchavailspec($allspec, $spec17700243)+
				searchavailspec($allspec, $spec17700245)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec245)+searchavailspec($allspec, $spec205)+
				searchavailspec($allspec, $spec231)+searchavailspec($allspec, $spec233)+
				searchavailspec($allspec, $spec234)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec215)+
				searchavailspec($allspec, $spec216)+searchavailspec($allspec, $spec243))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type232:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+					
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type233:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type234:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+				
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
				
		case $type235:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type236:
			if((searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+				
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700203)+				
				searchavailspec($allspec, $spec17700223)+								
				searchavailspec($allspec, $spec17700231))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type237:
				if((searchavailspec($allspec, $spec0)+
					searchavailspec($allspec, $spec9)+
					searchavailspec($allspec, $spec11)+
					searchavailspec($allspec, $spec12)+
					searchavailspec($allspec, $spec15)+
					searchavailspec($allspec, $spec18)+
					searchavailspec($allspec, $spec19)+
					searchavailspec($allspec, $spec16)+
					searchavailspec($allspec, $spec41)+
					searchavailspec($allspec, $spec76)+
					searchavailspec($allspec, $spec77)+
					searchavailspec($allspec, $spec78)+
					searchavailspec($allspec, $spec79)+
					searchavailspec($allspec, $spec80)+
					searchavailspec($allspec, $spec81)+
					searchavailspec($allspec, $spec82)+
					searchavailspec($allspec, $spec83)+
					searchavailspec($allspec, $spec194)+
					searchavailspec($allspec, $spec195)+
					searchavailspec($allspec, $spec196)+
					searchavailspec($allspec, $spec198)+
					searchavailspec($allspec, $spec199)+
					searchavailspec($allspec, $spec203)+
					searchavailspec($allspec, $spec205)+
					searchavailspec($allspec, $spec206)+
					searchavailspec($allspec, $spec208)+
					searchavailspec($allspec, $spec215)+
					searchavailspec($allspec, $spec216)+
					searchavailspec($allspec, $spec222)+
					searchavailspec($allspec, $spec223)+
					searchavailspec($allspec, $spec224)+
					searchavailspec($allspec, $spec226)+
					searchavailspec($allspec, $spec227)+
					searchavailspec($allspec, $spec231)+
					searchavailspec($allspec, $spec233)+
					searchavailspec($allspec, $spec234)+
					searchavailspec($allspec, $spec236)+
					searchavailspec($allspec, $spec243)+
					searchavailspec($allspec, $spec245)+
					searchavailspec($allspec, $spec17700195)+
					searchavailspec($allspec, $spec17700199)+
					searchavailspec($allspec, $spec17700203)+
					searchavailspec($allspec, $spec17700205)+
					searchavailspec($allspec, $spec17700209)+
					searchavailspec($allspec, $spec17700215)+
					searchavailspec($allspec, $spec17700216)+
					searchavailspec($allspec, $spec17700223)+
					searchavailspec($allspec, $spec17700231)+
					searchavailspec($allspec, $spec17700233)+
					searchavailspec($allspec, $spec17700234)+
					searchavailspec($allspec, $spec17700237)+
					searchavailspec($allspec, $spec17700243)+
					searchavailspec($allspec, $spec17700245))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type238:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;			
		
case $type239:
				if((searchavailspec($allspec, $spec9)+
					searchavailspec($allspec, $spec18)+
					searchavailspec($allspec, $spec19)+
					searchavailspec($allspec, $spec41)+
					searchavailspec($allspec, $spec82)+
					searchavailspec($allspec, $spec83)+
					searchavailspec($allspec, $spec194)+
					searchavailspec($allspec, $spec195)+
					searchavailspec($allspec, $spec196)+
					searchavailspec($allspec, $spec198)+
					searchavailspec($allspec, $spec199)+
					searchavailspec($allspec, $spec209)+
					searchavailspec($allspec, $spec222)+
					searchavailspec($allspec, $spec223)+
					searchavailspec($allspec, $spec224)+
					searchavailspec($allspec, $spec226)+
					searchavailspec($allspec, $spec227)+
					searchavailspec($allspec, $spec237)+
					searchavailspec($allspec, $spec17700195)+
					searchavailspec($allspec, $spec17700199)+
					searchavailspec($allspec, $spec17700209)+
					searchavailspec($allspec, $spec17700223)+
					searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type240:
		case $type5869:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec267)+searchavailspec($allspec, $spec271))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type241:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type242:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type243:
		case $type5872:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type244:
		case $type5873:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
			
		case $type245:
		case $type5874:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec76)+searchavailspec($allspec, $spec77)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec17700195)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700197)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec17700203)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec197)+searchavailspec($allspec, $spec225)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec205)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec233)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type246:
		case $type5875:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type247:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type248:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec110)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700211)+searchavailspec($allspec, $spec17700239)+
				searchavailspec($allspec, $spec211)+searchavailspec($allspec, $spec239)+				
				searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type249:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type250:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type251:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type252:
				if((searchavailspec($allspec, $spec11)+
					searchavailspec($allspec, $spec76)+
					searchavailspec($allspec, $spec203)+
					searchavailspec($allspec, $spec205)+
					searchavailspec($allspec, $spec212)+
					searchavailspec($allspec, $spec231)+
					searchavailspec($allspec, $spec233)+
					searchavailspec($allspec, $spec235)+
					searchavailspec($allspec, $spec17700203)+
					searchavailspec($allspec, $spec17700205)+
					searchavailspec($allspec, $spec17700231)+
					searchavailspec($allspec, $spec17700233))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}	
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;		

		case $type253:
				if((searchavailspec($allspec, $spec11)+
					searchavailspec($allspec, $spec77)+
					searchavailspec($allspec, $spec203)+
					searchavailspec($allspec, $spec204)+
					searchavailspec($allspec, $spec231)+
					searchavailspec($allspec, $spec232)+
					searchavailspec($allspec, $spec17700203)+
					searchavailspec($allspec, $spec17700204)+
					searchavailspec($allspec, $spec17700231)+
					searchavailspec($allspec, $spec17700232))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
			else if ((searchavailspec($allspec, $spec62)+
					  searchavailspec($allspec, $spec240)+
					  searchavailspec($allspec, $spec212))<1)	
			{
				echo '<div class="red">Нет прораба(мастера) по установке приборов учета тепло- и водопотребления</div>';
				}	
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;
		
		case $type254:
				if((searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec234))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}	
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;		
		
		case $type255:
				if((searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec207)+searchavailspec($allspec, $spec234))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))<1)	
			{
				echo '<div class="red">Нет прораба(мастера) по установке приборов учета тепло- и водопотребления</div>';
				}	
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;		
		
		case $type256:
		case $type5885:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec17700216)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700245)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec245)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec216))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;

		case $type257:
		case $type5886:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec81)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700246)+
				searchavailspec($allspec, $spec17700217)+searchavailspec($allspec, $spec17700215)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec217)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec246))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type258:
		break;		
		
		case $type259:
				if((searchavailspec($allspec, $spec13)+searchavailspec($allspec, $spec193)+searchavailspec($allspec, $spec221))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type260:
		case $type5888:
				if((searchavailspec($allspec, $spec0)+searchavailspec($allspec, $spec16)+
				searchavailspec($allspec, $spec218)+searchavailspec($allspec, $spec244))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type261:
				if((searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec206)+searchavailspec($allspec, $spec207)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec234))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type262:
				if((searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec222))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type263:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type264:
		case $type5892:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type265:
				if((searchavailspec($allspec, $spec710112)+searchavailspec($allspec, $spec112)+
				searchavailspec($allspec, $spec20112)+searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec220))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;			
		
		case $type266:
				if((searchavailspec($allspec, $spec82)+searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec224))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;			
		
		case $type267:
				if((searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700237)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type268:	
		case $type269:
		break;		

		case $type270:
						if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)
					+searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type271:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

				case $type5753:
		if((searchavailspec($allspec, $spec700093)+searchavailspec($allspec, $spec700135)+
				searchavailspec($allspec, $spec800135)+searchavailspec($allspec, $spec93)+
				searchavailspec($allspec, $spec17700135))>=3){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		}

	} 
	}
	else {
			 for ($i = 0; $i <= count($types_of_jobs[$k]->field_field_vidy_rabot_13_05_2017_); $i++) 
		{ 
			$types_of_jobs2=$types_of_jobs[$k]->field_field_vidy_rabot_13_05_2017_[$i][raw];
			$types_of_jobs3=$types_of_jobs2[taxonomy_term]->name;
			$vidyrabot[$k][$i]=$types_of_jobs3; // переменная для вывода вне массива
			print_r ("</br>".$types_of_jobs3."</br>");
	
	

	switch ($types_of_jobs3) {
		
		case $type5594:
		case $type5907:
		break;
		
		case $type5595:
		case $type5908:
		if((searchavailspec($allspec, $spec700166)+searchavailspec($allspec, $spec166)+searchavailspec($allspec, $spec173))>=3){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-геодезические изыскания меньше 3</div>';
				}
		break;
		
		case $type5616:
		case $type5909:
			if((searchavailspec($allspec, $spec700167)+searchavailspec($allspec, $spec167)+searchavailspec($allspec, $spec174))>=3){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-геологические изыскания меньше 3</div>';
				}
		break;
		
		case $type5625:
		case $type5910:
			if((searchavailspec($allspec, $spec700168)+searchavailspec($allspec, $spec168))>=3){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-гидрометеорологические изыскания меньше 3</div>';
				}
		break;	
		
		case $type5630:
			if((searchavailspec($allspec, $spec700169)+searchavailspec($allspec, $spec169))>=3){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-экологические изыскания меньше 3</div>';
				}
		break;
		
		case $type5647:
			if((searchavailspec($allspec, $spec700170)+searchavailspec($allspec, $spec170))>=3){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-геотехнические изыскания меньше 3</div>';
				}
		break;
		
	   case $type5648:
	   case $type5649:
	   case $type5650:
	   case $type5651:
	   case $type5652:
	   case $type5653:
	   break;
		
		case $type5654:
			if((searchavailspec($allspec, $spec171)+searchavailspec($allspec, $spec171))>=3){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих обследование состояния грунтов оснований зданий и сооружений меньше 3</div>';
				}
		break;
		
		case $type5655:
			if((searchavailspec($allspec, $spec700064)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3))>=1 or 
			(searchavailspec($allspec, $spec4)+searchavailspec($allspec, $spec700129)+searchavailspec($allspec, $spec700004)+searchavailspec($allspec, $spec148)+searchavailspec($allspec, $spec17700129)+searchavailspec($allspec, $spec129)+searchavailspec($allspec, $spec275))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного специалиста ГАП или ГИП</div>';
				}
		break;
		
		case $type5656:
		case $type5911:
			if	((
					searchavailspec($allspec, $spec3)+
					searchavailspec($allspec, $spec64)+
					searchavailspec($allspec, $spec700064))<2
					and (
					searchavailspec($allspec, $spec4)+
					searchavailspec($allspec, $spec129)+
					searchavailspec($allspec, $spec148)+
					searchavailspec($allspec, $spec275)+
					searchavailspec($allspec, $spec700004)+
					searchavailspec($allspec, $spec700129)+
					searchavailspec($allspec, $spec17700129))<2)
             {
				echo '<div class="red">Количество специалистов ГАП или ГИП меньше 2</div>';
				}
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;		
		
		case $type5657:
        case $type5912:
		break;
		
		case $type5658:
		case $type5913:
			if((searchavailspec($allspec, $spec700163)+searchavailspec($allspec, $spec163))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (генеральный план)</div>';
				}
		break;		
			
		case $type5659:
		case $type5914:
			if((searchavailspec($allspec, $spec252)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3)+searchavailspec($allspec, $spec700064))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (архитектурные решения) либо ГАПа</div>';
				}
		break;		
				
		case $type5660:
		case $type5915:
			if(searchavailspec($allspec, $spec139)+
			   searchavailspec($allspec, $spec700139)>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (сметная документация)</div>';
				}
		break;		
		
		case $type5661:
		case $type5916:
		if((searchavailspec($allspec, $spec66)+searchavailspec($allspec, $spec17700066)+searchavailspec($allspec, $spec700066))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (конструктивные решения)</div>';
				}			
		break;		
		
		case $type5662:
		case $type5917:
		break;
		
		case $type5664:
		case $type5919:
			if((searchavailspec($allspec, $spec17700071)+searchavailspec($allspec, $spec700071)+searchavailspec($allspec, $spec71))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (холодоснабжение))</div>';
				}
		break;		
				
		case $type5665:
		case $type5920:
			if((searchavailspec($allspec, $spec17700067)+searchavailspec($allspec, $spec700067)+searchavailspec($allspec, $spec67))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</div>';
				}
		break;		
		
		case $type5666:
		case $type5921:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</div>';
				}
		break;
				
		case $type5667:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</div>';
				}
		break;		
		
		case $type5663:
		case $type5918:
			if((searchavailspec($allspec, $spec17700068)+
				searchavailspec($allspec, $spec700068)+
				searchavailspec($allspec, $spec68))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (отопление, вентиляция и кондиционирование воздуха))</div>';
				}
		break;		
		
		case $type5668:
		case $type5922:
			if((searchavailspec($allspec, $spec17700099)+searchavailspec($allspec, $spec700099)+searchavailspec($allspec, $spec99))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</div>';
				}
		break;
		
		case $type5669:
		case $type5923:
			if((searchavailspec($allspec, $spec17700069)+searchavailspec($allspec, $spec700069)+searchavailspec($allspec, $spec69))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</div>';
				}
		break;

		case $type5670:
		case $type5924:
		break;
		
		case $type5671:
		case $type5925:
			if((searchavailspec($allspec, $spec17700070)+searchavailspec($allspec, $spec700070)+searchavailspec($allspec, $spec70))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (тепловые сети))</div>';
				}
		break;		
			
		case $type5672:
		case $type5926:
			if((searchavailspec($allspec, $spec67)+
				searchavailspec($allspec, $spec700067)+
				searchavailspec($allspec, $spec17700067))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</div>';
				}
		break;		
		
		case $type5673:
		case $type5927:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</div>';
				}
		break;		
		
		case $type5674:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</div>';
				}
		break;		
		
		case $type5675:
		case $type5928:
			if((searchavailspec($allspec, $spec17700069)+searchavailspec($allspec, $spec700069)+searchavailspec($allspec, $spec69))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</div>';
				}
		break;		
			
		case $type5676: 
		break;
		
		case $type5677:
		case $type5929:
			if(searchavailspec($allspec, $spec249)>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (охрана окружающей среды)</div>';
				}
		break;
		
		case $type5678:
			if((searchavailspec($allspec, $spec700164)+searchavailspec($allspec, $spec164))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (организация строительства)</div>';
				}
		break;		
		
		case $type5679:
		case $type5930:
			if(searchavailspec($allspec, $spec248)>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (охрана окружающей среды)</div>';
				}
		break;
		
		case $type5680:
		case $type5681:
		case $type5931:
		case $type5932:
		break;
		
		case $type5682:
		case $type5933:
			$count=0;
			$count=countoverzero(searchavailspec($allspec, $spec24),$count);
			$count=countoverzero(searchavailspec($allspec, $spec26),$count);
			$count=countoverzero(searchavailspec($allspec, $spec30),$count);
			$count=countoverzero(searchavailspec($allspec, $spec33),$count);
			$count=countoverzero(searchavailspec($allspec, $spec34),$count);
			$count=countoverzero(searchavailspec($allspec, $spec57),$count);
			$count=countoverzero(searchavailspec($allspec, $spec61),$count);
			$count=countoverzero(searchavailspec($allspec, $spec84),$count);
			$count=countoverzero(searchavailspec($allspec, $spec85),$count);
			$count=countoverzero(searchavailspec($allspec, $spec95),$count);
			$count=countoverzero(searchavailspec($allspec, $spec97),$count);
			$count=countoverzero(searchavailspec($allspec, $spec113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec144),$count);
			$count=countoverzero(searchavailspec($allspec, $spec145),$count);
			$count=countoverzero(searchavailspec($allspec, $spec146),$count);
			$count=countoverzero(searchavailspec($allspec, $spec276),$count);
			$count=countoverzero(searchavailspec($allspec, $spec277),$count);
			$count=countoverzero(searchavailspec($allspec, $spec20113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700024),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700026),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700030),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700033),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700034),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700057),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700061),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700084),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700085),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700095),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700097),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec710113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700024),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700026),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700030),$count);			
			$count=countoverzero(searchavailspec($allspec, $spec17700033),$count);							
			$count=countoverzero(searchavailspec($allspec, $spec17700084),$count);	
			$count=countoverzero(searchavailspec($allspec, $spec17700085),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700061),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700097),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700024),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700026),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700030),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700033),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700034),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700057),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700061),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700084),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700085),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700095),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700097),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700276),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700277),$count);
			
		if((searchavailspec($allspec, $spec40)+searchavailspec($allspec, $spec700187)+searchavailspec($allspec, $spec188)+searchavailspec($allspec, $spec189)+
		searchavailspec($allspec, $spec18700187)+
		searchavailspec($allspec, $spec187))<1)
		{
				echo '<div class="red">Нет ни одного руководителя проекта</div>';
				}						
			else {
			echo '<div class="green">Руководитель проекта есть</div>';		
				}
		if	($count<4)
				{
				echo '<div class="red">Количество специалистов по техническому надзору меньше 4</div>';
				}		
			else {
				echo '<div class="green">Количество специалистов по техническому надзору 4 или больше</div>';
				}	
		break;
		
		case $type5683:
		case $type5934:
		if((searchavailspec($allspec, $spec700024)+
		searchavailspec($allspec, $spec144)+
		searchavailspec($allspec, $spec145)+
		searchavailspec($allspec, $spec146)+
		searchavailspec($allspec, $spec24)+
		searchavailspec($allspec, $spec18700024)+
		searchavailspec($allspec, $spec17700024))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (общестроительные работы)</div>';
				}
		break;		
		
		case $type5684:
		case $type5935:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec18700026)+
		searchavailspec($allspec, $spec17700026))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</div>';
				}
		break;		
		
		case $type5685:
		case $type5936:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec18700026)+
		searchavailspec($allspec, $spec17700026))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</div>';
				}
		break;		
		
		case $type5686:
		case $type5937:
		if((searchavailspec($allspec, $spec277)+
		searchavailspec($allspec, $spec18700277))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (устройство систем холодоснабжения)</div>';
				}
		break;			
		
		case $type5687:
		case $type5938:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec18700026)+
		searchavailspec($allspec, $spec17700026)+
		searchavailspec($allspec, $spec95)+
		searchavailspec($allspec, $spec18700095)+
		searchavailspec($allspec, $spec700095))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</div>';
				}
		break;		
		
		case $type5688:
		case $type5939:
		if((searchavailspec($allspec, $spec700057)+
		searchavailspec($allspec, $spec18700057)+
		searchavailspec($allspec, $spec57))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области газоснабжения)</div>';
				}
		break;
		
		case $type5689:
		case $type5940:
		if((searchavailspec($allspec, $spec700030)+
		searchavailspec($allspec, $spec30)+
		searchavailspec($allspec, $spec18700030)+
		searchavailspec($allspec, $spec17700030))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области электроснабжения и автоматизации)</div>';
				}
		break;	
				
		case $type5690:
		case $type5941:
		if((searchavailspec($allspec, $spec700097)+
		searchavailspec($allspec, $spec97)+
		searchavailspec($allspec, $spec18700097)+
		searchavailspec($allspec, $spec17700097))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области связи, сигнализации)</div>';
				}
		break;	
		
		case $type5691:
		case $type5942:
		if((searchavailspec($allspec, $spec700033)+
		searchavailspec($allspec, $spec33)+
		searchavailspec($allspec, $spec18700033)+
		searchavailspec($allspec, $spec17700033))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (строительство автомобильных дорог и аэродромов, строительство мостов, транспортных эстакад и путепроводов)</div>';
				}
		break;		
		
		case $type5692:
		case $type5943:
		if((searchavailspec($allspec, $spec700084)+
		searchavailspec($allspec, $spec84)+
		searchavailspec($allspec, $spec18700084)+
		searchavailspec($allspec, $spec17700084))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (строительство железных дорог)</div>';
				}
		break;		
		
		case $type5693:
		case $type5944:
		if((searchavailspec($allspec, $spec700085)+
		searchavailspec($allspec, $spec85)+
		searchavailspec($allspec, $spec18700085)+
		searchavailspec($allspec, $spec17700085))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (строительство сооружений транспортных тоннелей, метрополитенов)</div>';
				}
		break;	
		
		case $type5694:
		case $type5945:
		if((searchavailspec($allspec, $spec700034)+
		searchavailspec($allspec, $spec18700034)+
		searchavailspec($allspec, $spec34))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (гидротехническое и мелиоративное строительство)</div>';
				}
		break;	
		
		case $type5695:
		if((searchavailspec($allspec, $spec710113)+
		searchavailspec($allspec, $spec20113)+
		searchavailspec($allspec, $spec700113)+
		searchavailspec($allspec, $spec18700113)+
		searchavailspec($allspec, $spec113))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (благоустройство территорий)</div>';
				}
		break;		
			
		case $type5696:
		case $type5946:
		if((searchavailspec($allspec, $spec276)+
		searchavailspec($allspec, $spec18700276))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (монтаж технологических трубопроводов и оборудования)</div>';
				}
		break;		

		case $type5697:
		case $type5947:
		if((searchavailspec($allspec, $spec700061)+
		searchavailspec($allspec, $spec17700061)+
		searchavailspec($allspec, $spec18700061)+
		searchavailspec($allspec, $spec61))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (устройство магистральных трубопроводов для транспортирования нефти, газа, нефтепродуктов)</div>';
				}
		break;
		
		case $type5698:
		case $type5948:
		if((searchavailspec($allspec, $spec700064)+searchavailspec($allspec, $spec3)+searchavailspec($allspec, $spec64))>=2 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов ГАП меньше 2</div>';
				}
		break;		
		
		case $type5699:
		case $type5700:
		case $type5701:
		case $type5702:
		case $type5703:
		case $type5704:
		case $type5705:
		case $type5949:
		case $type5950:
		case $type5951:
		case $type5952:
		case $type5953:
		case $type5954:
		break;
		
		case $type5706:
		case $type5955:
		if((searchavailspec($allspec, $spec71043)+
		searchavailspec($allspec, $spec71044)+
		searchavailspec($allspec, $spec71045)+
		searchavailspec($allspec, $spec71039)+
		searchavailspec($allspec, $spec71046)+
		searchavailspec($allspec, $spec71048)+
		searchavailspec($allspec, $spec71047)+
		searchavailspec($allspec, $spec71059)+
		searchavailspec($allspec, $spec71063)+
		searchavailspec($allspec, $spec71074)+
		searchavailspec($allspec, $spec700128)+
		searchavailspec($allspec, $spec700047)+
		searchavailspec($allspec, $spec710128)+
		searchavailspec($allspec, $spec700048)+
		searchavailspec($allspec, $spec700045)+
		searchavailspec($allspec, $spec700046)+
		searchavailspec($allspec, $spec700073)+
		searchavailspec($allspec, $spec700059)+
		searchavailspec($allspec, $spec700039)+
		searchavailspec($allspec, $spec700126)+
		searchavailspec($allspec, $spec700043)+
		searchavailspec($allspec, $spec700096)+
		searchavailspec($allspec, $spec700074)+
		searchavailspec($allspec, $spec700063)+
		searchavailspec($allspec, $spec700044)+
		searchavailspec($allspec, $spec150)+
		searchavailspec($allspec, $spec17700043)+
		searchavailspec($allspec, $spec17700044)+
		searchavailspec($allspec, $spec45)+
		searchavailspec($allspec, $spec39)+
		searchavailspec($allspec, $spec17700046)+
		searchavailspec($allspec, $spec17700048)+
		searchavailspec($allspec, $spec17700047)+
		searchavailspec($allspec, $spec17700059)+
		searchavailspec($allspec, $spec63)+
		searchavailspec($allspec, $spec73)+
		searchavailspec($allspec, $spec96)+
		searchavailspec($allspec, $spec17700074)+
		searchavailspec($allspec, $spec126)+
		searchavailspec($allspec, $spec128)+
		searchavailspec($allspec, $spec278)+
		searchavailspec($allspec, $spec43)+
		searchavailspec($allspec, $spec44)+
		searchavailspec($allspec, $spec46)+
		searchavailspec($allspec, $spec48)+
		searchavailspec($allspec, $spec47)+
		searchavailspec($allspec, $spec59)+
		searchavailspec($allspec, $spec74)+
		searchavailspec($allspec, $spec260)+
		searchavailspec($allspec, $spec261)+
		searchavailspec($allspec, $spec262)+
		searchavailspec($allspec, $spec263))<1)
		{
				echo '<div class="red">Нет ни одного главного инженера</div>';
				}					
			
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';		
				}
		break;		
		
		case $type5707:
		case $type5956:
		if((searchavailspec($allspec, $spec71043)+
		searchavailspec($allspec, $spec71044)+
		searchavailspec($allspec, $spec71045)+
		searchavailspec($allspec, $spec71039)+
		searchavailspec($allspec, $spec71046)+
		searchavailspec($allspec, $spec71048)+
		searchavailspec($allspec, $spec71047)+
		searchavailspec($allspec, $spec71059)+
		searchavailspec($allspec, $spec71063)+
		searchavailspec($allspec, $spec71074)+
		searchavailspec($allspec, $spec700128)+
		searchavailspec($allspec, $spec700047)+
		searchavailspec($allspec, $spec710128)+
		searchavailspec($allspec, $spec700048)+
		searchavailspec($allspec, $spec700045)+
		searchavailspec($allspec, $spec700046)+
		searchavailspec($allspec, $spec700073)+
		searchavailspec($allspec, $spec700059)+
		searchavailspec($allspec, $spec700039)+
		searchavailspec($allspec, $spec700126)+
		searchavailspec($allspec, $spec700043)+
		searchavailspec($allspec, $spec700096)+
		searchavailspec($allspec, $spec700074)+
		searchavailspec($allspec, $spec700063)+
		searchavailspec($allspec, $spec700044)+
		searchavailspec($allspec, $spec150)+
		searchavailspec($allspec, $spec17700043)+
		searchavailspec($allspec, $spec17700044)+
		searchavailspec($allspec, $spec45)+
		searchavailspec($allspec, $spec39)+
		searchavailspec($allspec, $spec17700046)+
		searchavailspec($allspec, $spec17700048)+
		searchavailspec($allspec, $spec17700047)+
		searchavailspec($allspec, $spec17700059)+
		searchavailspec($allspec, $spec63)+
		searchavailspec($allspec, $spec73)+
		searchavailspec($allspec, $spec96)+
		searchavailspec($allspec, $spec17700074)+
		searchavailspec($allspec, $spec126)+
		searchavailspec($allspec, $spec128)+
		searchavailspec($allspec, $spec278)+
		searchavailspec($allspec, $spec43)+
		searchavailspec($allspec, $spec44)+
		searchavailspec($allspec, $spec46)+
		searchavailspec($allspec, $spec48)+
		searchavailspec($allspec, $spec47)+
		searchavailspec($allspec, $spec59)+
		searchavailspec($allspec, $spec74)+
		searchavailspec($allspec, $spec260)+
		searchavailspec($allspec, $spec261)+
		searchavailspec($allspec, $spec262)+
		searchavailspec($allspec, $spec263))<1)
		{
				echo '<div class="red">Нет ни одного главного инженера</div>';
				}					
			
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';		
				}
		break;
				
		case $type5708:
		case $type5957:
		break;
			
		case $type5709:
		case $type5958:
				if((searchavailspec($allspec, $spec140)+searchavailspec($allspec, $spec142)+
				searchavailspec($allspec, $spec700140)+searchavailspec($allspec, $spec700142))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного или ведущего геодезиста</div>';
				}
		break;		
		
		case $type5710:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5711:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec15)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec16)+searchavailspec($allspec, $spec76)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec78)+
				searchavailspec($allspec, $spec79)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec81)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700216)+searchavailspec($allspec, $spec17700243)+
				searchavailspec($allspec, $spec17700245)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec245)+searchavailspec($allspec, $spec205)+
				searchavailspec($allspec, $spec231)+searchavailspec($allspec, $spec233)+
				searchavailspec($allspec, $spec234)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec215)+
				searchavailspec($allspec, $spec216)+searchavailspec($allspec, $spec243))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5712:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+					
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5713:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;

		case $type5714:
		case $type5959:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+				
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5715:
		case $type5960:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5716:
			if((searchavailspec($allspec, $spec270)+
				searchavailspec($allspec, $spec274))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5717:
				if((searchavailspec($allspec, $spec0)+
					searchavailspec($allspec, $spec9)+
					searchavailspec($allspec, $spec11)+
					searchavailspec($allspec, $spec12)+
					searchavailspec($allspec, $spec15)+
					searchavailspec($allspec, $spec18)+
					searchavailspec($allspec, $spec19)+
					searchavailspec($allspec, $spec16)+
					searchavailspec($allspec, $spec41)+
					searchavailspec($allspec, $spec76)+
					searchavailspec($allspec, $spec77)+
					searchavailspec($allspec, $spec78)+
					searchavailspec($allspec, $spec79)+
					searchavailspec($allspec, $spec80)+
					searchavailspec($allspec, $spec81)+
					searchavailspec($allspec, $spec82)+
					searchavailspec($allspec, $spec83)+
					searchavailspec($allspec, $spec194)+
					searchavailspec($allspec, $spec195)+
					searchavailspec($allspec, $spec196)+
					searchavailspec($allspec, $spec198)+
					searchavailspec($allspec, $spec199)+
					searchavailspec($allspec, $spec203)+
					searchavailspec($allspec, $spec205)+
					searchavailspec($allspec, $spec206)+
					searchavailspec($allspec, $spec208)+
					searchavailspec($allspec, $spec215)+
					searchavailspec($allspec, $spec216)+
					searchavailspec($allspec, $spec222)+
					searchavailspec($allspec, $spec223)+
					searchavailspec($allspec, $spec224)+
					searchavailspec($allspec, $spec226)+
					searchavailspec($allspec, $spec227)+
					searchavailspec($allspec, $spec231)+
					searchavailspec($allspec, $spec233)+
					searchavailspec($allspec, $spec234)+
					searchavailspec($allspec, $spec236)+
					searchavailspec($allspec, $spec243)+
					searchavailspec($allspec, $spec245)+
					searchavailspec($allspec, $spec17700195)+
					searchavailspec($allspec, $spec17700199)+
					searchavailspec($allspec, $spec17700203)+
					searchavailspec($allspec, $spec17700205)+
					searchavailspec($allspec, $spec17700209)+
					searchavailspec($allspec, $spec17700215)+
					searchavailspec($allspec, $spec17700216)+
					searchavailspec($allspec, $spec17700223)+
					searchavailspec($allspec, $spec17700231)+
					searchavailspec($allspec, $spec17700233)+
					searchavailspec($allspec, $spec17700234)+
					searchavailspec($allspec, $spec17700237)+
					searchavailspec($allspec, $spec17700243)+
					searchavailspec($allspec, $spec17700245))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type5718:
		case $type5961:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5719:
		case $type5962:
				if((searchavailspec($allspec, $spec9)+
					searchavailspec($allspec, $spec18)+
					searchavailspec($allspec, $spec19)+
					searchavailspec($allspec, $spec41)+
					searchavailspec($allspec, $spec82)+
					searchavailspec($allspec, $spec83)+
					searchavailspec($allspec, $spec194)+
					searchavailspec($allspec, $spec195)+
					searchavailspec($allspec, $spec196)+
					searchavailspec($allspec, $spec198)+
					searchavailspec($allspec, $spec199)+
					searchavailspec($allspec, $spec209)+
					searchavailspec($allspec, $spec222)+
					searchavailspec($allspec, $spec223)+
					searchavailspec($allspec, $spec224)+
					searchavailspec($allspec, $spec226)+
					searchavailspec($allspec, $spec227)+
					searchavailspec($allspec, $spec237)+
					searchavailspec($allspec, $spec17700195)+
					searchavailspec($allspec, $spec17700199)+
					searchavailspec($allspec, $spec17700209)+
					searchavailspec($allspec, $spec17700223)+
					searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;	
		
		case $type5720:
		case $type5963:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec267)+searchavailspec($allspec, $spec271))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5721:
		case $type5964:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5722:
		case $type5965:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5723:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;			
		
		case $type5724:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
				
		case $type5725:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec76)+searchavailspec($allspec, $spec77)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec17700195)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700197)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec17700203)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec197)+searchavailspec($allspec, $spec225)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec205)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec233)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5726:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5727:
		case $type5966:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;			
		
		case $type5728:
		case $type5967:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec110)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700211)+searchavailspec($allspec, $spec17700239)+
				searchavailspec($allspec, $spec211)+searchavailspec($allspec, $spec239)+				
				searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;			
		
		case $type5729:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type5730:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;			
		
		case $type5731:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5732:
		case $type5968:
				if((searchavailspec($allspec, $spec11)+
					searchavailspec($allspec, $spec76)+
					searchavailspec($allspec, $spec203)+
					searchavailspec($allspec, $spec205)+
					searchavailspec($allspec, $spec212)+
					searchavailspec($allspec, $spec231)+
					searchavailspec($allspec, $spec233)+
					searchavailspec($allspec, $spec235)+
					searchavailspec($allspec, $spec17700203)+
					searchavailspec($allspec, $spec17700205)+
					searchavailspec($allspec, $spec17700231)+
					searchavailspec($allspec, $spec17700233))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}	
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;

		case $type5733:
		case $type5969:
				if((searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec17700204)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700232)+
				searchavailspec($allspec, $spec204)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec232))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))<1)	
			{
				echo '<div class="red">Нет прораба(мастера) по установке приборов учета тепло- и водопотребления</div>';
				}	
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;
		
		case $type5734:
		case $type5970:
				if((searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec234))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}	
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;			

		case $type5735:
		case $type5971:
				if((searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec207)+searchavailspec($allspec, $spec234))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))<1)	
			{
				echo '<div class="red">Нет прораба(мастера) по установке приборов учета тепло- и водопотребления</div>';
				}	
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;	
		
		case $type5736:
		case $type5972:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec17700216)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700245)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec245)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec216))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5737:
		case $type5973:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec81)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700246)+
				searchavailspec($allspec, $spec17700217)+searchavailspec($allspec, $spec17700215)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec217)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec246))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5738:
		case $type5974:
				if((searchavailspec($allspec, $spec13)+searchavailspec($allspec, $spec193)+
				searchavailspec($allspec, $spec221))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type5739:
				if((searchavailspec($allspec, $spec0)+searchavailspec($allspec, $spec16)+
				searchavailspec($allspec, $spec218)+searchavailspec($allspec, $spec244))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;	
	
		case $type5740:
		case $type5975:
				if((searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec206)+searchavailspec($allspec, $spec207)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec234))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5741:
		case $type5976:
				if((searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226)+searchavailspec($allspec, $spec226))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5742:
		case $type5977:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5743:
		case $type5978:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5744:
				if((searchavailspec($allspec, $spec710112)+searchavailspec($allspec, $spec112)+
				searchavailspec($allspec, $spec20112)+searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec220))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5745:
		case $type5979:
				if((searchavailspec($allspec, $spec82)+searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec224))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
				
		case $type5746:
		case $type5980:
				if((searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700237)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5747:
		case $type5981:		
				if((searchavailspec($allspec, $spec269)+searchavailspec($allspec, $spec273))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type5748:	
		case $type5982:
				if((searchavailspec($allspec, $spec17)+searchavailspec($allspec, $spec214)
					+searchavailspec($allspec, $spec242))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5749:
						if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)
					+searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type5750:
		case $type5983:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5751:
		case $type5984:
				if((searchavailspec($allspec, $spec268)+searchavailspec($allspec, $spec272))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;	
		
	case $type5752:
	case $type5985:
	break;
	
	case $type5901:
	case $type5986:
				if((searchavailspec($allspec, $spec700093)+searchavailspec($allspec, $spec700135)+searchavailspec($allspec, $spec800135)+searchavailspec($allspec, $spec93)+
				searchavailspec($allspec, $spec17700135))>=3){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
				else {
				echo '<div class="red">Не достаточно аттестованных специалистов</div>';
				}
		break;		
	
		case $type5903:
		case $type5987:
				if(searchavailspec($allspec, $spec250)>=3){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
				else {
				echo '<div class="red">Не достаточно специалистов, осуществляющих обследование автомобильных дорог и мостовых сооружений</div>';
				}
		break;
		
        case $type5902:
				if((searchavailspec($allspec, $spec253)+searchavailspec($allspec, $spec254)+
				searchavailspec($allspec, $spec255)+searchavailspec($allspec, $spec256)+
				searchavailspec($allspec, $spec257)+searchavailspec($allspec, $spec258)+searchavailspec($allspec, $spec259))>=3){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
				else {
				echo '<div class="red">Не достаточно аттестованных специалистов</div>';
				}
		break;		
		}
	} 
	break;
	}
	break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////CASE 4//////////////////////////////////////////////////////////////////////////////////
		
	case 4:
	if($vidyrabot1 < $outdate){
        for ($i = 0; $i <= count($types_of_jobs[$k]->field_field_vidyrab); $i++) 
		{ 
			$types_of_jobs2=$types_of_jobs[$k]->field_field_vidyrab[$i][raw];
			$types_of_jobs3=$types_of_jobs2[taxonomy_term]->name;
			$vidyrabot[$k][$i]=$types_of_jobs3;
			print_r ("</br>".$types_of_jobs3."</br>");
			
		
				switch ($types_of_jobs3) {
        
		
        case $type163:
		break;
		
		case $type164:
		if((searchavailspec($allspec, $spec700166)+searchavailspec($allspec, $spec166)+searchavailspec($allspec, $spec173))>=2){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-геодезические изыскания меньше 2</div>';
				}
		break;
		
		case $type165:
			if((searchavailspec($allspec, $spec700167)+searchavailspec($allspec, $spec167)+searchavailspec($allspec, $spec174))>=2){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-геологические изыскания меньше 2</div>';
				}
		break;
		
		case $type166:
			if((searchavailspec($allspec, $spec700168)+searchavailspec($allspec, $spec168))>=2){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-гидрометеорологические изыскания меньше 2</div>';
				}
		break;
		
		case $type167:
			if((searchavailspec($allspec, $spec700169)+searchavailspec($allspec, $spec169))>=2){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-экологические изыскания меньше 2</div>';
				}
		break;
		
		case $type168:
			if((searchavailspec($allspec, $spec700170)+searchavailspec($allspec, $spec170))>=2){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-геотехнические изыскания меньше 2</div>';
				}
		break;
		
		case $type169:
			if((searchavailspec($allspec, $spec700171)+searchavailspec($allspec, $spec171))>=2){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих обследование состояния грунтов оснований зданий и сооружений меньше 2</div>';
				}
		break;
		
		case $type170:
			if((searchavailspec($allspec, $spec700064)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3))>=1 or 
			(searchavailspec($allspec, $spec4)+searchavailspec($allspec, $spec700129)+searchavailspec($allspec, $spec700004)+searchavailspec($allspec, $spec148)+searchavailspec($allspec, $spec17700129)+searchavailspec($allspec, $spec129)+searchavailspec($allspec, $spec275))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного специалиста ГАП или ГИП</div>';
				}
		break;
		
		case $type171:
			if	((
					searchavailspec($allspec, $spec3)+
					searchavailspec($allspec, $spec64)+
					searchavailspec($allspec, $spec700064))<1
					and (
					searchavailspec($allspec, $spec4)+
					searchavailspec($allspec, $spec129)+
					searchavailspec($allspec, $spec148)+
					searchavailspec($allspec, $spec275)+
					searchavailspec($allspec, $spec700004)+
					searchavailspec($allspec, $spec17700129))<1)
             {
				echo '<div class="red">Нет ни одного ГАПа или ГИПа</div>';
				}
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;
					
		case $type196:
		break;
		
		case $type197:
			if((searchavailspec($allspec, $spec700163)+searchavailspec($allspec, $spec163))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (генеральный план)</div>';
				}
		break;
		
		case $type198:
			if((searchavailspec($allspec, $spec252)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3)+searchavailspec($allspec, $spec700064))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (архитектурные решения) либо ГАПа</div>';
				}
		break;
		
		case $type199:
			if(searchavailspec($allspec, $spec139)+
			   searchavailspec($allspec, $spec700139)>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (сметная документация)</div>';
				}
		break;
		
		case $type200:			
		if((searchavailspec($allspec, $spec66)+searchavailspec($allspec, $spec17700066)+searchavailspec($allspec, $spec700066))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (конструктивные решения)</div>';
				}			
		break;
		
		case $type543:
		break;
		
		case $type5435:
			if((searchavailspec($allspec, $spec17700071)+searchavailspec($allspec, $spec700071)+searchavailspec($allspec, $spec71))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (холодоснабжение))</div>';
				}
		break;
		
		case $type5436:
		case $type5438:
		case $type5797:
			if((searchavailspec($allspec, $spec17700067)+searchavailspec($allspec, $spec700067)+searchavailspec($allspec, $spec67))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</div>';
				}
		break;
		
		case $type5441:
		case $type5442:
		case $type5443:
		case $type5798:
			if((searchavailspec($allspec, $spec72)+
				searchavailspec($allspec, $spec700072)+
				searchavailspec($allspec, $spec17700072))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</div>';
				}
		break;
		
		case $type5444:
		case $type5453:
		case $type5454:
		case $type5799:
			if((searchavailspec($allspec, $spec98)+
				searchavailspec($allspec, $spec700098)+
				searchavailspec($allspec, $spec17700098))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</div>';
				}
		break;
		
		case $type5439:
		case $type5440:
		case $type5795:
			if((searchavailspec($allspec, $spec68)+
				searchavailspec($allspec, $spec700068)+
				searchavailspec($allspec, $spec17700068))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (отопление, вентиляция и кондиционирование воздуха))</div>';
				}
		break;	
		
		case $type5437:
			if((searchavailspec($allspec, $spec17700069)+searchavailspec($allspec, $spec700069)+searchavailspec($allspec, $spec69))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</div>';
				}
		break;

		case $type5445: /*4.6. наружные сети и системы:*/
		break;
		
		case $type5446:
		case $type5802:
			if((searchavailspec($allspec, $spec17700070)+searchavailspec($allspec, $spec700070)+searchavailspec($allspec, $spec70))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (тепловые сети))</div>';
				}
		break;
			
		case $type5447:
		case $type5449:
		case $type5803:
			if((searchavailspec($allspec, $spec67)+
				searchavailspec($allspec, $spec700067)+
				searchavailspec($allspec, $spec17700067))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</div>';
				}
		break;	
			
		case $type5450:
		case $type5804:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</div>';
				}
		break;
		
		case $type5451:
		case $type5455:
		case $type5456:
		case $type5805:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</div>';
				}
		break;
		
		case $type5448:
			if((searchavailspec($allspec, $spec17700069)+searchavailspec($allspec, $spec700069)+searchavailspec($allspec, $spec69))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</div>';
				}
		break;
	
		case $type202: 
		case $type5457: /*4.8.:*/
		break;
		
		case $type5459:
				if(searchavailspec($allspec, $spec249)>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерно-технические мероприятия гражданской обороны. Мероприятия по предупреждению чрезвычайных ситуаций)</div>';
				}
		break;
		
		case $type5460:
				if(searchavailspec($allspec, $spec249)>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерно-технические мероприятия гражданской обороны. Мероприятия по предупреждению чрезвычайных ситуаций)</div>';
				}
		break;
		
		case $type5461:
				if(searchavailspec($allspec, $spec249)>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерно-технические мероприятия гражданской обороны. Мероприятия по предупреждению чрезвычайных ситуаций)</div>';
				}
		break;
		
		case $type5462:
			if((searchavailspec($allspec, $spec700164)+searchavailspec($allspec, $spec164))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (организация строительства)</div>';
				}
		break;
		
		case $type5458:
			if(searchavailspec($allspec, $spec248)>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (охрана окружающей среды)</div>';
				}
		break;		
		
		case $type205:/*5. Выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов первого-четвертого классов сложности*/
		case $type206:
		break;
		
		case $type207:
			$count=0;
			$count=countoverzero(searchavailspec($allspec, $spec24),$count);
			$count=countoverzero(searchavailspec($allspec, $spec26),$count);
			$count=countoverzero(searchavailspec($allspec, $spec30),$count);
			$count=countoverzero(searchavailspec($allspec, $spec33),$count);
			$count=countoverzero(searchavailspec($allspec, $spec34),$count);
			$count=countoverzero(searchavailspec($allspec, $spec57),$count);
			$count=countoverzero(searchavailspec($allspec, $spec61),$count);
			$count=countoverzero(searchavailspec($allspec, $spec84),$count);
			$count=countoverzero(searchavailspec($allspec, $spec85),$count);
			$count=countoverzero(searchavailspec($allspec, $spec95),$count);
			$count=countoverzero(searchavailspec($allspec, $spec97),$count);
			$count=countoverzero(searchavailspec($allspec, $spec113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec144),$count);
			$count=countoverzero(searchavailspec($allspec, $spec145),$count);
			$count=countoverzero(searchavailspec($allspec, $spec146),$count);
			$count=countoverzero(searchavailspec($allspec, $spec276),$count);
			$count=countoverzero(searchavailspec($allspec, $spec277),$count);
			$count=countoverzero(searchavailspec($allspec, $spec20113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700024),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700026),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700030),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700033),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700034),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700057),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700061),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700084),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700085),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700095),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700097),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec710113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700024),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700026),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700030),$count);			
			$count=countoverzero(searchavailspec($allspec, $spec17700033),$count);							
			$count=countoverzero(searchavailspec($allspec, $spec17700084),$count);	
			$count=countoverzero(searchavailspec($allspec, $spec17700085),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700061),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700097),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700024),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700026),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700030),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700033),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700034),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700057),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700061),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700084),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700085),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700095),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700097),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700276),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700277),$count);
			
			if((searchavailspec($allspec, $spec40)+
				searchavailspec($allspec, $spec187)+
				searchavailspec($allspec, $spec18700187)+
				searchavailspec($allspec, $spec188)+
				searchavailspec($allspec, $spec189)+
				searchavailspec($allspec, $spec700187))<1){
			echo '<div class="red">Нет ни одного руководителя проекта</div>';
				}		
			else {
			echo '<div class="green">Руководитель проекта есть</div>';		
				}
			if	($count<2)
				{
				echo '<div class="red">Количество специалистов по техническому надзору меньше 2</div>';
				}		
			else {
				echo '<div class="green">Количество специалистов по техническому надзору 2 или больше</div>';
				}	
		break;
		
		case $type208:
		if((searchavailspec($allspec, $spec700024)+
		searchavailspec($allspec, $spec144)+
		searchavailspec($allspec, $spec145)+
		searchavailspec($allspec, $spec146)+
		searchavailspec($allspec, $spec24)+
		searchavailspec($allspec, $spec18700024)+
		searchavailspec($allspec, $spec17700024))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (общестроительные работы)</div>';
				}
		break;
		
		case $type209:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec18700026)+
		searchavailspec($allspec, $spec17700026))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</div>';
				}
		break;
		
		case $type210:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec18700026)+
		searchavailspec($allspec, $spec17700026))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</div>';
				}
		break;
		
		case $type211:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec18700026)+
		searchavailspec($allspec, $spec17700026)+
		searchavailspec($allspec, $spec95)+
		searchavailspec($allspec, $spec18700095)+
		searchavailspec($allspec, $spec700095))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</div>';
				}
		break;
		
		case $type212:
		if((searchavailspec($allspec, $spec700057)+
		searchavailspec($allspec, $spec18700057)+
		searchavailspec($allspec, $spec57))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области газоснабжения)</div>';
				}
		break;

		case $type213:
		if((searchavailspec($allspec, $spec700030)+
		searchavailspec($allspec, $spec30)+
		searchavailspec($allspec, $spec18700030)+
		searchavailspec($allspec, $spec17700030))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области электроснабжения и автоматизации)</div>';
				}
		break;
		
		case $type214:
		if((searchavailspec($allspec, $spec700097)+
		searchavailspec($allspec, $spec97)+
		searchavailspec($allspec, $spec18700097)+
		searchavailspec($allspec, $spec17700097))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области связи, сигнализации)</div>';
				}
		break;

		case $type215:
		if((searchavailspec($allspec, $spec700033)+
		searchavailspec($allspec, $spec33)+
		searchavailspec($allspec, $spec18700033)+
		searchavailspec($allspec, $spec17700033))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (строительство автомобильных дорог и аэродромов, строительство мостов, транспортных эстакад и путепроводов)</div>';
				}
		break;

		case $type216:
		if((searchavailspec($allspec, $spec700084)+
		searchavailspec($allspec, $spec84)+
		searchavailspec($allspec, $spec18700084)+
		searchavailspec($allspec, $spec17700084))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (строительство железных дорог)</div>';
				}
		break;

		case $type217:
		if((searchavailspec($allspec, $spec700085)+
		searchavailspec($allspec, $spec85)+
		searchavailspec($allspec, $spec18700085)+
		searchavailspec($allspec, $spec17700085))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (строительство сооружений транспортных тоннелей, метрополитенов)</div>';
				}
		break;

		case $type218:
		if((searchavailspec($allspec, $spec700034)+
		searchavailspec($allspec, $spec18700034)+
		searchavailspec($allspec, $spec34))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (гидротехническое и мелиоративное строительство)</div>';
				}
		break;

		case $type219:
		if((searchavailspec($allspec, $spec710113)+
		searchavailspec($allspec, $spec20113)+
		searchavailspec($allspec, $spec700113)+
		searchavailspec($allspec, $spec18700113)+
		searchavailspec($allspec, $spec113))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (благоустройство территорий)</div>';
				}
		break;

		case $type220:
		if((searchavailspec($allspec, $spec700064)+
		searchavailspec($allspec, $spec3)+
		searchavailspec($allspec, $spec64))>=1 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов ГАП меньше 1</div>';
				}
		break;
		
		case $type221:	
		case $type222:
		case $type223:
		case $type224:
		case $type225:
		case $type226:
		break;
		
		case $type227:
		if((searchavailspec($allspec, $spec71043)+
		searchavailspec($allspec, $spec71044)+
		searchavailspec($allspec, $spec71045)+
		searchavailspec($allspec, $spec71039)+
		searchavailspec($allspec, $spec71046)+
		searchavailspec($allspec, $spec71048)+
		searchavailspec($allspec, $spec71047)+
		searchavailspec($allspec, $spec71059)+
		searchavailspec($allspec, $spec71063)+
		searchavailspec($allspec, $spec71074)+
		searchavailspec($allspec, $spec700128)+
		searchavailspec($allspec, $spec700047)+
		searchavailspec($allspec, $spec710128)+
		searchavailspec($allspec, $spec700048)+
		searchavailspec($allspec, $spec700045)+
		searchavailspec($allspec, $spec700046)+
		searchavailspec($allspec, $spec700073)+
		searchavailspec($allspec, $spec700059)+
		searchavailspec($allspec, $spec700039)+
		searchavailspec($allspec, $spec700126)+
		searchavailspec($allspec, $spec700043)+
		searchavailspec($allspec, $spec700096)+
		searchavailspec($allspec, $spec700074)+
		searchavailspec($allspec, $spec700063)+
		searchavailspec($allspec, $spec700044)+
		searchavailspec($allspec, $spec150)+
		searchavailspec($allspec, $spec17700043)+
		searchavailspec($allspec, $spec17700044)+
		searchavailspec($allspec, $spec45)+
		searchavailspec($allspec, $spec39)+
		searchavailspec($allspec, $spec17700046)+
		searchavailspec($allspec, $spec17700048)+
		searchavailspec($allspec, $spec17700047)+
		searchavailspec($allspec, $spec17700059)+
		searchavailspec($allspec, $spec63)+
		searchavailspec($allspec, $spec73)+
		searchavailspec($allspec, $spec96)+
		searchavailspec($allspec, $spec17700074)+
		searchavailspec($allspec, $spec126)+
		searchavailspec($allspec, $spec128)+
		searchavailspec($allspec, $spec278)+
		searchavailspec($allspec, $spec43)+
		searchavailspec($allspec, $spec44)+
		searchavailspec($allspec, $spec46)+
		searchavailspec($allspec, $spec48)+
		searchavailspec($allspec, $spec47)+
		searchavailspec($allspec, $spec59)+
		searchavailspec($allspec, $spec74)+
		searchavailspec($allspec, $spec260)+
		searchavailspec($allspec, $spec261)+
		searchavailspec($allspec, $spec262)+
		searchavailspec($allspec, $spec263))<1)
		{
				echo '<div class="red">Нет ни одного главного инженера</div>';
				}					
			
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';		
				}
		break;
		
		case $type5827:
		break;
		
		case $type5828:
		if((searchavailspec($allspec, $spec71043)+
		searchavailspec($allspec, $spec71044)+
		searchavailspec($allspec, $spec71045)+
		searchavailspec($allspec, $spec71039)+
		searchavailspec($allspec, $spec71046)+
		searchavailspec($allspec, $spec71048)+
		searchavailspec($allspec, $spec71047)+
		searchavailspec($allspec, $spec71059)+
		searchavailspec($allspec, $spec71063)+
		searchavailspec($allspec, $spec71074)+
		searchavailspec($allspec, $spec700128)+
		searchavailspec($allspec, $spec700047)+
		searchavailspec($allspec, $spec710128)+
		searchavailspec($allspec, $spec700048)+
		searchavailspec($allspec, $spec700045)+
		searchavailspec($allspec, $spec700046)+
		searchavailspec($allspec, $spec700073)+
		searchavailspec($allspec, $spec700059)+
		searchavailspec($allspec, $spec700039)+
		searchavailspec($allspec, $spec700126)+
		searchavailspec($allspec, $spec700043)+
		searchavailspec($allspec, $spec700096)+
		searchavailspec($allspec, $spec700074)+
		searchavailspec($allspec, $spec700063)+
		searchavailspec($allspec, $spec700044)+
		searchavailspec($allspec, $spec150)+
		searchavailspec($allspec, $spec17700043)+
		searchavailspec($allspec, $spec17700044)+
		searchavailspec($allspec, $spec45)+
		searchavailspec($allspec, $spec39)+
		searchavailspec($allspec, $spec17700046)+
		searchavailspec($allspec, $spec17700048)+
		searchavailspec($allspec, $spec17700047)+
		searchavailspec($allspec, $spec17700059)+
		searchavailspec($allspec, $spec63)+
		searchavailspec($allspec, $spec73)+
		searchavailspec($allspec, $spec96)+
		searchavailspec($allspec, $spec17700074)+
		searchavailspec($allspec, $spec126)+
		searchavailspec($allspec, $spec128)+
		searchavailspec($allspec, $spec278)+
		searchavailspec($allspec, $spec43)+
		searchavailspec($allspec, $spec44)+
		searchavailspec($allspec, $spec46)+
		searchavailspec($allspec, $spec48)+
		searchavailspec($allspec, $spec47)+
		searchavailspec($allspec, $spec59)+
		searchavailspec($allspec, $spec74)+
		searchavailspec($allspec, $spec260)+
		searchavailspec($allspec, $spec261)+
		searchavailspec($allspec, $spec262)+
		searchavailspec($allspec, $spec263))<1)
		{
				echo '<div class="red">Нет ни одного главного инженера</div>';
				}					
			
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';		
				}
		break;		
		
		case $type5829:
		if((searchavailspec($allspec, $spec71043)+
		searchavailspec($allspec, $spec71044)+
		searchavailspec($allspec, $spec71045)+
		searchavailspec($allspec, $spec71039)+
		searchavailspec($allspec, $spec71046)+
		searchavailspec($allspec, $spec71048)+
		searchavailspec($allspec, $spec71047)+
		searchavailspec($allspec, $spec71059)+
		searchavailspec($allspec, $spec71063)+
		searchavailspec($allspec, $spec71074)+
		searchavailspec($allspec, $spec700128)+
		searchavailspec($allspec, $spec700047)+
		searchavailspec($allspec, $spec710128)+
		searchavailspec($allspec, $spec700048)+
		searchavailspec($allspec, $spec700045)+
		searchavailspec($allspec, $spec700046)+
		searchavailspec($allspec, $spec700073)+
		searchavailspec($allspec, $spec700059)+
		searchavailspec($allspec, $spec700039)+
		searchavailspec($allspec, $spec700126)+
		searchavailspec($allspec, $spec700043)+
		searchavailspec($allspec, $spec700096)+
		searchavailspec($allspec, $spec700074)+
		searchavailspec($allspec, $spec700063)+
		searchavailspec($allspec, $spec700044)+
		searchavailspec($allspec, $spec150)+
		searchavailspec($allspec, $spec17700043)+
		searchavailspec($allspec, $spec17700044)+
		searchavailspec($allspec, $spec45)+
		searchavailspec($allspec, $spec39)+
		searchavailspec($allspec, $spec17700046)+
		searchavailspec($allspec, $spec17700048)+
		searchavailspec($allspec, $spec17700047)+
		searchavailspec($allspec, $spec17700059)+
		searchavailspec($allspec, $spec63)+
		searchavailspec($allspec, $spec73)+
		searchavailspec($allspec, $spec96)+
		searchavailspec($allspec, $spec17700074)+
		searchavailspec($allspec, $spec126)+
		searchavailspec($allspec, $spec128)+
		searchavailspec($allspec, $spec278)+
		searchavailspec($allspec, $spec43)+
		searchavailspec($allspec, $spec44)+
		searchavailspec($allspec, $spec46)+
		searchavailspec($allspec, $spec48)+
		searchavailspec($allspec, $spec47)+
		searchavailspec($allspec, $spec59)+
		searchavailspec($allspec, $spec74)+
		searchavailspec($allspec, $spec260)+
		searchavailspec($allspec, $spec261)+
		searchavailspec($allspec, $spec262)+
		searchavailspec($allspec, $spec263))<1)
		{
				echo '<div class="red">Нет ни одного главного инженера</div>';
				}					
			
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';		
				}
		break;
		
		case $type228:
		break;
		
		case $type229:
		case $type5864:
				if((searchavailspec($allspec, $spec140)+searchavailspec($allspec, $spec142)+
				searchavailspec($allspec, $spec700140)+searchavailspec($allspec, $spec700142))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного или ведущего геодезиста</div>';
				}
		break;
		
		case $type230:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type231:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec15)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec16)+searchavailspec($allspec, $spec76)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec78)+
				searchavailspec($allspec, $spec79)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec81)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700216)+searchavailspec($allspec, $spec17700243)+
				searchavailspec($allspec, $spec17700245)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec245)+searchavailspec($allspec, $spec205)+
				searchavailspec($allspec, $spec231)+searchavailspec($allspec, $spec233)+
				searchavailspec($allspec, $spec234)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec215)+
				searchavailspec($allspec, $spec216)+searchavailspec($allspec, $spec243))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type232:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+					
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type233:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type234:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+				
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type235:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type236:
			if((searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+				
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700203)+				
				searchavailspec($allspec, $spec17700223)+								
				searchavailspec($allspec, $spec17700231))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type237:
				if((searchavailspec($allspec, $spec0)+
					searchavailspec($allspec, $spec9)+
					searchavailspec($allspec, $spec11)+
					searchavailspec($allspec, $spec12)+
					searchavailspec($allspec, $spec15)+
					searchavailspec($allspec, $spec18)+
					searchavailspec($allspec, $spec19)+
					searchavailspec($allspec, $spec16)+
					searchavailspec($allspec, $spec41)+
					searchavailspec($allspec, $spec76)+
					searchavailspec($allspec, $spec77)+
					searchavailspec($allspec, $spec78)+
					searchavailspec($allspec, $spec79)+
					searchavailspec($allspec, $spec80)+
					searchavailspec($allspec, $spec81)+
					searchavailspec($allspec, $spec82)+
					searchavailspec($allspec, $spec83)+
					searchavailspec($allspec, $spec194)+
					searchavailspec($allspec, $spec195)+
					searchavailspec($allspec, $spec196)+
					searchavailspec($allspec, $spec198)+
					searchavailspec($allspec, $spec199)+
					searchavailspec($allspec, $spec203)+
					searchavailspec($allspec, $spec205)+
					searchavailspec($allspec, $spec206)+
					searchavailspec($allspec, $spec208)+
					searchavailspec($allspec, $spec215)+
					searchavailspec($allspec, $spec216)+
					searchavailspec($allspec, $spec222)+
					searchavailspec($allspec, $spec223)+
					searchavailspec($allspec, $spec224)+
					searchavailspec($allspec, $spec226)+
					searchavailspec($allspec, $spec227)+
					searchavailspec($allspec, $spec231)+
					searchavailspec($allspec, $spec233)+
					searchavailspec($allspec, $spec234)+
					searchavailspec($allspec, $spec236)+
					searchavailspec($allspec, $spec243)+
					searchavailspec($allspec, $spec245)+
					searchavailspec($allspec, $spec17700195)+
					searchavailspec($allspec, $spec17700199)+
					searchavailspec($allspec, $spec17700203)+
					searchavailspec($allspec, $spec17700205)+
					searchavailspec($allspec, $spec17700209)+
					searchavailspec($allspec, $spec17700215)+
					searchavailspec($allspec, $spec17700216)+
					searchavailspec($allspec, $spec17700223)+
					searchavailspec($allspec, $spec17700231)+
					searchavailspec($allspec, $spec17700233)+
					searchavailspec($allspec, $spec17700234)+
					searchavailspec($allspec, $spec17700237)+
					searchavailspec($allspec, $spec17700243)+
					searchavailspec($allspec, $spec17700245))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type238:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;			
		
case $type239:
				if((searchavailspec($allspec, $spec9)+
					searchavailspec($allspec, $spec18)+
					searchavailspec($allspec, $spec19)+
					searchavailspec($allspec, $spec41)+
					searchavailspec($allspec, $spec82)+
					searchavailspec($allspec, $spec83)+
					searchavailspec($allspec, $spec194)+
					searchavailspec($allspec, $spec195)+
					searchavailspec($allspec, $spec196)+
					searchavailspec($allspec, $spec198)+
					searchavailspec($allspec, $spec199)+
					searchavailspec($allspec, $spec209)+
					searchavailspec($allspec, $spec222)+
					searchavailspec($allspec, $spec223)+
					searchavailspec($allspec, $spec224)+
					searchavailspec($allspec, $spec226)+
					searchavailspec($allspec, $spec227)+
					searchavailspec($allspec, $spec237)+
					searchavailspec($allspec, $spec17700195)+
					searchavailspec($allspec, $spec17700199)+
					searchavailspec($allspec, $spec17700209)+
					searchavailspec($allspec, $spec17700223)+
					searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type240:
		case $type5869:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec267)+searchavailspec($allspec, $spec271))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type241:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type242:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type243:
		case $type5872:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type244:
		case $type5873:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
				
		case $type245:
		case $type5874:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec76)+searchavailspec($allspec, $spec77)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec17700195)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700197)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec17700203)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec197)+searchavailspec($allspec, $spec225)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec205)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec233)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type246:
		case $type5875:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type247:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type248:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec110)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700211)+searchavailspec($allspec, $spec17700239)+
				searchavailspec($allspec, $spec211)+searchavailspec($allspec, $spec239)+				
				searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type249:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type250:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type251:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type252:
				if((searchavailspec($allspec, $spec11)+
					searchavailspec($allspec, $spec76)+
					searchavailspec($allspec, $spec203)+
					searchavailspec($allspec, $spec205)+
					searchavailspec($allspec, $spec212)+
					searchavailspec($allspec, $spec231)+
					searchavailspec($allspec, $spec233)+
					searchavailspec($allspec, $spec235)+
					searchavailspec($allspec, $spec17700203)+
					searchavailspec($allspec, $spec17700205)+
					searchavailspec($allspec, $spec17700231)+
					searchavailspec($allspec, $spec17700233))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}	
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;		

		case $type253:
				if((searchavailspec($allspec, $spec11)+
					searchavailspec($allspec, $spec77)+
					searchavailspec($allspec, $spec203)+
					searchavailspec($allspec, $spec204)+
					searchavailspec($allspec, $spec231)+
					searchavailspec($allspec, $spec232)+
					searchavailspec($allspec, $spec17700203)+
					searchavailspec($allspec, $spec17700204)+
					searchavailspec($allspec, $spec17700231)+
					searchavailspec($allspec, $spec17700232))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
			else if ((searchavailspec($allspec, $spec62)+
					  searchavailspec($allspec, $spec240)+
					  searchavailspec($allspec, $spec212))<1)	
			{
				echo '<div class="red">Нет прораба(мастера) по установке приборов учета тепло- и водопотребления</div>';
				}	
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;
		
		case $type254:
				if((searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec234))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}	
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;		
		
		case $type255:
				if((searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec207)+searchavailspec($allspec, $spec234))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))<1)	
			{
				echo '<div class="red">Нет прораба(мастера) по установке приборов учета тепло- и водопотребления</div>';
				}	
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;		
		
		case $type256:
		case $type5885:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec17700216)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700245)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec245)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec216))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;

		case $type257:
		case $type5886:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec81)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700246)+
				searchavailspec($allspec, $spec17700217)+searchavailspec($allspec, $spec17700215)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec217)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec246))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type258:
		break;		
		
		case $type259:
				if((searchavailspec($allspec, $spec13)+searchavailspec($allspec, $spec193)+searchavailspec($allspec, $spec221))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type260:
		case $type5888:
				if((searchavailspec($allspec, $spec0)+searchavailspec($allspec, $spec16)+
				searchavailspec($allspec, $spec218)+searchavailspec($allspec, $spec244))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type261:
				if((searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec206)+searchavailspec($allspec, $spec207)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec234))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type262:
				if((searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec222))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type263:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type264:
		case $type5892:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type265:
				if((searchavailspec($allspec, $spec710112)+searchavailspec($allspec, $spec112)+
				searchavailspec($allspec, $spec20112)+searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec220))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;			
		
		case $type266:
				if((searchavailspec($allspec, $spec82)+searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec224))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;			
		
		case $type267:
				if((searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700237)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type268:
		case $type269:
		break;		

		case $type270:
						if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)
					+searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type271:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

				case $type5753:
		if((searchavailspec($allspec, $spec700093)+searchavailspec($allspec, $spec700135)+
				searchavailspec($allspec, $spec800135)+searchavailspec($allspec, $spec93)+
				searchavailspec($allspec, $spec17700135))>=2){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		}
		}		
		}
	else {
	        for ($i = 0; $i <= count($types_of_jobs[$k]->field_field_vidy_rabot_13_05_2017_); $i++) 
		{ 
			$types_of_jobs2=$types_of_jobs[$k]->field_field_vidy_rabot_13_05_2017_[$i][raw];
			$types_of_jobs3=$types_of_jobs2[taxonomy_term]->name;
			$vidyrabot[$k][$i]=$types_of_jobs3;
			print_r ("</br>".$types_of_jobs3."</br>");
			
			
			
				switch ($types_of_jobs3) {
		case $type5594:
		case $type5907:
		break;
		
		case $type5595:
		case $type5908:
		if((searchavailspec($allspec, $spec700166)+searchavailspec($allspec, $spec166)+searchavailspec($allspec, $spec173))>=2){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-геодезические изыскания меньше 2</div>';
				}
		break;
	
		case $type5616:
		case $type5909:
			if((searchavailspec($allspec, $spec700167)+searchavailspec($allspec, $spec167)+searchavailspec($allspec, $spec174))>=2){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-геологические изыскания меньше 2</div>';
				}
		break;
	
		case $type5625:
		case $type5910:
			if((searchavailspec($allspec, $spec700168)+searchavailspec($allspec, $spec168))>=2){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-гидрометеорологические изыскания меньше 2</div>';
				}
		break;	
	
		case $type5630:
			if((searchavailspec($allspec, $spec700169)+searchavailspec($allspec, $spec169))>=2){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-экологические изыскания меньше 2</div>';
				}
		break;
	
		case $type5647:
			if((searchavailspec($allspec, $spec700170)+searchavailspec($allspec, $spec170))>=2){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих инженерно-геотехнические изыскания меньше 2</div>';
				}
		break;
		
		case $type5648:
		case $type5649:
		case $type5650:
		case $type5651:
		case $type5652:
		case $type5653:
		break;
		
		case $type5654:
			if((searchavailspec($allspec, $spec171)+searchavailspec($allspec, $spec171))>=2){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов, осуществляющих обследование состояния грунтов оснований зданий и сооружений меньше 2</div>';
				}
		break;
		
		case $type5655:
			if((searchavailspec($allspec, $spec700064)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3))>=1 or 
			(searchavailspec($allspec, $spec4)+searchavailspec($allspec, $spec700129)+searchavailspec($allspec, $spec700004)+searchavailspec($allspec, $spec148)+searchavailspec($allspec, $spec17700129)+searchavailspec($allspec, $spec129)+searchavailspec($allspec, $spec275))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного специалиста ГАП или ГИП</div>';
				}
		break;
					
		case $type5656:
		case $type5911:
			if	((
					searchavailspec($allspec, $spec3)+
					searchavailspec($allspec, $spec64)+
					searchavailspec($allspec, $spec700064))<1
					and (
					searchavailspec($allspec, $spec4)+
					searchavailspec($allspec, $spec129)+
					searchavailspec($allspec, $spec148)+
					searchavailspec($allspec, $spec275)+
					searchavailspec($allspec, $spec700004)+
					searchavailspec($allspec, $spec17700129))<1)
             {
				echo '<div class="red">Нет ни одного ГАПа или ГИПа</div>';
				}
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;
		
		case $type5657:
        case $type5912:
		break;
		
		case $type5658:
		case $type5913:
			if((searchavailspec($allspec, $spec700163)+searchavailspec($allspec, $spec163))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (генеральный план)</div>';
				}
		break;		
			
		case $type5659:
		case $type5914:
			if((searchavailspec($allspec, $spec252)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3)+searchavailspec($allspec, $spec700064))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (архитектурные решения) либо ГАПа</div>';
				}
		break;		
				
		case $type5660:
		case $type5915:
			if(searchavailspec($allspec, $spec139)+
			   searchavailspec($allspec, $spec700139)>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (сметная документация)</div>';
				}
		break;		
		
		case $type5661:
		case $type5916:
		if((searchavailspec($allspec, $spec66)+searchavailspec($allspec, $spec17700066)+searchavailspec($allspec, $spec700066))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (конструктивные решения)</div>';
				}			
		break;		
		
		case $type5662:
		case $type5917:
		break;
		
		case $type5664:
		case $type5919:
			if((searchavailspec($allspec, $spec17700071)+searchavailspec($allspec, $spec700071)+searchavailspec($allspec, $spec71))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (холодоснабжение))</div>';
				}
		break;		
				
		case $type5665:
		case $type5920:
			if((searchavailspec($allspec, $spec17700067)+searchavailspec($allspec, $spec700067)+searchavailspec($allspec, $spec67))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</div>';
				}
		break;		
		
		case $type5666:
		case $type5921:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</div>';
				}
		break;
				
		case $type5667:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</div>';
				}
		break;		
		
		case $type5663:
		case $type5918:
			if((searchavailspec($allspec, $spec17700068)+searchavailspec($allspec, $spec700068)+searchavailspec($allspec, $spec68))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (отопление, вентиляция и кондиционирование воздуха))</div>';
				}
		break;		
				
		case $type5668:
		case $type5922:
			if((searchavailspec($allspec, $spec17700099)+searchavailspec($allspec, $spec700099)+searchavailspec($allspec, $spec99))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</div>';
				}
		break;				
				
		case $type5669:
		case $type5923:
			if((searchavailspec($allspec, $spec17700069)+searchavailspec($allspec, $spec700069)+searchavailspec($allspec, $spec69))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</div>';
				}
		break;
		
		case $type5670:
		case $type5924:
		break;
		
		case $type5671:
		case $type5925:
			if((searchavailspec($allspec, $spec17700070)+searchavailspec($allspec, $spec700070)+searchavailspec($allspec, $spec70))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (тепловые сети))</div>';
				}
		break;		
			
		case $type5672:
		case $type5926:
			if((searchavailspec($allspec, $spec67)+
				searchavailspec($allspec, $spec700067)+
				searchavailspec($allspec, $spec17700067))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</div>';
				}
		break;		
		
		case $type5673:
		case $type5927:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</div>';
				}
		break;		
		
		case $type5674:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</div>';
				}
		break;
		
		case $type5675:
		case $type5928:
			if((searchavailspec($allspec, $spec17700069)+searchavailspec($allspec, $spec700069)+searchavailspec($allspec, $spec69))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</div>';
				}
		break;		
			
		case $type5676: 
		break;
		
		case $type5677:
		case $type5929:
			if(searchavailspec($allspec, $spec249)>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (охрана окружающей среды)</div>';
				}
		break;
		
		case $type5678:
			if((searchavailspec($allspec, $spec700164)+searchavailspec($allspec, $spec164))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (организация строительства)</div>';
				}
		break;		
		
		case $type5679:
		case $type5930:
			if(searchavailspec($allspec, $spec248)>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного специалиста, осуществляющего разработку раздела проектной документации (охрана окружающей среды)</div>';
				}
		break;
		
		case $type5680:
		case $type5681:
		case $type5931:
		case $type5932:
		break;
		
		case $type5682:
		case $type5933:
			$count=0;
			$count=countoverzero(searchavailspec($allspec, $spec24),$count);
			$count=countoverzero(searchavailspec($allspec, $spec26),$count);
			$count=countoverzero(searchavailspec($allspec, $spec30),$count);
			$count=countoverzero(searchavailspec($allspec, $spec33),$count);
			$count=countoverzero(searchavailspec($allspec, $spec34),$count);
			$count=countoverzero(searchavailspec($allspec, $spec57),$count);
			$count=countoverzero(searchavailspec($allspec, $spec61),$count);
			$count=countoverzero(searchavailspec($allspec, $spec84),$count);
			$count=countoverzero(searchavailspec($allspec, $spec85),$count);
			$count=countoverzero(searchavailspec($allspec, $spec95),$count);
			$count=countoverzero(searchavailspec($allspec, $spec97),$count);
			$count=countoverzero(searchavailspec($allspec, $spec113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec144),$count);
			$count=countoverzero(searchavailspec($allspec, $spec145),$count);
			$count=countoverzero(searchavailspec($allspec, $spec146),$count);
			$count=countoverzero(searchavailspec($allspec, $spec276),$count);
			$count=countoverzero(searchavailspec($allspec, $spec277),$count);
			$count=countoverzero(searchavailspec($allspec, $spec20113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700024),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700026),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700030),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700033),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700034),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700057),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700061),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700084),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700085),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700095),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700097),$count);
			$count=countoverzero(searchavailspec($allspec, $spec700113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec710113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700024),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700026),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700030),$count);			
			$count=countoverzero(searchavailspec($allspec, $spec17700033),$count);							
			$count=countoverzero(searchavailspec($allspec, $spec17700084),$count);	
			$count=countoverzero(searchavailspec($allspec, $spec17700085),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700061),$count);
			$count=countoverzero(searchavailspec($allspec, $spec17700097),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700024),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700026),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700030),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700033),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700034),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700057),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700061),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700084),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700085),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700095),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700097),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700113),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700276),$count);
			$count=countoverzero(searchavailspec($allspec, $spec18700277),$count);
			
		if((searchavailspec($allspec, $spec40)+searchavailspec($allspec, $spec700187)+searchavailspec($allspec, $spec188)+searchavailspec($allspec, $spec189)+
		searchavailspec($allspec, $spec18700187)+
		searchavailspec($allspec, $spec187))<1)
		{
				echo '<div class="red">Нет ни одного руководителя проекта</div>';
				}								
			else {
			echo '<div class="green">Руководитель проекта есть</div>';		
				}
			if	($count<2)
				{
				echo '<div class="red">Количество специалистов по техническому надзору меньше 2</div>';
				}		
			else {
				echo '<div class="green">Количество специалистов по техническому надзору 2 или больше</div>';
				}		
		break;
		
		case $type5683:
		case $type5934:
		if((searchavailspec($allspec, $spec700024)+
		searchavailspec($allspec, $spec144)+
		searchavailspec($allspec, $spec145)+
		searchavailspec($allspec, $spec146)+
		searchavailspec($allspec, $spec24)+
		searchavailspec($allspec, $spec18700024)+
		searchavailspec($allspec, $spec17700024))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (общестроительные работы)</div>';
				}
		break;		
		
		case $type5684:
		case $type5935:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec18700026)+
		searchavailspec($allspec, $spec17700026))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</div>';
				}
		break;		
		
		case $type5685:
		case $type5936:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec18700026)+
		searchavailspec($allspec, $spec17700026))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</div>';
				}
		break;		
		
		case $type5686:
		case $type5937:
		if((searchavailspec($allspec, $spec277)+
		searchavailspec($allspec, $spec18700277))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (устройство систем холодоснабжения)</div>';
				}
		break;			
		
		case $type5687:
		case $type5938:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec17700026)+
		searchavailspec($allspec, $spec18700026)+
		searchavailspec($allspec, $spec95)+
		searchavailspec($allspec, $spec18700095)+
		searchavailspec($allspec, $spec700095))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</div>';
				}
		break;		
		
		case $type5688:
		case $type5939:
		if((searchavailspec($allspec, $spec700057)+
		searchavailspec($allspec, $spec18700057)+
		searchavailspec($allspec, $spec57))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области газоснабжения)</div>';
				}
		break;
		
		case $type5689:
		case $type5940:
		if((searchavailspec($allspec, $spec700030)+
		searchavailspec($allspec, $spec30)+
		searchavailspec($allspec, $spec18700030)+
		searchavailspec($allspec, $spec17700030))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области электроснабжения и автоматизации)</div>';
				}
		break;	
				
		case $type5690:
		case $type5941:
		if((searchavailspec($allspec, $spec700097)+
		searchavailspec($allspec, $spec97)+
		searchavailspec($allspec, $spec18700097)+
		searchavailspec($allspec, $spec17700097))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (работы в области связи, сигнализации)</div>';
				}
		break;	
		
		case $type5691:
		case $type5942:
		if((searchavailspec($allspec, $spec700033)+
		searchavailspec($allspec, $spec33)+
		searchavailspec($allspec, $spec18700033)+
		searchavailspec($allspec, $spec17700033))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (строительство автомобильных дорог и аэродромов, строительство мостов, транспортных эстакад и путепроводов)</div>';
				}
		break;		
		
		case $type5692:
		case $type5943:
		if((searchavailspec($allspec, $spec700084)+
		searchavailspec($allspec, $spec84)+
		searchavailspec($allspec, $spec18700084)+
		searchavailspec($allspec, $spec17700084))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (строительство железных дорог)</div>';
				}
		break;		
		
		case $type5693:
		case $type5944:
		if((searchavailspec($allspec, $spec700085)+
		searchavailspec($allspec, $spec85)+
		searchavailspec($allspec, $spec18700085)+
		searchavailspec($allspec, $spec17700085))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (строительство сооружений транспортных тоннелей, метрополитенов)</div>';
				}
		break;	
		
		case $type5694:
		case $type5945:
		if((searchavailspec($allspec, $spec700034)+
		searchavailspec($allspec, $spec18700034)+
		searchavailspec($allspec, $spec34))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (гидротехническое и мелиоративное строительство)</div>';
				}
		break;	
		
		case $type5695:
		if((searchavailspec($allspec, $spec710113)+
		searchavailspec($allspec, $spec20113)+
		searchavailspec($allspec, $spec700113)+
		searchavailspec($allspec, $spec18700113)+
		searchavailspec($allspec, $spec113))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (благоустройство территорий)</div>';
				}
		break;		
		
		case $type5696:
		case $type5946:
		if((searchavailspec($allspec, $spec276)+
		searchavailspec($allspec, $spec18700276))>0){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (монтаж технологических трубопроводов и оборудования)</div>';
				}
		break;		

		case $type5697:
		case $type5947:
		if((searchavailspec($allspec, $spec700061)+
		searchavailspec($allspec, $spec17700061)+
		searchavailspec($allspec, $spec18700061)+
		searchavailspec($allspec, $spec61))>0 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного инженера по техническому надзору за строительством (устройство магистральных трубопроводов для транспортирования нефти, газа, нефтепродуктов)</div>';
				}
		break;
		
		case $type5698:
		case $type5948:
		if((searchavailspec($allspec, $spec700064)+
		searchavailspec($allspec, $spec3)+
		searchavailspec($allspec, $spec64))>=1 ){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Количество специалистов ГАП меньше 1</div>';
				}
		break;		
		
		case $type5699:
		case $type5700:
		case $type5701:
		case $type5702:
		case $type5703:
		case $type5704:
		case $type5705:
		case $type5949:
		case $type5950:
		case $type5951:
		case $type5952:
		case $type5953:
		case $type5954:
		break;
		
		case $type5706:
		case $type5955:
		if((searchavailspec($allspec, $spec71043)+
		searchavailspec($allspec, $spec71044)+
		searchavailspec($allspec, $spec71045)+
		searchavailspec($allspec, $spec71039)+
		searchavailspec($allspec, $spec71046)+
		searchavailspec($allspec, $spec71048)+
		searchavailspec($allspec, $spec71047)+
		searchavailspec($allspec, $spec71059)+
		searchavailspec($allspec, $spec71063)+
		searchavailspec($allspec, $spec71074)+
		searchavailspec($allspec, $spec700128)+
		searchavailspec($allspec, $spec700047)+
		searchavailspec($allspec, $spec710128)+
		searchavailspec($allspec, $spec700048)+
		searchavailspec($allspec, $spec700045)+
		searchavailspec($allspec, $spec700046)+
		searchavailspec($allspec, $spec700073)+
		searchavailspec($allspec, $spec700059)+
		searchavailspec($allspec, $spec700039)+
		searchavailspec($allspec, $spec700126)+
		searchavailspec($allspec, $spec700043)+
		searchavailspec($allspec, $spec700096)+
		searchavailspec($allspec, $spec700074)+
		searchavailspec($allspec, $spec700063)+
		searchavailspec($allspec, $spec700044)+
		searchavailspec($allspec, $spec150)+
		searchavailspec($allspec, $spec17700043)+
		searchavailspec($allspec, $spec17700044)+
		searchavailspec($allspec, $spec45)+
		searchavailspec($allspec, $spec39)+
		searchavailspec($allspec, $spec17700046)+
		searchavailspec($allspec, $spec17700048)+
		searchavailspec($allspec, $spec17700047)+
		searchavailspec($allspec, $spec17700059)+
		searchavailspec($allspec, $spec63)+
		searchavailspec($allspec, $spec73)+
		searchavailspec($allspec, $spec96)+
		searchavailspec($allspec, $spec17700074)+
		searchavailspec($allspec, $spec126)+
		searchavailspec($allspec, $spec128)+
		searchavailspec($allspec, $spec278)+
		searchavailspec($allspec, $spec43)+
		searchavailspec($allspec, $spec44)+
		searchavailspec($allspec, $spec46)+
		searchavailspec($allspec, $spec48)+
		searchavailspec($allspec, $spec47)+
		searchavailspec($allspec, $spec59)+
		searchavailspec($allspec, $spec74)+
		searchavailspec($allspec, $spec260)+
		searchavailspec($allspec, $spec261)+
		searchavailspec($allspec, $spec262)+
		searchavailspec($allspec, $spec263))<1)
		{
				echo '<div class="red">Нет ни одного главного инженера</div>';
				}					
			
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';		
				}
		break;		
		
		case $type5707:
		case $type5956:
		if((searchavailspec($allspec, $spec71043)+
		searchavailspec($allspec, $spec71044)+
		searchavailspec($allspec, $spec71045)+
		searchavailspec($allspec, $spec71039)+
		searchavailspec($allspec, $spec71046)+
		searchavailspec($allspec, $spec71048)+
		searchavailspec($allspec, $spec71047)+
		searchavailspec($allspec, $spec71059)+
		searchavailspec($allspec, $spec71063)+
		searchavailspec($allspec, $spec71074)+
		searchavailspec($allspec, $spec700128)+
		searchavailspec($allspec, $spec700047)+
		searchavailspec($allspec, $spec710128)+
		searchavailspec($allspec, $spec700048)+
		searchavailspec($allspec, $spec700045)+
		searchavailspec($allspec, $spec700046)+
		searchavailspec($allspec, $spec700073)+
		searchavailspec($allspec, $spec700059)+
		searchavailspec($allspec, $spec700039)+
		searchavailspec($allspec, $spec700126)+
		searchavailspec($allspec, $spec700043)+
		searchavailspec($allspec, $spec700096)+
		searchavailspec($allspec, $spec700074)+
		searchavailspec($allspec, $spec700063)+
		searchavailspec($allspec, $spec700044)+
		searchavailspec($allspec, $spec150)+
		searchavailspec($allspec, $spec17700043)+
		searchavailspec($allspec, $spec17700044)+
		searchavailspec($allspec, $spec45)+
		searchavailspec($allspec, $spec39)+
		searchavailspec($allspec, $spec17700046)+
		searchavailspec($allspec, $spec17700048)+
		searchavailspec($allspec, $spec17700047)+
		searchavailspec($allspec, $spec17700059)+
		searchavailspec($allspec, $spec63)+
		searchavailspec($allspec, $spec73)+
		searchavailspec($allspec, $spec96)+
		searchavailspec($allspec, $spec17700074)+
		searchavailspec($allspec, $spec126)+
		searchavailspec($allspec, $spec128)+
		searchavailspec($allspec, $spec278)+
		searchavailspec($allspec, $spec43)+
		searchavailspec($allspec, $spec44)+
		searchavailspec($allspec, $spec46)+
		searchavailspec($allspec, $spec48)+
		searchavailspec($allspec, $spec47)+
		searchavailspec($allspec, $spec59)+
		searchavailspec($allspec, $spec74)+
		searchavailspec($allspec, $spec260)+
		searchavailspec($allspec, $spec261)+
		searchavailspec($allspec, $spec262)+
		searchavailspec($allspec, $spec263))<1)
		{
				echo '<div class="red">Нет ни одного главного инженера</div>';
				}					
			
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';		
				}
		break;
		
		case $type5708:
		case $type5957:
		break;
			
		case $type5709:
		case $type5958:
				if((searchavailspec($allspec, $spec140)+searchavailspec($allspec, $spec142)+
				searchavailspec($allspec, $spec700140)+searchavailspec($allspec, $spec700142))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет ни одного главного или ведущего геодезиста</div>';
				}
		break;		
		
		case $type5710:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5711:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec15)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec16)+searchavailspec($allspec, $spec76)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec78)+
				searchavailspec($allspec, $spec79)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec81)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700216)+searchavailspec($allspec, $spec17700243)+
				searchavailspec($allspec, $spec17700245)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec245)+searchavailspec($allspec, $spec205)+
				searchavailspec($allspec, $spec231)+searchavailspec($allspec, $spec233)+
				searchavailspec($allspec, $spec234)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec215)+
				searchavailspec($allspec, $spec216)+searchavailspec($allspec, $spec243))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5712:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+					
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5713:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;

		case $type5714:
		case $type5959:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+				
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5715:
		case $type5960:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5716:
			if((searchavailspec($allspec, $spec270)+
				searchavailspec($allspec, $spec274))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5717:
				if((searchavailspec($allspec, $spec0)+
					searchavailspec($allspec, $spec9)+
					searchavailspec($allspec, $spec11)+
					searchavailspec($allspec, $spec12)+
					searchavailspec($allspec, $spec15)+
					searchavailspec($allspec, $spec18)+
					searchavailspec($allspec, $spec19)+
					searchavailspec($allspec, $spec16)+
					searchavailspec($allspec, $spec41)+
					searchavailspec($allspec, $spec76)+
					searchavailspec($allspec, $spec77)+
					searchavailspec($allspec, $spec78)+
					searchavailspec($allspec, $spec79)+
					searchavailspec($allspec, $spec80)+
					searchavailspec($allspec, $spec81)+
					searchavailspec($allspec, $spec82)+
					searchavailspec($allspec, $spec83)+
					searchavailspec($allspec, $spec194)+
					searchavailspec($allspec, $spec195)+
					searchavailspec($allspec, $spec196)+
					searchavailspec($allspec, $spec198)+
					searchavailspec($allspec, $spec199)+
					searchavailspec($allspec, $spec203)+
					searchavailspec($allspec, $spec205)+
					searchavailspec($allspec, $spec206)+
					searchavailspec($allspec, $spec208)+
					searchavailspec($allspec, $spec215)+
					searchavailspec($allspec, $spec216)+
					searchavailspec($allspec, $spec222)+
					searchavailspec($allspec, $spec223)+
					searchavailspec($allspec, $spec224)+
					searchavailspec($allspec, $spec226)+
					searchavailspec($allspec, $spec227)+
					searchavailspec($allspec, $spec231)+
					searchavailspec($allspec, $spec233)+
					searchavailspec($allspec, $spec234)+
					searchavailspec($allspec, $spec236)+
					searchavailspec($allspec, $spec243)+
					searchavailspec($allspec, $spec245)+
					searchavailspec($allspec, $spec17700195)+
					searchavailspec($allspec, $spec17700199)+
					searchavailspec($allspec, $spec17700203)+
					searchavailspec($allspec, $spec17700205)+
					searchavailspec($allspec, $spec17700209)+
					searchavailspec($allspec, $spec17700215)+
					searchavailspec($allspec, $spec17700216)+
					searchavailspec($allspec, $spec17700223)+
					searchavailspec($allspec, $spec17700231)+
					searchavailspec($allspec, $spec17700233)+
					searchavailspec($allspec, $spec17700234)+
					searchavailspec($allspec, $spec17700237)+
					searchavailspec($allspec, $spec17700243)+
					searchavailspec($allspec, $spec17700245))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type5718:
		case $type5961:
			if((searchavailspec($allspec, $spec9)+
				searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700209)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5719:
		case $type5962:
				if((searchavailspec($allspec, $spec9)+
					searchavailspec($allspec, $spec18)+
					searchavailspec($allspec, $spec19)+
					searchavailspec($allspec, $spec41)+
					searchavailspec($allspec, $spec82)+
					searchavailspec($allspec, $spec83)+
					searchavailspec($allspec, $spec194)+
					searchavailspec($allspec, $spec195)+
					searchavailspec($allspec, $spec196)+
					searchavailspec($allspec, $spec198)+
					searchavailspec($allspec, $spec199)+
					searchavailspec($allspec, $spec209)+
					searchavailspec($allspec, $spec222)+
					searchavailspec($allspec, $spec223)+
					searchavailspec($allspec, $spec224)+
					searchavailspec($allspec, $spec226)+
					searchavailspec($allspec, $spec227)+
					searchavailspec($allspec, $spec237)+
					searchavailspec($allspec, $spec17700195)+
					searchavailspec($allspec, $spec17700199)+
					searchavailspec($allspec, $spec17700209)+
					searchavailspec($allspec, $spec17700223)+
					searchavailspec($allspec, $spec17700237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5720:
		case $type5963:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec267)+searchavailspec($allspec, $spec271))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5721:
		case $type5964:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5722:
		case $type5965:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5723:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;			
		
		case $type5724:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
				
		case $type5725:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec76)+searchavailspec($allspec, $spec77)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec17700195)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700197)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec17700203)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec197)+searchavailspec($allspec, $spec225)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec205)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec233)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5726:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5727:
		case $type5966:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;			
		
		case $type5728:
		case $type5967:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec110)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700211)+searchavailspec($allspec, $spec17700239)+
				searchavailspec($allspec, $spec211)+searchavailspec($allspec, $spec239)+				
				searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;			
		
		case $type5729:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type5730:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;			
		
		case $type5731:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5732:
		case $type5968:
				if((searchavailspec($allspec, $spec11)+
					searchavailspec($allspec, $spec76)+
					searchavailspec($allspec, $spec203)+
					searchavailspec($allspec, $spec205)+
					searchavailspec($allspec, $spec212)+
					searchavailspec($allspec, $spec231)+
					searchavailspec($allspec, $spec233)+
					searchavailspec($allspec, $spec235)+
					searchavailspec($allspec, $spec17700203)+
					searchavailspec($allspec, $spec17700205)+
					searchavailspec($allspec, $spec17700231)+
					searchavailspec($allspec, $spec17700233))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}	
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;

		case $type5733:
		case $type5969:
				if((searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec17700204)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700232)+
				searchavailspec($allspec, $spec204)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec232))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))<1)	
			{
				echo '<div class="red">Нет прораба(мастера) по установке приборов учета тепло- и водопотребления</div>';
				}	
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;
		
		case $type5734:
		case $type5970:
				if((searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec234))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;			

		case $type5735:
		case $type5971:
				if((searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec207)+searchavailspec($allspec, $spec234))<1){
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))<1)	
			{
				echo '<div class="red">Нет прораба(мастера) по установке приборов учета тепло- и водопотребления</div>';
				}	
			else {
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
		break;		
		
		case $type5736:
		case $type5972:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec17700216)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700245)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec245)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec216))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5737:
		case $type5973:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec81)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700246)+
				searchavailspec($allspec, $spec17700217)+searchavailspec($allspec, $spec17700215)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec217)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec246))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5738:
		case $type5974:
				if((searchavailspec($allspec, $spec13)+searchavailspec($allspec, $spec193)+
				searchavailspec($allspec, $spec221))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type5739:
				if((searchavailspec($allspec, $spec0)+searchavailspec($allspec, $spec16)+
				searchavailspec($allspec, $spec218)+searchavailspec($allspec, $spec244))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;	
		
		case $type5740:
		case $type5975:
				if((searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec206)+searchavailspec($allspec, $spec207)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec234))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5741:
		case $type5976:
				if((searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226)+searchavailspec($allspec, $spec226))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5742:
		case $type5977:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5743:
		case $type5978:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		
		
		case $type5744:
				if((searchavailspec($allspec, $spec710112)+searchavailspec($allspec, $spec112)+
				searchavailspec($allspec, $spec20112)+searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec220))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5745:
		case $type5979:
				if((searchavailspec($allspec, $spec82)+searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec224))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
				
		case $type5746:
		case $type5980:
				if((searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700237)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5747:
		case $type5981:		
				if((searchavailspec($allspec, $spec269)+searchavailspec($allspec, $spec273))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type5748:	
		case $type5982:
				if((searchavailspec($allspec, $spec17)+searchavailspec($allspec, $spec214)
					+searchavailspec($allspec, $spec242))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5749:
						if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)
					+searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;
		
		case $type5750:
		case $type5983:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;		

		case $type5751:
		case $type5984:
				if((searchavailspec($allspec, $spec268)+searchavailspec($allspec, $spec272))>=1){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
				echo '<div class="red">Нет аттестованных специалистов</div>';
				}
		break;	
		
		case $type5752:
		case $type5985:
		break;
		
		case $type5901:
		case $type5986:
				if((searchavailspec($allspec, $spec700093)+searchavailspec($allspec, $spec700135)+
				searchavailspec($allspec, $spec800135)+
				searchavailspec($allspec, $spec93)+searchavailspec($allspec, $spec17700135))>=2){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
				else {
				echo '<div class="red">Не достаточно аттестованных специалистов</div>';
				}
		break;		
		
		case $type5903:
		case $type5987:
				if(searchavailspec($allspec, $spec250)>=2){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
				else {
				echo '<div class="red">Не достаточно специалистов, осуществляющих обследование автомобильных дорог и мостовых сооружений</div>';
				}
		break;
			
        case $type5902:
			if((searchavailspec($allspec, $spec253)+
				searchavailspec($allspec, $spec254)+
				searchavailspec($allspec, $spec255)+
				searchavailspec($allspec, $spec256)+
				searchavailspec($allspec, $spec257)+
				searchavailspec($allspec, $spec258)+
				searchavailspec($allspec, $spec259))>=2){
			echo '<div class="green">СООТВЕТСТВУЕТ</div>';
				}
			else {
			echo '<div class="red">Не достаточно аттестованных специалистов</div>';
				}
		break;		
		}	
		} 
}		
    break;
}print_r ("<hr>");
} 
?>