<?php 
// добавление видов работ до 13.05.2017 в переменные//
$type163="1. Инженерные изыскания для объектов строительства первого-четвертого классов сложности";
$type164="1.1. работы в составе инженерно-геодезических изысканий";
$type165="1.2. работы в составе инженерно-геологических изысканий";
$type166="1.3. работы в составе инженерно-гидрометеорологических изысканий";
$type167="1.4. работы в составе инженерно-экологических изысканий";
$type168="1.5. работы в составе инженерно-геотехнических изысканий";
$type169="1.6. обследование состояния грунтов оснований зданий и сооружений";
$type170="2. Разработка предпроектной (предынвестиционной) документации";
$type171="3. Выполнение функций генерального проектировщика";
$type196="4. Разработка разделов проектной документации для объектов строительства первого-четвертого классов сложности";
$type197="4.1. генеральный план и транспорт";
$type198="4.2. архитектурные решения";
$type199="4.3. сметная документация";
$type200="4.4. строительные решения";
$type543="4.5. внутреннее инженерное оборудование, внутренние сети и системы:";
$type5434="теплоснабжения";
$type5435="холодоснабжения";
$type5436="водоснабжения";
$type5437="газоснабжения";
$type5438="канализации";
$type5439="отопления";
$type5440="вентиляции и кондиционирования воздуха";
$type5441="электроснабжения";
$type5442="электрооборудования";
$type5443="электроосвещения";
$type5444="связи";
$type5453="радиофикации";
$type5454="телевидения";
$type5445="4.6. наружные сети и системы:";
$type5446="теплоснабжения";
$type5447="водоснабжения";
$type5448="газоснабжения";
$type5449="канализации";
$type5450="электроснабжения";
$type5451="связи";
$type5455="радиофикации";
$type5456="телевидения";
$type202="4.7. технологические решения";
$type5457="4.8.:";
$type5458="охрана окружающей среды";
$type5459="инженерно-технические мероприятия гражданской обороны";
$type5460="мероприятия по предупреждению чрезвычайных ситуаций";
$type5461="мероприятия по обеспечению пожарной безопасности";
$type5462="организация строительства";
$type205="5. Выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов первого-четвертого классов сложности";
$type206="5.1. выполнение функций заказчика, застройщика, оказание отдельных видов инженерных услуг в строительстве";
$type207="5.2. выполнение функций заказчика, застройщика, оказание инженерных услуг по комплексному управлению строительной деятельностью";
$type208="5.3. технический надзор за общестроительными работами";
$type209="5.4. технический надзор за работами в области водоснабжения и канализации";
$type210="5.5. технический надзор за работами по устройству систем вентиляции, кондиционирования";
$type211="5.6. технический надзор за работами в области теплоснабжения";
$type212="5.7. технический надзор за работами в области газоснабжения";
$type213="5.8. технический надзор за работами в области электроснабжения";
$type214="5.9. технический надзор за работами в области связи, сигнализации и пожаротушения";
$type215="5.10. технический надзор за дорожно-мостовым строительством";
$type216="5.11. технический надзор за строительством железных дорог";
$type217="5.12. технический надзор за строительством сооружений метрополитена и тоннелей";
$type218="5.13. технический надзор за гидротехническим и мелиоративным строительством";
$type219="5.14. технический надзор за благоустройством территории";
$type220="6. Градостроительная деятельность";
$type221="6.1. разработка градостроительных проектов общего планирования";
$type222="6.2. разработка градостроительных проектов общего планирования (генеральные планы городов районного подчинения, поселков городского типа и сельских населенных пунктов)";
$type223="6.3. разработка градостроительных проектов специального планирования";
$type224="6.4. разработка градостроительных проектов детального планирования";
$type225="6.5. разработка градостроительных проектов детального планирования (площадь территории - до 30 га)";
$type226="6.6. разработка градостроительных проектов детального планирования (схемы планировки районов индивидуального жилищного строительства)";
$type227="7. Выполнение функций генерального подрядчика";
$type228="8. Строительство объектов первого-четвертого классов сложности";
$type229="8.1. геодезические работы";
$type230="8.2. подготовительные работы";
$type231="8.3. земляные работы";
$type232="8.4. свайные работы";
$type233="8.5. искусственное укрепление грунтов";
$type234="8.6. устройство оснований, фундаментов зданий и сооружений на естественных грунтах";
$type235="8.7. устройство конструкций способом «стена в грунте»";
$type236="8.8. устройство скважин для забора подземных вод";
$type237="8.9. бестраншейная прокладка инженерных сетей и коммуникаций";
$type238="8.10. возведение монолитных бетонных и железобетонных конструкций";
$type239="8.11. монтаж сборных бетонных и железобетонных конструкций";
$type240="8.12. монтаж металлических конструкций";
$type241="8.13. монтаж деревянных конструкций";
$type242="8.14. монтаж каменных и армокаменных конструкций";
$type243="8.15. монтаж конструкций из полимерных композиционных материалов";
$type244="8.16. защита строительных конструкций и оборудования";
$type245="8.17. защита трубопроводов";
$type246="8.18. устройство изоляционных покрытий";
$type247="8.19. устройство кровли";
$type248="8.20. устройство систем теплоизоляции и фасадов зданий";
$type249="8.21. заполнение оконных и дверных проемов";
$type250="8.22. устройство полов";
$type251="8.23. отделочные работы";
$type252="8.24. устройство наружных сетей водопровода и канализации";
$type253="8.25. устройство внутренних сетей водопровода и канализации";
$type254="8.26. устройство наружных сетей теплоснабжения";
$type255="8.27. устройство внутренних сетей теплоснабжения";
$type256="8.28. устройство наружных сетей и линий электроснабжения";
$type257="8.29. устройство внутренних сетей электроснабжения";
$type258="8.30. устройство наружных сетей газопроводов";
$type259="8.31. устройство внутренних систем газоснабжения";
$type260="8.32. устройство слаботочных сетей и систем";
$type261="8.33. монтаж систем вентиляции и кондиционирования воздуха";
$type262="8.34. гидротехническое и мелиоративное строительство";
$type263="8.35. строительство автомобильных дорог и аэродромов";
$type264="8.36. строительство мостов, эстакад и путепроводов";
$type265="8.37. благоустройство территорий";
$type266="8.38. строительство железных дорог";
$type267="8.39. строительство сооружений метрополитена и тоннелей";
$type268="8.40. монтаж систем пожаротушения";
$type269="8.41. работы по огнезащите";
$type270="8.42. монтаж подъемно-транспортного оборудования";
$type271="8.43. устройство шахтных сооружений";
$type272="обследование зданий и сооружений";
$type273="обследование автомобильных дорог,  мостовых сооружений";
$type274="обследование инженерных сетей и систем";
// добавление видов работ после 13.05.2017 в переменные//
$type5594="1. Инженерные изыскания для объектов строительства первого-четвертого классов сложности";
$type5595="1.1. работы в составе инженерно-геодезических изысканий";
$type5596="1.1.1. создание опорных геодезических сетей";
$type5597="1.1.2. геодезические наблюдения за деформациями и осадками зданий и сооружений, движениями земной поверхности и опасными природными процесс";
$type5598="1.1.3. съемка подземных коммуникаций и сооружений";
$type5599="1.1.4. трассирование линейных объектов";
$type5600="1.1.5. инженерно-гидрографические работы";
$type5601="1.1.6. специальные геодезические и топографические работы при строительстве и реконструкции зданий и сооружений";
$type5602="1.1.7. геодинамический контроль (режимные наблюдения) стабильности природной среды";
$type5616="1.2. работы в составе инженерно-геологических изысканий";
$type5617="1.2.1. инженерно-геологическая съемка в масштабах 1:500 - 1:25 000";
$type5624="1.2.2. проходка горных выработок с их опробованием, полевые и лабораторные исследования физико-механических свойств грунтов и химических свойств проб подземных вод";
$type5618="1.2.3. изучение опасных геологических и инженерно-геологических процессов с разработкой рекомендаций по инженерной защите территории";
$type5619="1.2.4. гидрогеологические исследования";
$type5620="1.2.5. инженерно-геофизические исследования";
$type5621="1.2.6. инженерно-геокриологические исследования";
$type5622="1.2.7. сейсмологические и сейсмотектонические исследования территории, сейсмическое микрорайонирование";
$type5623="1.2.8. геофизические исследования грунтов в условиях естественного залегания с использованием радиационных источников";
$type5625="1.3. работы в составе инженерно-гидрометеорологических изысканий";
$type5626="1.3.1. метеорологические наблюдения и изучение гидрологического режима водных объектов";
$type5627="1.3.2. изучение опасных гидрометеорологических процессов и явлений с расчетами их характеристик";
$type5628="1.3.3. изучение русловых процессов водных объектов, деформаций и переработки берегов";
$type5629="1.3.4. исследования ледового режима водных объектов";
$type5630="1.4. работы в составе инженерно-экологических изысканий";
$type5631="1.4.1. инженерно-экологическая съемка территории";
$type5632="1.4.2. исследования химического загрязнения почвогрунтов, поверхностных и подземных вод, атмосферного воздуха, источников загрязнения";
$type5633="1.4.3. лабораторные химико-аналитические и газохимические исследования образцов и проб почвогрунтов и воды";
$type5634="1.4.4. исследования и оценка физических воздействий и радиационной обстановки на территории";
$type5635="1.4.5. изучение растительности, животного мира, санитарно-эпидемиологические и медико-биологические исследования территории. Математическое моделирование процессов геофильтрации и массопереноса радионуклидов";
$type5636="1.4.6. исследования и прогнозные оценки миграции радионуклидов в грунтах, подземных и поверхностных водах";
$type5647="1.5. работы в составе инженерно-геотехнических изысканий";
$type5648="1.5.1. проходка горных выработок с их опробованием, полевые и лабораторные исследования механических свойств грунтов с определением характеристик для конкретных схем расчета оснований фундаментов";
$type5649="1.5.2. испытания эталонных и натурных свай";
$type5650="1.5.3. определение стандартных механических характеристик грунтов методами статического, динамического и бурового зондирования";
$type5651="1.5.4. физическое и математическое моделирование взаимодействия зданий и сооружений с геологической средой";
$type5652="1.5.5. специальные исследования характеристик грунтов по отдельным программам для нестандартных, в том числе нелинейных, методов расчета оснований фундаментов и конструкций зданий и сооружений";
$type5653="1.5.6. геотехнический контроль строительства зданий, сооружений и прилегающих территорий";
$type5654="1.6. обследование состояния грунтов оснований зданий и сооружений";
$type5655="2. Разработка предпроектной (предынвестиционной) документации";
$type5656="3. Выполнение функций генерального проектировщика";
$type5657="4. Разработка разделов проектной документации для объектов строительства первого-четвертого классов сложности";
$type5658="4.1. генеральный план";
$type5659="4.2. архитектурные решения";
$type5660="4.3. сметная документация";
$type5661="4.4. строительные решения";
$type5662="4.5. внутреннее инженерное оборудование, внутренние сети и системы";
$type5663="4.5.1. отопление, вентиляция и кондиционирование воздуха";
$type5664="4.5.2. холодоснабжение, за исключением потенциально опасных объектов";
$type5665="4.5.3. водоснабжение и канализация";
$type5666="4.5.4. электроснабжение, силовое электрооборудование и электроосвещение";
$type5667="4.5.5. связь и сигнализация, за исключением систем автоматической пожарной сигнализации, а также потенциально опасных объектов";
$type5668="4.5.6. автоматизация, за исключением потенциально опасных объектов";
$type5669="4.5.7. системы газоснабжения, за исключением потенциально опасных объектов";
$type5670="4.6. наружные сети и системы";
$type5671="4.6.1. теплоснабжение";
$type5672="4.6.2. водоснабжение и канализация";
$type5673="4.6.3. электроснабжение";
$type5674="4.6.4. связь и сигнализация, за исключением систем автоматической пожарной сигнализации, а также потенциально опасных объектов";
$type5675="4.6.5. сети газоснабжения, за исключением потенциально опасных объектов";
$type5676="4.7. технологические решения";
$type5677="4.8. инженерно-технические мероприятия гражданской обороны. Мероприятия по предупреждению чрезвычайных ситуаций";
$type5678="4.9. организация строительства";
$type5679="4.10. охрана окружающей среды";
$type5680="5. Выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов первого-четвертого классов сложности";
$type5681="5.1. выполнение функций заказчика, застройщика, оказание отдельных видов инженерных услуг в строительстве";
$type5682="5.2. выполнение функций заказчика, застройщика, оказание инженерных услуг по комплексному управлению строительной деятельностью";
$type5683="5.3. технический надзор за общестроительными работами";
$type5684="5.4. технический надзор за работами в области водоснабжения и канализации";
$type5685="5.5. технический надзор за работами по монтажу внутренних сетей теплоснабжения, вентиляции и кондиционирования воздуха";
$type5686="5.6. технический надзор за работами по устройству систем холодоснабжения";
$type5687="5.7. технический надзор за работами по монтажу наружных сетей теплоснабжения";
$type5688="5.8. технический надзор за работами в области газоснабжения";
$type5689="5.9. технический надзор за работами в области электроснабжения и автоматизации";
$type5690="5.10. технический надзор за работами в области связи, сигнализации";
$type5691="5.11. технический надзор за работами по строительству автомобильных дорог и аэродромов, строительству мостов, транспортных эстакад и путепроводов";
$type5692="5.12. технический надзор за строительством железных дорог";
$type5693="5.13. технический надзор за строительством сооружений транспортных тоннелей, метрополитенов";
$type5694="5.14. технический надзор за гидротехническим и мелиоративным строительством";
$type5695="5.15. технический надзор за благоустройством территорий";
$type5696="5.16. технический надзор за работами по монтажу технологических трубопроводов";
$type5697="5.17. технический надзор за работами по устройству магистральных трубопроводов для транспортирования нефти, газа, нефтепродуктов";
$type5698="6. Градостроительная деятельность";
$type5699="6.1. разработка градостроительных проектов общего планирования";
$type5700="6.2. разработка градостроительных проектов общего планирования (генеральные планы городов районного подчинения, поселков городского типа и сельских населенных пунктов)";
$type5701="6.3. разработка градостроительных проектов специального планирования";
$type5702="6.4. разработка градостроительных проектов детального планирования";
$type5703="6.5. разработка градостроительных проектов детального планирования (площадь территории - до 30 га)";
$type5704="6.6. разработка градостроительных проектов детального планирования (схемы планировки районов индивидуального жилищного строительства)";
$type5705="7. Выполнение функций генерального подрядчика объектов первого-четвертого классов сложности со стоимостью строительства свыше 5 тыс. базовых величин по";
$type5706="7.1. строительству зданий и сооружений";
$type5707="7.2. строительству инженерной инфраструктуры, инженерной и транспортной инфраструктуры, магистральной инженерной инфраструктуры";
$type5708="8. Строительство объектов первого-четвертого классов сложности";
$type5709="8.1. геодезические работы, выполняемые при строительстве";
$type5710="8.2. подготовительные работы, за исключением осуществляемых сельскохозяйственными  организациями при строительстве объектов сельскохозяйственного назначения  хозяйственным способом";
$type5711="8.3. земляные работы, за исключением осуществляемых сельскохозяйственными  организациями при строительстве объектов сельскохозяйственного назначения  хозяйственным способом";
$type5712="8.4. свайные работы";
$type5713="8.5. искусственное укрепление грунтов";
$type5714="8.6. устройство оснований, фундаментов зданий и сооружений на естественных грунтах";
$type5715="8.7. устройство конструкций способом «стена в грунте»";
$type5716="8.8. бурение и обустройство скважин (кроме нефтяных и газовых), за исключением потенциально опасных объектов, технических устройств";
$type5717="8.9. бестраншейная прокладка инженерных сетей и коммуникаций";
$type5718="8.10. устройство бетонных и железобетонных монолитных конструкций, кроме мостов, транспортных эстакад и путепроводов";
$type5719="8.11. монтаж сборных бетонных и железобетонных конструкций, кроме мостов, транспортных эстакад и путепроводов";
$type5720="8.12. монтаж металлических конструкций, кроме мостов, транспортных эстакад и путепроводов";
$type5721="8.13. монтаж деревянных конструкций (кроме мостов, транспортных эстакад и  путепроводов), за исключением осуществляемого сельскохозяйственными организациями  при строительстве объектов сельскохозяйственного назначения хозяйственным способом";
$type5722="8.14. монтаж каменных и армокаменных конструкций (кроме мостов, транспортных эстакад и  путепроводов), за исключением монтажа ненесущих конструкций, осуществляемого с/х организациями при строительстве объектов с/х назначения хозяйственным способом";
$type5723="8.15. монтаж конструкций из полимерных композиционных материалов, кроме мостов, транспортных эстакад и путепроводов";
$type5724="8.16. защита строительных конструкций и оборудования, за исключением потенциально опасных объектов";
$type5725="8.17. защита трубопроводов, за исключением потенциально опасных объектов";
$type5726="8.18. устройство изоляционных покрытий, за исключением потенциально опасных объектов";
$type5727="8.19. устройство кровли, за исключением осуществляемого сельскохозяйственными  организациями при строительстве объектов сельскохозяйственного назначения  хозяйственным способом";
$type5728="8.20. устройство фасадных систем теплоизоляции и облицовка фасадов зданий, за  исключением осуществляемых сельскохозяйственными организациями при строительстве объектов сельскохозяйственного назначения хозяйственным способом";
$type5729="8.21. заполнение оконных и дверных проемов, за исключением осуществляемого сельскохозяйственными организациями при строительстве объектов сельскохозяйственного назначения хозяйственным способом";
$type5730="8.22. устройство полов, за исключением осуществляемого сельскохозяйственными организациями при строительстве объектов сельскохозяйственного назначения хозяйственным способом";
$type5731="8.23. отделочные работы, за исключением осуществляемых сельскохозяйственными организациями при строительстве объектов сельскохозяйственного назначения хозяйственным способом";
$type5732="8.24. устройство наружных сетей водоснабжения и канализации";
$type5733="8.25. устройство внутренних систем водопровода и канализации";
$type5734="8.26. устройство наружных сетей теплоснабжения";
$type5735="8.27. устройство внутренних сетей теплоснабжения";
$type5736="8.28. устройство наружных сетей и линий электроснабжения, трансформаторных подстанций и распределительных устройств";
$type5737="8.29. устройство внутренних систем электроснабжения";
$type5738="8.30. устройство внутренних систем газоснабжения объектов жилищного фонда";
$type5739="8.31. устройство слаботочных сетей и систем, за исключением систем автоматической пожарной сигнализации, оповещения о пожаре и управления эвакуацией";
$type5740="8.32. монтаж систем вентиляции и кондиционирования воздуха";
$type5741="8.33. гидротехническое и мелиоративное строительство";
$type5742="8.34. строительство автомобильных дорог и аэродромов";
$type5743="8.35. строительство мостов, транспортных эстакад и путепроводов";
$type5744="8.36. благоустройство территории, за исключением осуществляемого сельскохозяйственными организациями при строительстве объектов сельскохозяйственного назначения хозяйственным способом";
$type5745="8.37. строительство железных дорог";
$type5746="8.38. строительство транспортных тоннелей, метрополитенов, за исключением потенциально опасных объектов, технических устройств";
$type5747="8.39. монтаж систем холодоснабжения, за исключением потенциально опасных объектов, технических устройств";
$type5748="8.40. монтаж систем автоматизации, за исключением потенциально опасных объектов, технических устройств";
$type5749="8.41. монтаж подъемных сооружений, за исключением потенциально опасных объектов, технических устройств";
$type5750="8.42. устройство шахтных сооружений, за исключением потенциально опасных объектов, технических устройств";
$type5751="8.43. монтаж технологических трубопроводов, за исключением потенциально опасных объектов, технических устройств";
$type5752="9. Обследование зданий и сооружений";
$type5901="строительных конструкций зданий и сооружений";
$type5902="инженерных сетей и систем";
$type5903="автомобильных дорог, мостовых сооружений";
//добавление специалистов в переменные//
$spec3="главного инженера (главного архитектора) проекта";
$spec9="мастера, прораба
специализация: общестроительные работы";
$spec10="мастер, прораб
специализация: водоснабжение и канализация
отопление и вентиляция
газоснабжение";
$spec11="мастера, прораба
специализация: наружные сети и сооружения водоснабжения и канализации, внутренний водопровод и канализация зданий";
$spec12="мастера, прораба
специализация: тепловые сети, отопление, вентиляция и кондиционирование воздуха";
$spec13="мастера, прораба
специализация: газоснабжение";
$spec71043="главного инженера строительной организации, за исключением объединений, трестов и приравненных к ним
специализация: санитарно-технические работы";
$spec15="мастера, прораба
специализация: подстанции, линии электропередач, электроосвещение, электрооборудование";
$spec71044="главного инженера строительной организации, за исключением объединений, трестов и приравненных к ним
специализация: электромонтажные работы";
$spec0="мастера, прораба
специализация: слаботочные сети";
$spec17="мастера, прораба
специализация: КИПиА";
$spec18="мастера, прораба
специализация: дорожно-мостовое строительство";
$spec71045="главного инженера строительной организации, за исключением объединений, трестов и приравненных к ним
специализация: гидротехническое и мелиоративное строительство";
$spec19="мастера, прораба
специализация: мелиоративное строительство";
$spec700024="технического надзора
специализация: общестроительные работы";
$spec700026="технического надзора
специализация: санитарно-технические работы";
$spec700030="технического надзора
специализация: электромонтажные работы";
$spec700033="технического надзора
специализация: дорожно-мостовое строительство";
$spec700034="технического надзора
специализация: гидротехническое и мелиоративное строительство";
$spec38="государственного строительного надзора";
$spec71039="главного инженера строительной организации, за исключением объединений, трестов и приравненных к ним
специализация: общестроительные работы";
$spec40="руководителя службы заказчика";
$spec71046="главного инженера строительной организации, за исключением объединений, трестов и приравненных к ним
специализация: дорожно-мостовое строительство";
$spec41="мастер, прораба
специализация: гидротехническое строительство";
$spec71048="главного инженера строительной организации, за исключением объединений, трестов и приравненных к ним
специализация: газоснабжение";
$spec71047="главного инженера строительной организации, за исключением объединений, трестов и приравненных к ним";
$spec50="специализация [общестроительные работы]";
$spec51="null";
$spec52="null";
$spec53="null";
$spec54="null";
$spec55="null";
$spec56="null";
$spec700057="технического надзора
специализация: газоснабжение";
$spec58="мастера, прораба
специализация: тепловая изоляция инженерных сетей и систем";
$spec111="мастера, прораба
специализация: общестроительные и санитарно-технические работы (за исключением объектов жилищного строительства)";
$spec700004="главного инженера проекта";
$spec71059="главного инженера
специализация: магистральные трубопроводы";
$spec60="мастера, прораба
специализация: магистральные трубопроводы";
$spec700061="технического надзора
специализация: магистральные трубопроводы";
$spec62="мастера, прораба
специализация: установка приборов учета воды и тепла";
$spec71063="главного инженера строительной организации, за исключением объединений, трестов и приравненных к ним
специализация: тепловая изоляция инженерных сетей и систем";
$spec82="мастера, прораба
специализация: железные дороги";
$spec700097="технического надзора
специализация: связь и сигнализация";
$spec700064="главного архитектора проекта";
$spec16="мастера, прораба
специализация: связь и сигнализация";
$spec700066="главный специалист по разработке раздела проекта
специализация: архитектурно - строительные решения (строительные конструкции)";
$spec700067="главный специалист по разработке раздела проекта
специализация: инженерное оборудование, сети и системы (наружные сети водоснабжения и канализации, внутренние водопровод и канализация)";
$spec700068="главный специалист по разработке раздела проекта
специализация: инженерное оборудование, сети и системы (отопление, вентиляция и кондиционирование воздуха)";
$spec700069="главный специалист по разработке раздела проекта
специализация: инженерное оборудование, сети и системы (газоснабжение, внутренние устройства и наружные газопроводы)";
$spec700070="главный специалист по разработке раздела проекта
специализация: инженерное оборудование, сети и системы (теплоснабжение)";
$spec700071="главный специалист по разработке раздела проекта
специализация: инженерное оборудование, сети и системы (холодоснабжение)";
$spec700072="главный специалист по разработке раздела проекта
специализация: инженерное оборудование, сети и системы (электроснабжение, электроосвещение и электрооборудование)";
$spec71073="главного инженера строительной организации, за исключением объединений, трестов и приравненных к ним
специализация: железные дороги";
$spec71074="главного инженера строительной организации, за исключением объединений, трестов и приравненных к ним
специализация: сооружения метрополитена";
$spec76="мастера, прораба
специализация: наружные сети и сооружения водоснабжения и канализации";
$spec77="мастера, прораба
специализация: внутренний водопровод и канализация зданий";
$spec78="мастера, прораба
специализация: тепловые сети";
$spec79="мастера, прораба
специализация: отопление, вентиляция и кондиционирование";
$spec127="мастера, прораба 
специализация: отделочные работы, работы по заполнению оконных и дверных проемов, устройство полов";
$spec700128="главного инженера строительной организации
специализация: благоустройство и озеленение территорий";
$spec80="мастера, прораба
специализация: подстанции, линии электропередач";
$spec700084="технического надзора
специализация: железные дороги";
$spec81="мастера, прораба
специализация: электроосвещение, электрооборудование";
$spec83="мастера, прораба
специализация: сооружения метрополитена";
$spec700085="технического надзора
специализация: сооружения метрополитена";
$spec700129="главного инженера проекта
специализация: связь и сигнализация";
$spec700136="главного специалиста по разработке проектной документации
специализация: автомобильные дороги";
$spec710126="главного инженера строительной организации
специализация:  устройство полов, заполнение оконных и дверных проемов, отделочные работы (малярные, штукатурные, облицовочные, обойные, стекольные)";
$spec90="строительные конструкции";
$spec91="инженерные сети и системы";
$spec700093="специалист по обследованию зданий и сооружений
специализация: строительные конструкции";
$spec94="инженерные сети и системы";
$spec700095="технического надзора
специализация: тепловые сети";
$spec71096="главного инженера строительной организации, за исключением объединений, трестов и приравненных к ним
специализация: связь и сигнализация";
$spec700137="начальник проектно-конструкторского отдела по разработке проектной документации
специализация: автомобильные дороги";
$spec700098="главного специалиста по разработке раздела проекта
специализация: инженерное оборудование, сети и системы (системы связи)";
$spec700099="главного специалиста
специализация: инженерное оборудование, сети и системы (автоматизация)";
$spec700101="начальник проектно-конструкторского отдела по разработке раздела проекта
специализация: архитектурно строительные решения (строительные конструкции)";
$spec700102="начальник проектно-конструкторского отдела по разработке раздела проекта
специализация: инженерное оборудование, сети и системы (наружные сети водоснабжения и канализации, внутренние водопровод и канализация)";
$spec700103="начальник проектно-конструкторского отдела по разработке раздела проекта
специализация: инженерное оборудование, сети и системы (отопление, вентиляция и кодиционирование воздуха)";
$spec700104="начальник проектно-конструкторского отдела по разработке раздела проекта
специализация: инженерное оборудование, сети и системы (газоснабжение, внутренние устройства и наружные газопроводы)";
$spec700138="начальник (заместитель начальника) сметно-экономического отдела";
$spec700139="главный специалист сметно-экономического отдела";
$spec700047="главного инженера строительной организации
специализация: общестроительные, санитарно-технические, электромонтажные работы";
$spec700105="начальник проектно-конструкторского отдела по разработке раздела проекта
специализация: инженерное оборудование, сети и системы (теплоснабжение)";
$spec700106="начальник проектно-конструкторского отдела по разработке раздела проекта
специализация: инженерное оборудование, сети и системы (холодоснабжение)";
$spec700107="начальник проектно-конструкторского отдела по разработке раздела проекта
специализация: инженерное оборудование, сети и системы (электроснабжение, электроосвещение и электрооборудование)";
$spec700108="начальник проектно-конструкторского отдела по разработке раздела проекта
специализация: инженерное оборудование, сети и системы (системы связи)";
$spec700109="начальник проектно-конструкторского отдела по разработке раздела проекта
специализация: инженерное оборудование, сети и системы (автоматизация)";
$spec110="мастера, прораба
специализация: тепловая изоляция наружных стен зданий";
$spec710112="мастера, прораба
специализация: благоустройство и озеленение территории";
$spec710113="технического надзора
специализация: благоустройство и озеленение территорий";
$spec710114="начальник (заместитель начальника) производственного, технического отдела (за исключением объединений, трестов и приравненных к ним)
специализация: санитарно-технические работы";
$spec710115="начальник (заместитель начальника) производственного, технического отдела (за исключением объединений, трестов и приравненных к ним)
специализация: электромонтажные работы";
$spec710116="начальник (заместитель начальника) производственного, технического отдела (за исключением объединений, трестов и приравненных к ним)
специализация: гидротехническое и мелиоративное строительство";
$spec710117="начальник (заместитель начальника) производственного, технического отдела (за исключением объединений, трестов и приравненных к ним)
специализация: общестроительные работы";
$spec710118="начальник (заместитель начальника) производственного, технического отдела (за исключением объединений, трестов и приравненных к ним)
специализация: дорожно-мостовое строительство";
$spec143="СМК";
$spec710119="начальник (заместитель начальника) производственного, технического отдела (за исключением объединений, трестов и приравненных к ним)
специализация: газоснабжение";
$spec710120="начальник (заместитель начальника) производственного, технического отдела (за исключением объединений, трестов и приравненных к ним)";
$spec710121="начальник (заместитель начальника) производственного, технического отдела (за исключением объединений, трестов и приравненных к ним)
специализация: магистральные трубопроводы";
$spec710122="начальник (заместитель начальника) производственного, технического отдела (за исключением объединений, трестов и приравненных к ним)
специализация: тепловая изоляция инженерных сетей и систем";
$spec710123="начальник (заместитель начальника) производственного, технического отдела (за исключением объединений, трестов и приравненных к ним)
специализация: железные дороги";
$spec710124="начальник (заместитель начальника) производственного, технического отдела (за исключением объединений, трестов и приравненных к ним)
специализация: сооружения метрополитена";
$spec710125="начальник (заместитель начальника) производственного, технического отдела (за исключением объединений, трестов и приравненных к ним)
специализация: связь и сигнализация";
$spec700140="главного геодезиста";
$spec700141="ведущий инженер по сметной работе (сметчик)";
$spec700142="ведущий геодезист (геодезист)";
$spec144="технического надзора
специализация: общестроительные работы
I (первый) уровень";
$spec710128="главного инженера строительной организации, за исключением объединений, трестов и приравненных к ним
специализация: благоустройство и озеленение территорий";
$spec145="технического надзора
специализация: общестроительные работы
II (второй) уровень";
$spec146="технического надзора
специализация: общестроительные работы
III (третий) уровень";
$spec700048="главного инженера строительной организации
специализация: газоснабжение";
$spec700045="главного инженера строительной организации
специализация: гидротехническое и мелиоративное строительство";
$spec700046="главного инженера строительной организации
специализация: дорожно-мостовое строительство";
$spec700073="главного инженера строительной организации
специализация: железные дороги";
$spec700059="главного инженера строительной организации
специализация: магистральные трубопроводы";
$spec700039="главного инженера строительной организации
специализация: общестроительные работы";
$spec700126="главного инженера строительной организации
специализация:  устройство полов, заполнение оконных и дверных проемов, отделочные работы (малярные, штукатурные, облицовочные, обойные, стекольные)";
$spec700043="главного инженера строительной организации
специализация: санитарно-технические работы";
$spec700096="главного инженера строительной организации
специализация: связь и сигнализация";
$spec700074="главного инженера строительной организации
специализация: сооружения метрополитена";
$spec700063="главного инженера строительной организации
специализация: тепловая изоляция инженерных сетей и систем";
$spec700044="главного инженера строительной организации
специализация: электромонтажные работы";
$spec700120="начальник (заместитель начальника) производственного, технического отдела строительной организации (общестроительные, санитарно-технические, электромонтажные работы)";
$spec700115="начальник (заместитель начальника) производственного, технического отдела
специализация: электромонтажные работы";
$spec700122="начальник (заместитель начальника) производственного, технического отдела
специализация: тепловая изоляция инженерных сетей и систем";
$spec700124="начальник (заместитель начальника) производственного, технического отдела
специализация: сооружения метрополитена";
$spec700125="начальник (заместитель начальника) производственного, технического отдела
специализация: связь и сигнализация";
$spec700114="начальник (заместитель начальника) производственного, технического отдела
специализация: санитарно-технические работы";
$spec700117="начальник (заместитель начальника) производственного, технического отдела
специализация: общестроительные работы";
$spec700121="начальник (заместитель начальника) производственного, технического отдела
специализация: магистральные трубопроводы";
$spec700123="начальник (заместитель начальника) производственного, технического отдела
специализация: железные дороги";
$spec700118="начальник (заместитель начальника) производственного, технического отдела
специализация: дорожно-мостовое строительство";
$spec700116="начальник (заместитель начальника) производственного, технического отдела
специализация: гидротехническое и мелиоративное строительство";
$spec700119="начальник (заместитель начальника) производственного, технического отдела
специализация: газоснабжение";
$spec700147="начальник (заместитель начальника) производственного, технического отдела
специализация: благоустройство и озеленение территорий";
$spec20113="технического надзора
специализация: благоустройство и озеленение территорий (работы по устройству дорожных покрытий пешеходных зон из тротуарных плит)";
$spec20112="мастера, прораба
специализация: благоустройство и озеленение территорий (работы по устройству дорожных покрытий пешеходных зон из тротуарных плит)";
$spec150="главного инженера 
специализация: производство железобетонных изделий и конструкций";
$spec112="мастера, прораба
специализация: благоустройство и озеленение территорий";
$spec700113="технического надзора
специализация: благоустройство и озеленение территорий";
$spec152="начальника цеха (участка) 
специализация: производство железобетонных изделий и конструкций";
$spec151="главного технолога 
специализация: производство железобетонных изделий и конструкций";
$spec153="мастера цеха (участка) 
специализация: производство железобетонных изделий и конструкций";
$spec4="разработка разделов проектной документации
Специализация: главный инженер проекта";
$spec64="разработка разделов проектной документации
Специализация: главный архитектор проекта";
$spec154="руководителя подразделения, проводящего испытания и контроль качества продукции
специализация: производство железобетонных изделий и конструкций";
$spec155="специалиста подразделения, проводящего испытания и контроль качества продукции
специализация: производство железобетонных изделий и конструкций";
$spec42="главного инженера строительной организации";
$spec14="null";
$spec148="главного инженера проекта специализация: автомобильные дороги";
$spec75="null";
$spec700135="cпециалиста по обследованию специализация: строительные конструкции";
$spec700187="руководителя проекта 
I категории";
$spec700163="главный специалист по разработке раздела проекта  специализация: генеральный план";
$spec700162="начальник проектно-конструкторского отдела по разработке раздела проекта специализация: генеральный план";
$spec700167="cпециалиста, проводящего инженерные изыскания I категории
Cпециализация: инженерно-геологические изыскания";
$spec700164="главный специалист по разработке раздела проекта  специализация: проект организации строительства";
$spec700168="cпециалиста, проводящего инженерные изыскания I категории
Cпециализация: инженерно-гидрометеорологические изыскания";
$spec700169="cпециалиста, проводящего инженерные изыскания I категории
Cпециализация: инженерно-экологические изыскания";
$spec700166="cпециалиста, проводящего инженерные изыскания I категории
Cпециализация: инженерно-геодезические изыскания";
$spec700170="cпециалиста, проводящего инженерные изыскания I категории
Cпециализация: инженерно-геотехнические изыскания";
$spec188="руководителя проекта 
II категории";
$spec189="руководителя проекта 
III категории";
$spec700171="cпециалиста, проводящего инженерные изыскания I категории
Cпециализация: обследование состояния грунтов оснований зданий и сооружений";
$spec173="cпециалиста, проводящего инженерные изыскания II категории
Cпециализация: инженерно-геодезические изыскания";
$spec174="cпециалиста, проводящего инженерные изыскания II категории
Cпециализация: инженерно-геологические изыскания";
$spec700190="специалиста по организации закупок";
$spec17700024="выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов
Специализация: инженер по техническому надзору за строительством (общестроительные работы)";
$spec17700026="выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов
Специализация: инженер по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования)";
$spec17700030="выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов
Cпециализация: инженер по техническому надзору за строительством (работы в области электроснабжения)";
$spec17700033="выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов
Cпециализация: инженер по техническому надзору за строительством (дорожно-мостовое строительство)";
$spec34="выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов 
Специализация: инженер по техническому надзору за строительством (гидротехническое и мелиоративное строительство)";
$spec17700084="выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов
Специализация: инженер по техническому надзору за строительством (строительство железных дорог)";
$spec17700085="выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов
Специализация: инженер по техническому надзору за строительством (строительство сооружений метрополитена и тоннелей)";
$spec57="выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов 
Специализация: инженер по техническому надзору за строительством (работы в области газоснабжения)";
$spec17700061="выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов
Специализация: инженер по техническому надзору за строительством (магистральные трубопроводы)";
$spec17700066="разработка разделов проектной документации
Специализация: главный специалист, осуществляющий разработку раздела проектной документации (архитектурные решения, строительные решения (строительные конструкции))";
$spec17700067="разработка разделов проектной документации
Специализация: главный специалист, осуществляющий разработку раздела проектной документации (инженерное оборудование, сети и системы (внутренние и наружные сети и системы водоснабжения и канализации))";
$spec17700068="разработка разделов проектной документации
Специализация: главный специалист, осуществляющий разработку раздела проектной документации (инженерное оборудование, внутренние и наружные сети и системы (отопление, вентиляция и кондиционирование воздуха))";
$spec17700069="разработка разделов проектной документации
Специализация: главный специалист, осуществляющий разработку раздела проектной документации (инженерное оборудование, внутренние и наружные сети и системы (газоснабжение, внутренние устройства, наружные газопроводы))";
$spec17700070="разработка разделов проектной документации
Специализация: главный специалист, осуществляющий разработку раздела проектной документации (инженерное оборудование, внутренние и наружные сети и системы (теплоснабжение))";
$spec17700071="разработка разделов проектной документации
Cпециализация: главный специалист, осуществляющий разработку раздела проектной документации (инженерное оборудование, внутренние и наружные сети и системы (холодоснабжение))";
$spec17700072="разработка разделов проектной документации
Специализация: главный специалист, осуществляющий разработку раздела проектной документации (инженерное оборудование, внутренние и наружные сети и системы (электроснабжение, электроосвещение, электрооборудование))";
$spec141="строительство объектов
Специализация: инженер по сметной работе (сметчик)";
$spec95="выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов
Специализация: инженер по техническому надзору за строительством (работы в области теплоснабжения)";
$spec17700097="выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов
Специализация: инженер по техническому надзору за строительством (работы в области связи, сигнализации и пожаротушения)";
$spec17700098="разработка разделов проектной документации
Специализация: главный специалист, осуществляющий разработку раздела проектной документации (инженерное оборудование, внутренние и наружные сети и системы (связь, сигнализация))";
$spec17700099="разработка разделов проектной документации
Специализация: главный специалист, осуществляющий разработку раздела проектной документации (инженерное оборудование, внутренние и наружные сети и системы (автоматизация))";
$spec17700101="разработка разделов проектной документации
Специализация: начальник (заведующий) структурного подразделения, осуществляющего разработку раздела проектной документации (архитектурные решения, строительные решения (строительные конструкции))";
$spec17700102="разработка разделов проектной документации
Специализация: начальник (заведующий) структурного подразделения, осуществляющего разработку раздела проектной документации (инженерное оборудование, сети и системы (внутренние и наружные сети и системы водоснабжения и канализации)";
$spec17700103="разработка разделов проектной документации
Специализация: начальник (заведующий) структурного подразделения, осуществляющего разработку раздела проектной документации (инженерное оборудование, внутренние и наружные сети и системы (отопление,  вентиляция и кондиционирование воздуха))";
$spec17700104="разработка разделов проектной документации
Специализация: начальник (заведующий) структурного подразделения, осуществляющего разработку раздела проектной документации (инженерное оборудование, внутренние и наружные сети и системы (газоснабжение, внутренние устройства, наружные газопроводы))";
$spec17700105="разработка разделов проектной документации
Специализация: начальник (заведующий) структурного подразделения, осуществляющего разработку раздела проектной документации (инженерное оборудование, внутренние и наружные сети и системы (теплоснабжение))";
$spec17700106="разработка разделов проектной документации
Специализация: начальник (заведующий) структурного подразделения, осуществляющего разработку раздела проектной документации (инженерное оборудование, внутренние и наружные сети и системы (холодоснабжение))";
$spec17700107="разработка разделов проектной документации
Специализация: начальник (заведующий) структурного подразделения, осуществляющего разработку раздела проектной документации (инженерное оборудование, внутренние и наружные сети и системы (электроснабжение, электроосвещение, электрооборудование))";
$spec17700108="разработка разделов проектной документации
Специализация: начальник (заведующий) структурного подразделения, осуществляющего разработку раздела проектной документации (инженерное оборудование, внутренние и наружные сети и системы (связь, сигнализация))";
$spec17700109="разработка разделов проектной документации
Специализация: начальник (заведующий) структурного подразделения, осуществляющего разработку раздела проектной документации (инженерное оборудование, внутренние и наружные сети и системы (автоматизация))";
$spec17700129="разработка разделов проектной документации
Специализация: главный инженер проекта (связь, сигнализация)";
$spec800135="cпециалиста по обследованию специализация: строительные конструкции";
$spec136="разработка разделов проектной документации
Специализация: главный специалист, осуществляющий разработку раздела проектной документации   (автомобильные дороги)";
$spec138="разработка разделов проектной документации
Специализация: начальник (заведующий) структурного подразделения, осуществляющий разработку раздела проектной документации (сметная документация)";
$spec139="разработка разделов проектной документации
Специализация: главный специалист, осуществляющий разработку раздела проектной документации (сметная документация)";
$spec247="строительство объектов
Специализация: начальник (заместитель начальника) производственно-технического отдела (заполнение оконных и дверных проемов, устройство полов, отделочные работы)";
$spec140="строительство объектов
Специализация: главный геодезист";
$spec137="разработка разделов проектной документации
Специализация: начальник (заведующий) структурного подразделения, осуществляющий разработку раздела проектной документации (автомобильные дороги)";
$spec142="строительство объектов
Специализация: ведущий геодезист (геодезист)";
$spec147="строительство объектов
Специализация: начальник (заместитель начальника) производственно-технического отдела (благоустройство территорий)";
$spec187="выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов
Специализация: руководитель (управляющий) проекта";
$spec163="разработка разделов проектной документации
Специализация: главный специалист, осуществляющий разработку раздела проектной документации (генеральный план)";
$spec162="разработка разделов проектной документации
Специализация: начальник (заведующий) структурного подразделения, осуществляющий разработку раздела проектной документации (генеральный план)";
$spec167="инженерные изыскания для объектов строительства
Специализация: cпециалист, осуществляющий инженерно-геологические изыскания";
$spec164="разработка разделов проектной документации
Специализация: главный специалист, осуществляющий разработку раздела проектной документации (организация строительства)";
$spec168="инженерные изыскания для объектов строительства
Специализация: cпециалист, осуществляющий инженерно-гидрометеорологические изыскания";
$spec169="инженерные изыскания для объектов строительства
Специализация: cпециалист, осуществляющий инженерно-экологические изыскания";
$spec166="инженерные изыскания для объектов строительства
Специализация: cпециалист, осуществляющий инженерно-геодезические изыскания";
$spec170="инженерные изыскания для объектов строительства
Специализация: специалист, осуществляющий инженерно-геотехнические изыскания";
$spec192="строительство объектов
Специализация: мастер (благоустройство территорий)";
$spec171="инженерные изыскания для объектов строительства
Специализация: cпециалист, осуществляющий обследование состояния грунтов оснований зданий и сооружений";
$spec193="строительство объектов
Специализация: мастер (устройство наружных сетей газопроводов, устройство внутренних систем газоснабжения)";
$spec194="строительство объектов
Специализация: мастер (гидротехническое строительство)";
$spec17700195="строительство объектов
Специализация: мастер (строительство автомобильных дорог и аэродромов, строительство мостов, эстакад и путепроводов)";
$spec196="строительство объектов
Специализация: мастер (строительство железных дорог)";
$spec190="специалиста по организации закупок";
$spec17700197="строительство объектов
Специализация: мастер (магистральные трубопроводы)";
$spec198="строительство объектов
Специализация: мастер (мелиоративное строительство)";
$spec17700199="строительство объектов
Специализация: мастер (общестроительные работы)";
$spec17700200="строительство объектов
Специализация: мастер (заполнение оконных и дверных проемов, устройство полов, отделочные работы)";
$spec202="мастер специализация: водоснабжение и канализация  отопление и вентиляция  газоснабжение";
$spec17700203="строительство объектов
Специализация: мастер (устройство наружных сетей водопровода и канализации, устройство внутренних сетей водопровода и канализации)";
$spec17700204="строительство объектов
Специализация: мастер (устройство внутренних сетей водопровода и канализации)";
$spec17700205="строительство объектов
Специализация: мастер (устройство наружных сетей водопровода и канализации)";
$spec206="строительство объектов
Специализация: мастер (устройство 
внутренних и наружных сетей теплоснабжения, монтаж систем вентиляции и кондиционирования воздуха)";
$spec207="строительство объектов 
Специализация: мастер (устройство внутренних сетей теплоснабжения, монтаж систем вентиляции и кондиционирования воздуха)";
$spec208="строительство объектов
Специализация: мастер (устройство наружных сетей теплоснабжения)";
$spec17700209="строительство объектов
Специализация: мастер (строительство сооружений метрополитена и тоннелей)";
$spec210="строительство объектов
Специализация: мастер (защита трубопроводов, устройство изоляционных покрытий)";
$spec17700211="строительство объектов
Специализация: мастер (устройство систем теплоизоляции и фасадов зданий)";
$spec212="строительство объектов
Специализация: мастер (установка приборов учета тепло- и водопотребления)";
$spec213="null";
$spec214="строительство объектов
Специализация: мастер (монтаж систем автоматизации)";
$spec17700215="строительство объектов
Специализация: мастер (устройство наружных сетей и линий электроснабжения, устройство внутренних сетей электроснабжения)";
$spec17700216="строительство объектов 
Специализация: мастер (устройство наружных сетей и линий электроснабжения)";
$spec17700217="строительство объектов
Специализация: мастер (устройство внутренних сетей электроснабжения)";
$spec218="строительство объектов 
Специализация: мастер (устройство слаботочных сетей и систем)";
$spec220="строительство объектов
Специализация: производитель работ (прораб) (благоустройство территорий)";
$spec221="строительство объектов
Специализация: производитель работ (прораб) (устройство наружных сетей газопроводов, устройство внутренних систем газоснабжения)";
$spec222="строительство объектов
Специализация: производитель работ (прораб) (гидротехническое строительство)";
$spec17700223="строительство объектов
Специализация: производитель работ (прораб) (строительство автомобильных дорог и аэродромов,  строительство мостов, эстакад и путепроводов)";
$spec224="стротельство объектов
Специализация: производитель работ (прораб) (строительство железных дорог)";
$spec17700225="строительство объектов
Специализация: производитель работ (прораб) (магистральные трубопроводы)";
$spec226="строительство объектов
Специализация: производитель работ (прораб) (мелиоративное строительство)";
$spec227="строительство объектов
Специализация: производитель работ (прораб) (общестроительные работы)";
$spec228="cтроительство объектов
Специализация: производитель работ (прораб) (заполнение оконных и дверных проемов, устройство полов, отделочные работы)";
$spec230="прораб специализация: водоснабжение и канализация  отопление и вентиляция  газоснабжение";
$spec17700231="cтроительство объектов
Специализация: производитель работ (прораб) (устройство внутренних и наружных сетей водопровода и канализации)";
$spec17700232="cтроительство объектов
Специализация: производитель работ (прораб) (устройство внутренних сетей водопровода и канализации)";
$spec17700233="cтроительство объектов
Специализация: производитель работ (прораб) (устройство наружных сетей водопровода и канализации)";
$spec17700234="строительство объектов
Специализация: производитель работ (прораб)  (устройство внутренних и наружных сетей теплоснабжения, монтаж систем вентиляции и кондиционирования воздуха)";
$spec235="строительство объектов
Специализация: производитель работ (прораб) (устройство внутренних сетей теплоснабжения, монтаж систем вентиляции и кондиционирования воздуха)";
$spec236="cтроительство объектов
Специализация: производитель работ (прораб) (устройство наружных сетей теплоснабжения)";
$spec17700237="cтроительство объектов
Специализация: производитель работ (прораб) (строительство сооружений метрополитена и тоннелей)";
$spec238="cтроительство объектов
Специализация: производитель работ (прораб) (защита трубопроводов, устройство изоляционных покрытий)";
$spec17700239="cтроительство объектов
Специализация: производитель работ (прораб) (устройство систем теплоизоляции и фасадов зданий)";
$spec240="cтроительство объектов
Специализация: производитель работ (прораб) (установка приборов учета тепло- и водопотребления)";
$spec241="null";
$spec242="cтроительство объектов
Специализация: производитель работ (прораб) (монтаж систем автоматизации)";
$spec17700243="cтроительство объектов
Специализация: производитель работ (прораб) (устройство наружных сетей и линий электроснабжения, устройство внутренних сетей электроснабжения)";
$spec244="cтроительство объектов
Специализация: производитель работ (прораб) (устройство слаботочных сетей и систем)";
$spec17700245="cтроительство объектов
Специализация: производитель работ (прораб) (устройство наружных сетей и линий электроснабжения)";
$spec17700246="строительство объектов
Специализация: производитель работ (прораб) (устройство внутренних сетей электроснабжения, электрооборудование силовое)";
$spec93="выполнение работ по обследованию зданий и сооружений
Специализация: cпециалист, осуществляющий  обследование зданий и сооружений (строительные конструкции)";
$spec92="null";
$spec17700043="строительство объектов
Специализация: главный инженер (устройство наружных и внутренних сетей водопровода и канализации, теплоснабжения, монтаж систем вентиляции и кондиционирования воздуха)";
$spec17700044="строительство объектов
Специализация: главный инженер (устройство наружных сетей и линий электроснабжения, устройство внутренних сетей электроснабжения)";
$spec45="строительство объектов  
Специализация: главный инженер (гидротехническое и мелиоративное строительство)";
$spec39="строительство объектов
Специализация: главный инженер (общестроительные работы)";
$spec17700046="строительство объектов
Специализация: главный инженер (строительство автомобильных дорог и аэродромов,  строительство мостов, эстакад и путепроводов)";
$spec17700048="строительство объектов
Специализация: главный инженер (устройство наружных сетей газопроводов, устройство внутренних систем газоснабжения)";
$spec17700047="строительство объектов
Специализация: главный инженер (общестроительные работы, устройство внутренних и наружных сетей водопровода и канализации, теплоснабжения, монтаж систем вентиляции и кондиционирования воздуха, устройство наружных сетей и линий электроснабжения, внутренних сетей электроснабжения)";
$spec113="выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов
Специализация: инженер по техническому надзору за строительством (благоустройство территорий)";
$spec17700059="строительство объектов
Специализация: главный инженер (магистральные трубопроводы)";
$spec63="строительство объектов
Cпециализация: главный инженер (защита трубопроводов, устройство изоляционных покрытий)";
$spec73="cтроительство объектов
Cпециализация: главный инженер (строительство железных дорог)";
$spec17700074="строительство объектов
Специализация: главный инженер (строительство сооружений метрополитена и тоннелей)";
$spec96="строительство объектов
Специализация: главный инженер (устройство слаботочных сетей и систем)";
$spec17700114="строительство объектов
Специализация: начальник (заместитель начальника) производственно-технического отдела (устройство внутренних и наружных сетей водопровода и канализации, теплоснабжения, монтаж систем вентиляции и кондиционирования воздуха)";
$spec17700115="строительство объектов
Специализация: начальник (заместитель начальника) производственно-технического отдела (устройство наружных сетей и линий электроснабжения, устройство внутренних сетей электроснабжения)";
$spec116="Строительство объектов
Специализация: начальник (заместитель начальника) производственно-технического отдела (гидротехническое и мелиоративное строительство)";
$spec117="cтроительство объектов
Специализация: начальник (заместитель начальника) производственно-технического отдела (общестроительные работы)";
$spec17700118="cтроительство объектов
Специальность: начальник (заместитель начальника) производственно-технического отдела (строительство автомобильных дорог и аэродромов, строительство мостов, эстакад и путепроводов)";
$spec119="строительство объектов
Специализация: начальник (заместитель начальника) производственно-технического отдела (устройство наружных сетей газопроводов, устройство внутренних систем газоснабжения)";
$spec17700120="cтроительство объектов
Специализация: начальник (заместитель начальника) производственно-технического отдела (общестроительные работы, устройство внутренних и наружных сетей водопровода и канализации, теплоснабжения, монтаж систем вентиляции и кондиционирования воздуха, устройство наружных сетей и линий электроснабжения, внутренних сетей электроснабжения)";
$spec17700121="строительство объектов
Специализация: начальник (заместитель начальника) производственно-технического отдела (магистральные трубопроводы)";
$spec126="строительство объектов
Специализация: главный инженер (заполнение оконных и дверных проемов, устройство полов, отделочные работы)";
$spec122="строительство объектов
Специализация: начальник (заместитель начальника) производственно-технического отдела (защита трубопроводов, устройство изоляционных покрытий)";
$spec123="cтроительство объектов
Специализация: начальник (заместитель начальника) производственно-технического отдела (строительство железных дорог)";
$spec17700124="строительная организация
Специализация: начальник (заместитель начальника) производственно-технического отдела (строительство сооружений метрополитена и тоннелей)";
$spec125="строительство объектов
Специализация: начальник (заместитель начальника) производственно-технического отдела (устройство слаботочных сетей и систем)";
$spec128="строительство объектов
Специализация: главный инженер (благоустройство территорий)";
$spec278="строительство объектов
Специализация: главный инженер (монтаж систем автоматизации)";
$spec43="строительство объектов
Специализация: главный инженер (устройство наружных сетей водоснабжения, канализации, теплоснабжения, устройство внутренних сетей теплоснабжения и систем водопровода и канализации, монтаж систем вентиляции и кондиционирования воздуха)";
$spec44="строительство объектов
Специализация: главный инженер (устройство наружных сетей и линий электроснабжения, трансформаторных подстанций и распределительных устройств, устройство внутренних систем электроснабжения)";
$spec24="выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов
Специализация: инженер по техническому надзору за строительством (общестроительные работы)";
$spec26="выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов
Специализация: инженер по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)";
$spec30="выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов
Cпециализация: инженер по техническому надзору за строительством (работы в области электроснабжения и автоматизации)";
$spec33="выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов
Cпециализация: инженер по техническому надзору за строительством (строительство автомобильных дорог и аэродромов, строительство мостов, транспортных эстакад и путепроводов)";
$spec46="строительство объектов
Специализация: главный инженер (строительство автомобильных дорог и аэродромов, строительство мостов, транспортных эстакад и путепроводов)";
$spec48="строительство объектов
Специализация: главный инженер (устройство наружных сетей газопроводов, устройство внутренних систем газоснабжения)";
$spec47="строительство объектов
Специализация: главный инженер (общестроительные работы, устройство наружных сетей водоснабжения, канализации, теплоснабжения, устройство внутренних сетей теплоснабжения и систем водопровода и канализации, монтаж систем вентиляции и кондиционирования воздуха, устройство наружных сетей и линий электроснабжения, трансформаторных подстанций и распределительных устройств, внутренних систем электроснабжения)";
$spec84="выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов
Специализация: инженер по техническому надзору за строительством (строительство железных дорог)";
$spec85="выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов
Специализация: инженер по техническому надзору за строительством (строительство сооружений транспортных тоннелей, метрополитенов)";
$spec59="строительство объектов
Специализация: главный инженер (устройство магистральных трубопроводов для транспортирования нефти, газа, нефтепродуктов)";
$spec61="выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов
Специализация: инженер по техническому надзору за строительством (устройство магистральных трубопроводов для транспортирования нефти, газа, нефтепродуктов)";
$spec66="разработка разделов проектной документации
Специализация: главный специалист, осуществляющий разработку раздела проектной документации (конструктивные решения)";
$spec67="разработка разделов проектной документации
Специализация: главный специалист, осуществляющий разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))";
$spec68="разработка разделов проектной документации
Специализация: главный специалист, осуществляющий разработку раздела проектной документации (инженерное оборудование, сети и системы (отопление, вентиляция и кондиционирование воздуха))";
$spec69="разработка разделов проектной документации
Специализация: главный специалист, осуществляющий разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))";
$spec70="разработка разделов проектной документации
Специализация: главный специалист, осуществляющий разработку раздела проектной документации (инженерное оборудование, сети и системы (тепловые сети))";
$spec71="разработка разделов проектной документации
Cпециализация: главный специалист, осуществляющий разработку раздела проектной документации (инженерное оборудование, сети и системы (холодоснабжение))";
$spec72="разработка разделов проектной документации
Специализация: главный специалист, осуществляющий разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))";
$spec74="строительство объектов
Специализация: главный инженер (строительство транспортных тоннелей, метрополитенов)";
$spec97="выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов
Специализация: инженер по техническому надзору за строительством (работы в области связи, сигнализации)";
$spec98="разработка разделов проектной документации
Специализация: главный специалист, осуществляющий разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))";
$spec99="разработка разделов проектной документации
Специализация: главный специалист, осуществляющий разработку раздела проектной документации (инженерное оборудование, сети и системы (автоматизация))";
$spec101="разработка разделов проектной документации
Специализация: начальник (заведующий) структурного подразделения, осуществляющий разработку раздела проектной документации (конструктивные решения)";
$spec102="разработка разделов проектной документации
Специализация: начальник (заведующий) структурного подразделения, осуществляющий разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))";
$spec103="разработка разделов проектной документации
Специализация: начальник (заведующий) структурного подразделения, осуществляющий разработку раздела проектной документации (инженерное оборудование, сети и системы (отопление, вентиляция и кондиционирование воздуха))";
$spec104="разработка разделов проектной документации
Специализация: начальник (заведующий) структурного подразделения, осуществляющий разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))";
$spec105="разработка разделов проектной документации
Специализация: начальник (заведующий) структурного подразделения, осуществляющий разработку раздела проектной документации (инженерное оборудование, сети и системы (тепловые сети))";
$spec106="разработка разделов проектной документации
Специализация: начальник (заведующий) структурного подразделения, осуществляющий разработку раздела проектной документации (инженерное оборудование, сети и системы (холодоснабжение))";
$spec107="разработка разделов проектной документации
Специализация: начальник (заведующий) структурного подразделения, осуществляющий разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))";
$spec108="разработка разделов проектной документации
Специализация: начальник (заведующий) структурного подразделения, осуществляющий разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))";
$spec109="разработка разделов проектной документации
Специализация: начальник (заведующий) структурного подразделения осуществляющий разработку раздела проектной документации (инженерное оборудование, сети и системы (автоматизация))";
$spec114="строительство объектов
Специализация: начальник (заместитель начальника) производственно-технического отдела (устройство наружных сетей водоснабжения, канализации, теплоснабжения, устройство внутренних сетей теплоснабжения и систем водопровода и канализации, монтаж систем вентиляции и кондиционирования воздуха)";
$spec115="строительство объектов
Специализация: начальник (заместитель начальника) производственно-технического отдела (устройство наружных сетей и линий электроснабжения, трансформаторных подстанций и распределительных устройств, устройство внутренних систем электроснабжения)";
$spec118="cтроительство объектов
Специальность: начальник (заместитель начальника) производственно-технического отдела (строительство автомобильных дорог и аэродромов, строительство мостов, транспортных эстакад и путепроводов)";
$spec120="cтроительство объектов
Специализация: начальник (заместитель начальника) производственно-технического отдела (общестроительные работы, устройство наружных сетей водоснабжения, канализации, теплоснабжения, устройство внутренних сетей теплоснабжения и систем водопровода и канализации, монтаж систем вентиляции и кондиционирования воздуха, устройство наружных сетей и линий электроснабжения, трансформаторных подстанций и распределительных устройств, внутренних систем электроснабжения)";
$spec121="строительство объектов
Специализация: начальник (заместитель начальника) производственно-технического отдела (устройство магистральных трубопроводов для транспортирования нефти, газа, нефтепродуктов)";
$spec124="cтроительство объектов
Специализация: начальник (заместитель начальника) производственно-технического отдела (строительство транспортных тоннелей, метрополитенов)";
$spec129="разработка разделов проектной документации
Специализация: главный инженер проекта (связь и сигнализация)";
$spec17700135="выполнение работ по обследованию зданий и сооружений
Cпециализация: специалист, осуществляющий обследование зданий и сооружений (строительные конструкции)";
$spec251="разработка разделов проектной документации
Специализация: главный специалист, осуществляющий разработку раздела проекта (водозаборные скважины)";
$spec248="разработка разделов проектной документации
Специализация: главный специалист, осуществляющий разработку раздела проектной документации (охрана окружающей среды)";
$spec252="разработка разделов проектной документации
Специализация: главный специалист, осуществляющий разработку раздела проектной документации  (архитектурные решения)";
$spec195="строительство объектов
Специализация: мастер (строительство автомобильных дорог и аэродромов, строительство мостов, транспортных эстакад и путепроводов)";
$spec275="разработка разделов проектной документации
Специализация; главный инженер проекта (водозаборные скважины)";
$spec249="разработка разделов проектной документации
Специализация: главный специалист, осуществляющий разработку раздела проектной документации (инженерно-технические мероприятия гражданской обороны. Мероприятия по предупреждению чрезвычайных ситуаций)";
$spec197="строительство объектов
Специализация: мастер (устройство магистральных трубопроводов для транспортирования нефти, газа, нефтепродуктов)";
$spec199="строительство объектов
Специализация: мастер (общестроительные работы)";
$spec200="строительство объектов
Специализация: мастер (заполнение оконных и дверных проемов, устройство полов, отделочные работы)";
$spec203="строительство объектов
Специализация: мастер (устройство наружных сетей водоснабжения, канализации, устройство внутренних систем водопровода и канализации)";
$spec204="строительство объектов
Специализация: мастер (устройство внутренних систем водопровода и канализации)";
$spec205="строительство объектов
Специализация: мастер (устройство наружных сетей водоснабжения и канализации)";
$spec209="строительство объектов
Специализация: мастер (строительство транспортных тоннелей, метрополитенов)";
$spec211="строительство объектов
Специализация: мастер (устройство фасадных систем теплоизоляции и облицовка фасадов зданий)";
$spec215="строительство объектов
Специализация: мастер (устройство наружных сетей и линий электроснабжения, трансформаторных подстанций и распределительных устройств, устройство внутренних систем электроснабжения)";
$spec216="строительство объектов
Специализация: мастер (устройство наружных сетей и линий электроснабжения, трансформаторных подстанций и распределительных устройств)";
$spec217="строительство объектов
Специализация: мастер (устройство внутренних систем электроснабжения)";
$spec223="строительство объектов
Специализация: производитель работ (прораб) (строительство автомобильных дорог и аэродромов, строительство мостов, транспортных эстакад и  путепроводов)";
$spec225="строительство объектов
Специализация: производитель работ (прораб) (устройство магистральных трубопроводов для транспортирования нефти, газа, нефтепродуктов)";
$spec231="cтроительство объектов
Специализация: производитель работ (прораб) (устройство наружных сетей водоснабжения, канализации, устройство внутренних систем водопровода и канализации)";
$spec232="cтроительство объектов
Специализация: производитель работ (прораб) (устройство внутренних систем водопровода и канализации)";
$spec233="cтроительство объектов
Специализация: производитель работ (прораб) (устройство наружных сетей водоснабжения и канализации)";
$spec234="строительство объектов
Специализация: производитель работ (прораб)  (устройство внутренних и наружных сетей теплоснабжения, монтаж систем вентиляции и кондиционирования воздуха)";
$spec237="cтроительство объектов
Специализация: производитель работ (прораб) (строительство транспортных тоннелей, метрополитенов)";
$spec239="cтроительство объектов
Специализация: производитель работ (прораб) (устройство фасадных систем теплоизоляции и облицовка фасадов зданий)";
$spec253="выполнение работ по обследованию инженерных сетей и систем
Cпециализация: специалист, осуществляющий обследование наружных и внутренних систем водоснабжения и канализации";
$spec243="cтроительство объектов
Специализация: производитель работ (прораб) (устройство наружных сетей и линий электроснабжения, трансформаторных подстанций и распределительных устройств, устройство внутренних систем электроснабжения)";
$spec245="cтроительство объектов
Специализация: производитель работ (прораб) (устройство наружных сетей и линий электроснабжения, трансформаторных подстанций и распределительных устройств)";
$spec246="строительство объектов
Специализация: производитель работ (прораб) (устройство внутренних систем электроснабжения)";
$spec254="выполнение работ по обследованию инженерных сетей и систем
Cпециализация: специалист, осуществляющий обследование тепловых сетей";
$spec255="выполнение работ по обследованию инженерных сетей и систем
Cпециализация: специалист, осуществляющий обследование систем отопления";
$spec256="выполнение работ по обследованию инженерных сетей и систем
Cпециализация: специалист, осуществляющий обследование систем вентиляции и кондиционирования воздуха";
$spec250="выполнение работ по обследованию автомобильных дорог, мостовых сооружений
Cпециализация: специалист, осуществляющий обследование автомобильных дорог и мостовых сооружений";
$spec257="выполнение работ по обследованию инженерных сетей и систем
Cпециализация: специалист, осуществляющий обследование системы газоснабжения";
$spec258="выполнение работ по обследованию инженерных сетей и систем
Cпециализация: специалист, осуществляющий обследование сетей и систем электроснабжения, силового электрооборудования и электроосвещения";
$spec259="выполнение работ по обследованию инженерных сетей и систем
Cпециализация: специалист, осуществляющий обследование сетей связи и сигнализации";
$spec260="строительство объектов
Специализация: главный инженер (монтаж металлических конструкций, кроме мостов, транспортных эстакад и путепроводов)";
$spec261="строительство объектов
Специализация: главный инженер (монтаж технологических трубопроводов и оборудования)";
$spec262="строительство объектов
Специализация: главный инженер (монтаж систем холодоснабжения)";
$spec263="строительство объектов
Специализация: главный инженер (бурение и обустройство скважин (кроме нефтяных и газовых))";
$spec264="строительство объектов
Специализация: начальник (заместитель начальника) производственно-технического отдела (монтаж металлических конструкций, кроме мостов, транспортных эстакад и путепроводов)";
$spec265="строительство объектов
Специализация: начальник (заместитель начальника) производственно-технического отдела (монтаж технологических трубопроводов и оборудования)";
$spec266="строительство объектов
Специализация: начальник (заместитель начальника) производственно-технического отдела (бурение и обустройство скважин (кроме нефтяных и газовых))";
$spec267="строительство объектов
Специализация: производитель работ (прораб) (монтаж металлических конструкций, кроме мостов, транспортных эстакад и путепроводов)";
$spec268="строительство объектов
Специализация: производитель работ (прораб) (монтаж технологических трубопроводов и оборудования)";
$spec269="строительство объектов
Специализация: производитель работ (прораб) (монтаж систем холодоснабжения)";
$spec270="строительство объектов
Специализация: производитель работ (прораб) (бурение и обустройство скважин (кроме нефтяных и газовых))";
$spec271="строительство объектов
Специализация: мастер (монтаж металлических конструкций, кроме мостов, транспортных эстакад и путепроводов)";
$spec272="строительство объектов
Специализация: мастер (монтаж технологических трубопроводов и оборудования)";
$spec273="строительство объектов
Специализация: мастер (монтаж систем холодоснабжения)";
$spec274="строительство объектов
Специализация: мастер (бурение и обустройство скважин (кроме нефтяных и газовых))";
$spec276="выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов
Специализация: инженер по техническому надзору за строительством (монтаж технологических трубопроводов и оборудования)";
$spec277="выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов
Специализация: инженер по техническому надзору за строительством (устройство систем холодоснабжения)";
//функция преобразования многомерного массива в строку// 
if (!function_exists('multi_implode')) {
	function multi_implode($glue, $array) {
		$_array=array();
		foreach($array as $val)
			$_array[] = is_array($val)? multi_implode($glue, $val) : $val;
		return implode($glue, $_array);
	}
 }

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
$personnel_main_request=views_get_view_result('personal_for_data', $display_id ='page', array($row->nid)); //результат представления personnels_main_request (Фильтр специалисты основной заявки) присваиваем переменной
$types_of_jobs=views_get_view_result('kinds_of_specialties', $display_id ='page', array($row->nid_1)); //результат представления kinds_of_specialties(Фильтр виды работ для сравнения) присваиваем переменной
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
////из полученного массива данных по видам работы извлекаем необходимую информацию/////// 
$vidy10=$types_of_jobs[0]->field_field_vidyrab;
$vidy2=$types_of_jobs[0]->field_field_vidyrab[0][raw];
$vidy3=$vidy2[taxonomy_term]->name;
/////из полученно=го массива данных извлекаем необходимую информацию по специальностям главной заявки////////
for ($i = 0; $i <= count($personnel_main_request); $i++){ 
	$wr1_4=$personnel_main_request[$i]->_field_data[node_field_data_field_sotrrrudn_nid];
	$wr1_5[$i]=$wr1_4[entity]->field_10[und][0][value];
} 
////получение строки из массива по специальностям главной заявки///////
$personnel_main_request_string = implode("</br>", $wr1_5); 
/////получение строки из массива (все специальности сотрудников)/////////
$all_sotrudniki_string = implode("</br> ", $sotrudniki); // получение строки из массива
////////////////////////////////////////////////
$allspec=$personnel_main_request_string;
/////////////////////////////////////////////////////////////////////////
$alltypes=$types_of_jobs3;
function search_types_of_jobs ($alltypes, $type_of_job){
	$avail_type=substr_count($alltypes, $type_of_job);
	return $avail_type;
}
$allspec=$personnel_main_request_string;	 
function searchavailspec($allspec, $spec){
	$avail=substr_count($allspec, $spec);
	return $avail;
}
function countoverzero ($a, $count){
	if ($a>0){
			$count++;	
			}					
	return $count;
}
//////получение в переменную всех видов работ организации из аттестатов///////////
for ($k = 0; $k < count($types_of_jobs); $k++) { 
	$vidy11=$types_of_jobs[$k]->_field_data;
	$vidy12=$vidy11[field_idn_node_nid];
	$vidy13=$vidy12[entity]->field_klasssl;
	$vidy14=$vidy12[entity]->field_serialnumber;
	$vidy15=$vidy12[entity]->field_vmins;
	$category=$vidy13[und][0][value];
	$nomber=$vidy14[und][0][value];
	$vidyrabot1=$vidy15[und][0][value];
    $outdate="2017-05-13";
	print_r("<b>Аттестат:</b> ".$nomber."</br>");
	print_r("<b>Категория:</b> ".$category."</br>");

switch ($category) {
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////CASE 1//////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    case 1:
	if($vidyrabot1 < $outdate){
        for ($i = 0; $i <= count($types_of_jobs[$k]->field_field_vidyrab); $i++) 
		{ 
			$types_of_jobs2=$types_of_jobs[$k]->field_field_vidyrab[$i][raw];
			$types_of_jobs3=$types_of_jobs2[taxonomy_term]->name;
			$vidyrabot[$k][$i]=$types_of_jobs3; // переменная для вывода вне массива
			$condition1=substr_count($types_of_jobs3, $type163);
			print_r ("</br>".$types_of_jobs3."</br>");
		
		switch ($types_of_jobs3) {
        case $type163:
		break;
		
		case $type164:
		if((searchavailspec($allspec, $spec700166)+searchavailspec($allspec, $spec166)+searchavailspec($allspec, $spec173))>=10){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-геодезические изыскания</b> меньше 10</font>";
				}
		break;
		
		case $type165:
			if((searchavailspec($allspec, $spec700167)+searchavailspec($allspec, $spec167)+searchavailspec($allspec, $spec174))>=10){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-геологические изыскания</b> меньше 10</font>";
				}
		break;
		
		case $type166:
			if((searchavailspec($allspec, $spec700168)+searchavailspec($allspec, $spec168))>=10){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-гидрометеорологические изыскания</b> меньше 10</font>";
				}
		break;
		
		case $type167:
			if((searchavailspec($allspec, $spec700169)+searchavailspec($allspec, $spec169))>=10){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-экологические изыскания</b> меньше 10</font>";
				}
		break;
		
		case $type168:
			if((searchavailspec($allspec, $spec700170)+searchavailspec($allspec, $spec170))>=10){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-геотехнические изыскания</b> меньше 10</font>";
				}
		break;
		
		case $type169:
			if((searchavailspec($allspec, $spec171)+searchavailspec($allspec, $spec171))>=10){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>обследование состояния грунтов оснований зданий и сооружений</b> меньше 10</font>";
				}
		break;
		
		case $type170:
			if((searchavailspec($allspec, $spec700064)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3))>=1 or (searchavailspec($allspec, $spec4)+searchavailspec($allspec, $spec148)+searchavailspec($allspec, $spec17700129)+searchavailspec($allspec, $spec129)+searchavailspec($allspec, $spec275))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного специалиста <b>ГАП</b> или <b>ГИП</b></font>";
				}
		break;
		
		case $type171:
			if(
			(searchavailspec($allspec, $spec700101)+
			 searchavailspec($allspec, $spec700102)+
			 searchavailspec($allspec, $spec700103)+
			 searchavailspec($allspec, $spec700104)+
			 searchavailspec($allspec, $spec700105)+
			 searchavailspec($allspec, $spec700106)+
			 searchavailspec($allspec, $spec700107)+
			 searchavailspec($allspec, $spec700108)+
			 searchavailspec($allspec, $spec700109)+
			 searchavailspec($allspec, $spec700162)+
			 searchavailspec($allspec, $spec17700101)+
			 searchavailspec($allspec, $spec17700102)+
			 searchavailspec($allspec, $spec17700103)+
			 searchavailspec($allspec, $spec17700104)+
			 searchavailspec($allspec, $spec17700105)+
			 searchavailspec($allspec, $spec17700106)+
			 searchavailspec($allspec, $spec17700107)+
			 searchavailspec($allspec, $spec17700108)+
			 searchavailspec($allspec, $spec17700109)+
			 searchavailspec($allspec, $spec138)+
			 searchavailspec($allspec, $spec137)+
			 searchavailspec($allspec, $spec162)+
			 searchavailspec($allspec, $spec101)+
			 searchavailspec($allspec, $spec102)+
			 searchavailspec($allspec, $spec103)+
			 searchavailspec($allspec, $spec104)+
			 searchavailspec($allspec, $spec105)+
			 searchavailspec($allspec, $spec106)+
			 searchavailspec($allspec, $spec107)+
			 searchavailspec($allspec, $spec108)+
			 searchavailspec($allspec, $spec109))<1) 
			 {
				echo "<font color=\"ff0000\">Нет ни одного аттестованного <b>начальника (заведующего) структурного подразделения</b></font>";
				}
			elseif	((searchavailspec($allspec, $spec700064)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3))<4 or (searchavailspec($allspec, $spec4)+searchavailspec($allspec, $spec148)+searchavailspec($allspec, $spec17700129)+searchavailspec($allspec, $spec129)+searchavailspec($allspec, $spec275))<4)
             {
				echo "<font color=\"ff0000\">Количество специалистов <b>ГАП</b> или <b>ГИП</b> меньше 4</font>";
				}
			 elseif (searchavailspec($allspec, $spec248)<1)
			{
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста по <b>охране окружающей среды</b></font>";
				} 
			elseif ((searchavailspec($allspec, $spec700164)+searchavailspec($allspec, $spec164))<1)
			{
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста по <b>организации строительства</b></font>";
				} 
			elseif (searchavailspec($allspec, $spec249)<1)
			{
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста по <b>инженерно-техническим мероприятиям гражданской обороны</b></font>";
				}
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
		break;
					
		case $type196:
		break;
		
		case $type197:
			if((searchavailspec($allspec, $spec700163)+searchavailspec($allspec, $spec163))>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (генеральный план)</b></font>";
				}
		break;
		
		case $type198:
			if((searchavailspec($allspec, $spec252)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3)+searchavailspec($allspec, $spec700064))>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (архитектурные решения)</b> либо <b>ГАПа</b></font>";
				}
		break;
		
		case $type199:
			if(searchavailspec($allspec, $spec139)>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (сметная документация)</b></font>";
				}
		break;
		
		case $type200:			
		if((searchavailspec($allspec, $spec66)+searchavailspec($allspec, $spec17700066)+searchavailspec($allspec, $spec700066))>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (конструктивные решения)</b></font>";
				}			
		break;
		
		case $type543:
		break;
		
		case $type5435:
			if((searchavailspec($allspec, $spec17700071)+searchavailspec($allspec, $spec700071)+searchavailspec($allspec, $spec71))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (холодоснабжение))</b></font>";
				}
		break;
		
		case $type5436:
			if((searchavailspec($allspec, $spec17700067)+searchavailspec($allspec, $spec700067)+searchavailspec($allspec, $spec67))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</b></font>";
				}
		break;
		
		case $type5438:
			if((searchavailspec($allspec, $spec17700067)+searchavailspec($allspec, $spec700067)+searchavailspec($allspec, $spec67))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</b></font>";
				}
		break;
		
		case $type5441:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</b></font>";
				}
		break;
		
		case $type5442:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</b></font>";
				}
		break;
		
		case $type5443:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</b></font>";
				}
		break;
		
		case $type5444:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;
		case $type5453:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;
		case $type5454:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;
		
		case $type5439:
			if((searchavailspec($allspec, $spec17700068)+searchavailspec($allspec, $spec700068)+searchavailspec($allspec, $spec68))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (отопление, вентиляция и кондиционирование воздуха))</b></font>";
				}
		break;
		
		case $type5440:
			if((searchavailspec($allspec, $spec17700068)+searchavailspec($allspec, $spec700068)+searchavailspec($allspec, $spec68))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (отопление, вентиляция и кондиционирование воздуха))</b></font>";
				}
		break;	
		
		case $type5437:
			if((searchavailspec($allspec, $spec17700069)+searchavailspec($allspec, $spec700069)+searchavailspec($allspec, $spec69))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</b></font>";
				}
		break;

		case $type5445: /*4.6. наружные сети и системы:*/
		break;
		
		case $type5446:
			if((searchavailspec($allspec, $spec17700070)+searchavailspec($allspec, $spec700070)+searchavailspec($allspec, $spec70))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (тепловые сети))</b></font>";
				}
		break;
		
		case $type5447:
			if((searchavailspec($allspec, $spec700067)+searchavailspec($allspec, $spec67))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</b></font>";
				}
		break;	
		
		case $type5449:
			if((searchavailspec($allspec, $spec700067)+searchavailspec($allspec, $spec67))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</b></font>";
				}
		break;	
		
		case $type5450:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</b></font>";
				}
		break;
		
		case $type5451:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;
		case $type5455:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;
		
		case $type5456:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;		
		
		case $type5448:
			if((searchavailspec($allspec, $spec17700069)+searchavailspec($allspec, $spec700069)+searchavailspec($allspec, $spec69))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</b></font>";
				}
		break;

		case $type202: 
		break;
		
		case $type5457: /*4.8.:*/
		break;
		
		case $type5459:
				if(searchavailspec($allspec, $spec249)>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерно-технические мероприятия гражданской обороны. Мероприятия по предупреждению чрезвычайных ситуаций)</b></font>";
				}
		break;
		case $type5460:
				if(searchavailspec($allspec, $spec249)>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерно-технические мероприятия гражданской обороны. Мероприятия по предупреждению чрезвычайных ситуаций)</b></font>";
				}
		break;
		case $type5461:
				if(searchavailspec($allspec, $spec249)>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерно-технические мероприятия гражданской обороны. Мероприятия по предупреждению чрезвычайных ситуаций)</b></font>";
				}
		break;
		
		case $type5462:
			if((searchavailspec($allspec, $spec700164)+searchavailspec($allspec, $spec164))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (организация строительства)</b></font>";
				}
		break;
		
		case $type5458:
			if(searchavailspec($allspec, $spec248)>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (охрана окружающей среды)</b></font>";
				}
		break;		
		
		case $type205:/*5. Выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов первого-четвертого классов сложности*/
		break;
		
		case $type206:
		break;
		
		case $type207:
				$count=0;
				$count=countoverzero(searchavailspec($allspec, $spec17700024),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700024),$count);
				$count=countoverzero(searchavailspec($allspec, $spec144),$count);
				$count=countoverzero(searchavailspec($allspec, $spec145),$count);
				$count=countoverzero(searchavailspec($allspec, $spec146),$count);
				$count=countoverzero(searchavailspec($allspec, $spec24),$count);				
				$count=countoverzero(searchavailspec($allspec, $spec17700026),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700026),$count);
				$count=countoverzero(searchavailspec($allspec, $spec26),$count);
				$count=countoverzero(searchavailspec($allspec, $spec277),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700095),$count);
				$count=countoverzero(searchavailspec($allspec, $spec95),$count);
				$count=countoverzero(searchavailspec($allspec, $spec57),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700057),$count);				
				$count=countoverzero(searchavailspec($allspec, $spec17700030),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700030),$count);
				$count=countoverzero(searchavailspec($allspec, $spec30),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec17700097),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700097),$count);
				$count=countoverzero(searchavailspec($allspec, $spec97),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec17700033),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700033),$count);
				$count=countoverzero(searchavailspec($allspec, $spec33),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec17700084),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700084),$count);
				$count=countoverzero(searchavailspec($allspec, $spec84),$count);				
				$count=countoverzero(searchavailspec($allspec, $spec17700085),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700085),$count);
				$count=countoverzero(searchavailspec($allspec, $spec85),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec34),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700034),$count);
				$count=countoverzero(searchavailspec($allspec, $spec113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec20113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec710113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec276),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700061),$count);
				$count=countoverzero(searchavailspec($allspec, $spec17700061),$count);
				$count=countoverzero(searchavailspec($allspec, $spec61),$count);
				
		if((searchavailspec($allspec, $spec40)+searchavailspec($allspec, $spec700187)+searchavailspec($allspec, $spec188)+searchavailspec($allspec, $spec189)+searchavailspec($allspec, $spec187))<3)
		{
				echo "<font color=\"ff0000\">Количество руководителей проекта меньше 3</font>";
				}		
				
		elseif	($count<8)
				{
				echo "<font color=\"ff0000\">Количество специалистов по техническому надзору меньше 8</font>";
				}
					
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";		
				}
		break;
		
		case $type208:
		if((searchavailspec($allspec, $spec700024)+
		searchavailspec($allspec, $spec144)+
		searchavailspec($allspec, $spec145)+
		searchavailspec($allspec, $spec146)+
		searchavailspec($allspec, $spec24)+
		searchavailspec($allspec, $spec17700024))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (общестроительные работы)</b></font>";
				}
		break;
		
		case $type209:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec17700026))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</b></font>";
				}
		break;
		
		case $type210:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec17700026))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</b></font>";
				}
		break;
		
		case $type211:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec17700026)+
		searchavailspec($allspec, $spec95)+
		searchavailspec($allspec, $spec700095))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</b></font>";
				}
		break;
		
		case $type212:
		if((searchavailspec($allspec, $spec700057)+
		searchavailspec($allspec, $spec57))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области газоснабжения)</b></font>";
				}
		break;

		case $type213:
		if((searchavailspec($allspec, $spec700030)+
		searchavailspec($allspec, $spec30)+
		searchavailspec($allspec, $spec17700030))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области электроснабжения и автоматизации)</b></font>";
				}
		break;

		case $type214:
		if((searchavailspec($allspec, $spec700097)+
		searchavailspec($allspec, $spec97)+
		searchavailspec($allspec, $spec17700097))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области связи, сигнализации)</b></font>";
				}
		break;

		case $type215:
		if((searchavailspec($allspec, $spec700033)+
		searchavailspec($allspec, $spec33)+
		searchavailspec($allspec, $spec17700033))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (строительство автомобильных дорог и аэродромов, строительство мостов, транспортных эстакад и путепроводов)</b></font>";
				}
		break;

		case $type216:
		if((searchavailspec($allspec, $spec700084)+
		searchavailspec($allspec, $spec84)+
		searchavailspec($allspec, $spec17700084))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (строительство железных дорог)</b></font>";
				}
		break;

		case $type217:
		if((searchavailspec($allspec, $spec700085)+
		searchavailspec($allspec, $spec85)+
		searchavailspec($allspec, $spec17700085))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (строительство сооружений транспортных тоннелей, метрополитенов)</b></font>";
				}
		break;

		case $type218:
		if((searchavailspec($allspec, $spec700034)+
		searchavailspec($allspec, $spec34))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (гидротехническое и мелиоративное строительство)</b></font>";
				}
		break;

		case $type219:
		if((searchavailspec($allspec, $spec710113)+
		searchavailspec($allspec, $spec20113)+
		searchavailspec($allspec, $spec700113)+
		searchavailspec($allspec, $spec113))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (благоустройство территорий)</b></font>";
				}
		break;

		
		case $type220:
		if((searchavailspec($allspec, $spec700064)+
		searchavailspec($allspec, $spec3)+
		searchavailspec($allspec, $spec64))>=4 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов <b>ГАП</b> меньше 4</font>";
				}
		break;
		
		case $type221:
		break;
		
		case $type222:
		break;
		
		case $type223:
		break;
		
		case $type224:
		break;
		
		case $type225:
		break;
		
		case $type226:
		break;
		
		case $type227:
		if((searchavailspec($allspec, $spec71043)+
		searchavailspec($allspec, $spec71044)+
		searchavailspec($allspec, $spec71045)+
		searchavailspec($allspec, $spec71039)+
		searchavailspec($allspec, $spec71046)+
		searchavailspec($allspec, $spec71048)+
		searchavailspec($allspec, $spec71047)+
		searchavailspec($allspec, $spec71059)+
		searchavailspec($allspec, $spec71063)+
		searchavailspec($allspec, $spec71074)+
		searchavailspec($allspec, $spec700128)+
		searchavailspec($allspec, $spec700047)+
		searchavailspec($allspec, $spec710128)+
		searchavailspec($allspec, $spec700048)+
		searchavailspec($allspec, $spec700045)+
		searchavailspec($allspec, $spec700046)+
		searchavailspec($allspec, $spec700073)+
		searchavailspec($allspec, $spec700059)+
		searchavailspec($allspec, $spec700039)+
		searchavailspec($allspec, $spec700126)+
		searchavailspec($allspec, $spec700043)+
		searchavailspec($allspec, $spec700096)+
		searchavailspec($allspec, $spec700074)+
		searchavailspec($allspec, $spec700063)+
		searchavailspec($allspec, $spec700044)+
		searchavailspec($allspec, $spec150)+
		searchavailspec($allspec, $spec17700043)+
		searchavailspec($allspec, $spec17700044)+
		searchavailspec($allspec, $spec45)+
		searchavailspec($allspec, $spec39)+
		searchavailspec($allspec, $spec17700046)+
		searchavailspec($allspec, $spec17700048)+
		searchavailspec($allspec, $spec17700047)+
		searchavailspec($allspec, $spec17700059)+
		searchavailspec($allspec, $spec63)+
		searchavailspec($allspec, $spec73)+
		searchavailspec($allspec, $spec96)+
		searchavailspec($allspec, $spec17700074)+
		searchavailspec($allspec, $spec126)+
		searchavailspec($allspec, $spec128)+
		searchavailspec($allspec, $spec278)+
		searchavailspec($allspec, $spec43)+
		searchavailspec($allspec, $spec44)+
		searchavailspec($allspec, $spec46)+
		searchavailspec($allspec, $spec48)+
		searchavailspec($allspec, $spec47)+
		searchavailspec($allspec, $spec59)+
		searchavailspec($allspec, $spec74)+
		searchavailspec($allspec, $spec260)+
		searchavailspec($allspec, $spec261)+
		searchavailspec($allspec, $spec262)+
		searchavailspec($allspec, $spec263))<1)
		{
				echo "<font color=\"ff0000\">Нет ни одного <b>главного инженера</b></font>";
				}					
		elseif	
		((searchavailspec($allspec, $spec710114)+
		searchavailspec($allspec, $spec710115)+
		searchavailspec($allspec, $spec710116)+
		searchavailspec($allspec, $spec710117)+
		searchavailspec($allspec, $spec710118)+
		searchavailspec($allspec, $spec710119)+
		searchavailspec($allspec, $spec710120)+
		searchavailspec($allspec, $spec710121)+
		searchavailspec($allspec, $spec710122)+
		searchavailspec($allspec, $spec710123)+
		searchavailspec($allspec, $spec710124)+
		searchavailspec($allspec, $spec710125)+
		searchavailspec($allspec, $spec700120)+
		searchavailspec($allspec, $spec700115)+
		searchavailspec($allspec, $spec700122)+
		searchavailspec($allspec, $spec700124)+
		searchavailspec($allspec, $spec700125)+
		searchavailspec($allspec, $spec700114)+
		searchavailspec($allspec, $spec700117)+
		searchavailspec($allspec, $spec700121)+
		searchavailspec($allspec, $spec700123)+
		searchavailspec($allspec, $spec700118)+
		searchavailspec($allspec, $spec700116)+
		searchavailspec($allspec, $spec700119)+
		searchavailspec($allspec, $spec700147)+
		searchavailspec($allspec, $spec247)+
		searchavailspec($allspec, $spec147)+
		searchavailspec($allspec, $spec17700114)+
		searchavailspec($allspec, $spec17700115)+
		searchavailspec($allspec, $spec116)+
		searchavailspec($allspec, $spec117)+
		searchavailspec($allspec, $spec17700118)+
		searchavailspec($allspec, $spec119)+
		searchavailspec($allspec, $spec17700120)+
		searchavailspec($allspec, $spec17700121)+
		searchavailspec($allspec, $spec122)+
		searchavailspec($allspec, $spec123)+
		searchavailspec($allspec, $spec17700124)+
		searchavailspec($allspec, $spec125)+
		searchavailspec($allspec, $spec114)+
		searchavailspec($allspec, $spec115)+
		searchavailspec($allspec, $spec118)+
		searchavailspec($allspec, $spec120)+
		searchavailspec($allspec, $spec121)+
		searchavailspec($allspec, $spec124)+
		searchavailspec($allspec, $spec264)+
		searchavailspec($allspec, $spec265)+
		searchavailspec($allspec, $spec266))<1)
		
				{
				echo "<font color=\"ff0000\">Нет ни одного <b>начальника (заместителя) ПТО</b></font>";
				}
		elseif	
		((searchavailspec($allspec, $spec700141)+
		searchavailspec($allspec, $spec141))<1)
		
				{
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по сметной работе</b></font>";
				}			
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";		
				}
		break;
		
		case $type228:
		break;
		
		case $type229:
				if((searchavailspec($allspec, $spec140)+searchavailspec($allspec, $spec142)+
				searchavailspec($allspec, $spec700140)+searchavailspec($allspec, $spec700142))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>главного или ведущего геодезиста</b></font>";
				}
		break;
		
		case $type230:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type231:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec15)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec16)+searchavailspec($allspec, $spec76)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec78)+
				searchavailspec($allspec, $spec79)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec81)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700216)+searchavailspec($allspec, $spec17700243)+
				searchavailspec($allspec, $spec17700245)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec245)+searchavailspec($allspec, $spec205)+
				searchavailspec($allspec, $spec231)+searchavailspec($allspec, $spec233)+
				searchavailspec($allspec, $spec234)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec215)+
				searchavailspec($allspec, $spec216)+searchavailspec($allspec, $spec243))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type232:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec17700195)+searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec224)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700237)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type233:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type234:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type235:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type236:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec41)
					+searchavailspec($allspec, $spec82)+searchavailspec($allspec, $spec203)
				+searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)
				+searchavailspec($allspec, $spec224)+searchavailspec($allspec, $spec196)
				+searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec222)
				+searchavailspec($allspec, $spec17700203)+searchavailspec($allspec, $spec17700231)
				+searchavailspec($allspec, $spec231)+searchavailspec($allspec, $spec237)
				+searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223)
				+searchavailspec($allspec, $spec11))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type237:
				if((searchavailspec($allspec, $spec11)+searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec0)+
				searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec16)+searchavailspec($allspec, $spec76)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec78)+
				searchavailspec($allspec, $spec79)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec81)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700205)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec226)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec206)+searchavailspec($allspec, $spec208)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec17700243)+
				searchavailspec($allspec, $spec17700245)+searchavailspec($allspec, $spec17700215)+
				searchavailspec($allspec, $spec17700216)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec203)+searchavailspec($allspec, $spec205)+
				searchavailspec($allspec, $spec231)+searchavailspec($allspec, $spec233)+
				searchavailspec($allspec, $spec234)+searchavailspec($allspec, $spec215)+
				searchavailspec($allspec, $spec216)+searchavailspec($allspec, $spec243)+
				searchavailspec($allspec, $spec245)+searchavailspec($allspec, $spec195))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type238:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;			
		
		case $type239:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec196))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type240:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec267)+searchavailspec($allspec, $spec271))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type241:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type242:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type243:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type244:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type245:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec76)+searchavailspec($allspec, $spec77)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec17700195)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700197)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec17700203)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec197)+searchavailspec($allspec, $spec225)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec205)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec233)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type246:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type247:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

	
		case $type248:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec110)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700211)+searchavailspec($allspec, $spec17700239)+
				searchavailspec($allspec, $spec211)+searchavailspec($allspec, $spec239)+				
				searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type249:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type250:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type251:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type252:
				if((searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec76)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec17700205)+searchavailspec($allspec, $spec17700231)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec212)+
				searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec205)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec235))>=1){
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
				
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))>=1)	
			{
				echo "<font color=\"ff0000\">Нет обязательных<b>аттестованных специалистов</b></font>";
				}	
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
		break;	

		case $type253:
				if((searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec17700204)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700232)+
				searchavailspec($allspec, $spec204)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec232))>=1){
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))>=1)	
			{
				echo "<font color=\"ff0000\">Нет обязательных<b>аттестованных специалистов</b></font>";
				}	
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
		break;
		
		case $type254:
				if((searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec234))>=1){
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))>=1)	
			{
				echo "<font color=\"ff0000\">Нет обязательных<b>аттестованных специалистов</b></font>";
				}	
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
		break;		
		
		case $type255:
				if((searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec207)+searchavailspec($allspec, $spec234))>=1){
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))>=1)	
			{
				echo "<font color=\"ff0000\">Нет обязательных<b>аттестованных специалистов</b></font>";
				}	
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
		break;		
		
		case $type256:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec17700216)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700245)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec245)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec216))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;

		case $type257:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec81)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700246)+
				searchavailspec($allspec, $spec17700217)+searchavailspec($allspec, $spec17700215)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec217)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec246))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type258:
		break;		
		
		case $type259:
				if((searchavailspec($allspec, $spec13)+searchavailspec($allspec, $spec193)+searchavailspec($allspec, $spec221))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type260:
				if((searchavailspec($allspec, $spec0)+searchavailspec($allspec, $spec16)+
				searchavailspec($allspec, $spec218)+searchavailspec($allspec, $spec244))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type261:
				if((searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec206)+searchavailspec($allspec, $spec207)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec234))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type262:
				if((searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type263:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type264:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type265:
				if((searchavailspec($allspec, $spec710112)+searchavailspec($allspec, $spec112)+
				searchavailspec($allspec, $spec20112)+searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec220))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;			
		
		case $type266:
				if((searchavailspec($allspec, $spec82)+searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec224))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;			
		
		case $type267:
				if((searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700237)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type268:
		break;		
		
		case $type269:
		break;		


		case $type270:
						if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)
					+searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type271:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type272:
				if((searchavailspec($allspec, $spec700093)+searchavailspec($allspec, $spec700135)
					+searchavailspec($allspec, $spec800135)+searchavailspec($allspec, $spec93)+
				searchavailspec($allspec, $spec17700135))>=5){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
				else {
				echo "<font color=\"ff0000\">Не достаточно <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		
		case $type273:
				if(searchavailspec($allspec, $spec250)>=5){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
				else {
				echo "<font color=\"ff0000\">Не достаточно специалистов, осуществляющих <b>обследование автомобильных дорог и мостовых сооружений</b></font>";
				}
		break;
		
		
        case $type274:
				if((searchavailspec($allspec, $spec253)+searchavailspec($allspec, $spec254)
					+searchavailspec($allspec, $spec255)+searchavailspec($allspec, $spec256)+
				searchavailspec($allspec, $spec257)+searchavailspec($allspec, $spec258)
				+searchavailspec($allspec, $spec259))>=5){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
				else {
				echo "<font color=\"ff0000\">Не достаточно <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		
		}
			
		}

	}
	else{	

for ($i = 0; $i <= count($types_of_jobs[$k]->field_field_vidy_rabot_13_05_2017_); $i++) 
		{ 
			$types_of_jobs2=$types_of_jobs[$k]->field_field_vidy_rabot_13_05_2017_[$i][raw];
			$types_of_jobs3=$types_of_jobs2[taxonomy_term]->name;
			$vidyrabot[$k][$i]=$types_of_jobs3; // переменная для вывода вне массива
			$condition2=substr_count($types_of_jobs3, $type5594);
			print_r ("</br>".$types_of_jobs3."</br>");
		
		switch ($types_of_jobs3) {
case $type5594:
		break;
		
		case $type5595:
		if((searchavailspec($allspec, $spec700166)+searchavailspec($allspec, $spec166)+searchavailspec($allspec, $spec173))>=10){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-геодезические изыскания</b> меньше 10</font>";
				}
		break;		
			
		case $type5616:
			if((searchavailspec($allspec, $spec700167)+searchavailspec($allspec, $spec167)+searchavailspec($allspec, $spec174))>=10){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-геологические изыскания</b> меньше 10</font>";
				}
		break;		
		
		case $type5625:
			if((searchavailspec($allspec, $spec700168)+searchavailspec($allspec, $spec168))>=10){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-гидрометеорологические изыскания</b> меньше 10</font>";
				}
		break;		
			
		case $type5630:
			if((searchavailspec($allspec, $spec700169)+searchavailspec($allspec, $spec169))>=10){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-экологические изыскания</b> меньше 10</font>";
				}
		break;		
		
		case $type5647:
			if((searchavailspec($allspec, $spec700170)+searchavailspec($allspec, $spec170))>=10){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-геотехнические изыскания</b> меньше 10</font>";
				}
		break;	

       case $type5648:
	   break;
	   case $type5649:
	   break;
	   case $type5650:
	   break;
	   case $type5651:
	   break;
	   case $type5652:
	   break;
	   case $type5653:
	   break;
		
		case $type5654:
			if((searchavailspec($allspec, $spec171)+searchavailspec($allspec, $spec171))>=10){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>обследование состояния грунтов оснований зданий и сооружений</b> меньше 10</font>";
				}
		break;	
			
		case $type5655:
			if((searchavailspec($allspec, $spec700064)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3))>=1 or (searchavailspec($allspec, $spec4)+searchavailspec($allspec, $spec148)+searchavailspec($allspec, $spec17700129)+searchavailspec($allspec, $spec129)+searchavailspec($allspec, $spec275))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного специалиста <b>ГАП</b> или <b>ГИП</b></font>";
				}
		break;		
			
		case $type5656:
			if(
			(searchavailspec($allspec, $spec700101)+
			 searchavailspec($allspec, $spec700102)+
			 searchavailspec($allspec, $spec700103)+
			 searchavailspec($allspec, $spec700104)+
			 searchavailspec($allspec, $spec700105)+
			 searchavailspec($allspec, $spec700106)+
			 searchavailspec($allspec, $spec700107)+
			 searchavailspec($allspec, $spec700108)+
			 searchavailspec($allspec, $spec700109)+
			 searchavailspec($allspec, $spec700162)+
			 searchavailspec($allspec, $spec17700101)+
			 searchavailspec($allspec, $spec17700102)+
			 searchavailspec($allspec, $spec17700103)+
			 searchavailspec($allspec, $spec17700104)+
			 searchavailspec($allspec, $spec17700105)+
			 searchavailspec($allspec, $spec17700106)+
			 searchavailspec($allspec, $spec17700107)+
			 searchavailspec($allspec, $spec17700108)+
			 searchavailspec($allspec, $spec17700109)+
			 searchavailspec($allspec, $spec138)+
			 searchavailspec($allspec, $spec137)+
			 searchavailspec($allspec, $spec162)+
			 searchavailspec($allspec, $spec101)+
			 searchavailspec($allspec, $spec102)+
			 searchavailspec($allspec, $spec103)+
			 searchavailspec($allspec, $spec104)+
			 searchavailspec($allspec, $spec105)+
			 searchavailspec($allspec, $spec106)+
			 searchavailspec($allspec, $spec107)+
			 searchavailspec($allspec, $spec108)+
			 searchavailspec($allspec, $spec109))<1) 
			 {
				echo "<font color=\"ff0000\">Нет ни одного аттестованного <b>начальника (заведующего) структурного подразделения</b></font>";
				}
			elseif	((searchavailspec($allspec, $spec700064)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3))<4 or (searchavailspec($allspec, $spec4)+searchavailspec($allspec, $spec148)+searchavailspec($allspec, $spec17700129)+searchavailspec($allspec, $spec129)+searchavailspec($allspec, $spec275))<4)
             {
				echo "<font color=\"ff0000\">Количество специалистов <b>ГАП</b> или <b>ГИП</b> меньше 4</font>";
				}
			 elseif (searchavailspec($allspec, $spec248)<1)
			{
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста по <b>охране окружающей среды</b></font>";
				} 
			elseif ((searchavailspec($allspec, $spec700164)+searchavailspec($allspec, $spec164))<1)
			{
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста по <b>организации строительства</b></font>";
				} 
			elseif (searchavailspec($allspec, $spec249)<1)
			{
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста по <b>инженерно-техническим мероприятиям гражданской обороны</b></font>";
				}
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
		break;		
		
		case $type5658:
			if((searchavailspec($allspec, $spec700163)+searchavailspec($allspec, $spec163))>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (генеральный план)</b></font>";
				}
		break;		
			
		case $type5659:
			if((searchavailspec($allspec, $spec252)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3)+searchavailspec($allspec, $spec700064))>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (архитектурные решения)</b> либо <b>ГАПа</b></font>";
				}
		break;		
				
		case $type5660:
			if(searchavailspec($allspec, $spec139)>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (сметная документация)</b></font>";
				}
		break;		
		
		case $type5661:
		if((searchavailspec($allspec, $spec66)+searchavailspec($allspec, $spec17700066)+searchavailspec($allspec, $spec700066))>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (конструктивные решения)</b></font>";
				}			
		break;		
		
		case $type5662:
		break;
		
		case $type5664:
			if((searchavailspec($allspec, $spec17700071)+searchavailspec($allspec, $spec700071)+searchavailspec($allspec, $spec71))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (холодоснабжение))</b></font>";
				}
		break;		
				
		case type5665:
			if((searchavailspec($allspec, $spec17700067)+searchavailspec($allspec, $spec700067)+searchavailspec($allspec, $spec67))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</b></font>";
				}
		break;		
		
		case $type5666:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</b></font>";
				}
		break;
				
		case $type5667:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;		
		
		case $type5663:
			if((searchavailspec($allspec, $spec17700068)+searchavailspec($allspec, $spec700068)+searchavailspec($allspec, $spec68))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (отопление, вентиляция и кондиционирование воздуха))</b></font>";
				}
		break;		
				
		case $type5669:
			if((searchavailspec($allspec, $spec17700069)+searchavailspec($allspec, $spec700069)+searchavailspec($allspec, $spec69))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</b></font>";
				}
		break;
		
		case $type5670:
		break;			
		
		case $type5671:
			if((searchavailspec($allspec, $spec17700070)+searchavailspec($allspec, $spec700070)+searchavailspec($allspec, $spec70))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (тепловые сети))</b></font>";
				}
		break;		
			
		case $type5672:
			if((searchavailspec($allspec, $spec700067)+searchavailspec($allspec, $spec67))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</b></font>";
				}
		break;		
		
		case $type5673:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</b></font>";
				}
		break;		
		
		case $type5674:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;

		case $type5675:
			if((searchavailspec($allspec, $spec17700069)+searchavailspec($allspec, $spec700069)+searchavailspec($allspec, $spec69))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</b></font>";
				}
		break;		
		
		case $type5676: 
		break;
		
		case $type5678:
			if((searchavailspec($allspec, $spec700164)+searchavailspec($allspec, $spec164))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (организация строительства)</b></font>";
				}
		break;		
		
		case $type5679:
			if(searchavailspec($allspec, $spec248)>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (охрана окружающей среды)</b></font>";
				}
		break;		

		case $type5680:
		break;
		
		case $type5681:
		break;
		
		case $type5682:
				$count=0;
				$count=countoverzero(searchavailspec($allspec, $spec17700024),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700024),$count);
				$count=countoverzero(searchavailspec($allspec, $spec144),$count);
				$count=countoverzero(searchavailspec($allspec, $spec145),$count);
				$count=countoverzero(searchavailspec($allspec, $spec146),$count);
				$count=countoverzero(searchavailspec($allspec, $spec24),$count);				
				$count=countoverzero(searchavailspec($allspec, $spec17700026),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700026),$count);
				$count=countoverzero(searchavailspec($allspec, $spec26),$count);
				$count=countoverzero(searchavailspec($allspec, $spec277),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700095),$count);
				$count=countoverzero(searchavailspec($allspec, $spec95),$count);
				$count=countoverzero(searchavailspec($allspec, $spec57),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700057),$count);				
				$count=countoverzero(searchavailspec($allspec, $spec17700030),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700030),$count);
				$count=countoverzero(searchavailspec($allspec, $spec30),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec17700097),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700097),$count);
				$count=countoverzero(searchavailspec($allspec, $spec97),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec17700033),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700033),$count);
				$count=countoverzero(searchavailspec($allspec, $spec33),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec17700084),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700084),$count);
				$count=countoverzero(searchavailspec($allspec, $spec84),$count);				
				$count=countoverzero(searchavailspec($allspec, $spec17700085),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700085),$count);
				$count=countoverzero(searchavailspec($allspec, $spec85),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec34),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700034),$count);
				$count=countoverzero(searchavailspec($allspec, $spec113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec20113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec710113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec276),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700061),$count);
				$count=countoverzero(searchavailspec($allspec, $spec17700061),$count);
				$count=countoverzero(searchavailspec($allspec, $spec61),$count);
				
		if((searchavailspec($allspec, $spec40)+searchavailspec($allspec, $spec700187)+searchavailspec($allspec, $spec188)+searchavailspec($allspec, $spec189)+searchavailspec($allspec, $spec187))<3)
		{
				echo "<font color=\"ff0000\">Количество руководителей проекта меньше 3</font>";
				}		
				
		elseif	($count<8)
				{
				echo "<font color=\"ff0000\">Количество специалистов по техническому надзору меньше 8</font>";
				}
					
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";		
				}
		break;		
		
		case $type5683:
		if((searchavailspec($allspec, $spec700024)+
		searchavailspec($allspec, $spec144)+
		searchavailspec($allspec, $spec145)+
		searchavailspec($allspec, $spec146)+
		searchavailspec($allspec, $spec24)+
		searchavailspec($allspec, $spec17700024))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (общестроительные работы)</b></font>";
				}
		break;		
		
		case $type5684:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec17700026))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</b></font>";
				}
		break;		
		
		case $type5685:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec17700026))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</b></font>";
				}
		break;		
		
		case $type5686:
		if(
		searchavailspec($allspec, $spec277)>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (устройство систем холодоснабжения)</b></font>";
				}
		break;			
		
		case $type5687:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec17700026)+
		searchavailspec($allspec, $spec95)+
		searchavailspec($allspec, $spec700095))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</b></font>";
				}
		break;		
		
		case $type5688:
		if((searchavailspec($allspec, $spec700057)+
		searchavailspec($allspec, $spec57))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области газоснабжения)</b></font>";
				}
		break;
		
		case $type5689:
		if((searchavailspec($allspec, $spec700030)+
		searchavailspec($allspec, $spec30)+
		searchavailspec($allspec, $spec17700030))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области электроснабжения и автоматизации)</b></font>";
				}
		break;	
				
		case $type5690:
		if((searchavailspec($allspec, $spec700097)+
		searchavailspec($allspec, $spec97)+
		searchavailspec($allspec, $spec17700097))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области связи, сигнализации)</b></font>";
				}
		break;	
		
		case $type5691:
		if((searchavailspec($allspec, $spec700033)+
		searchavailspec($allspec, $spec33)+
		searchavailspec($allspec, $spec17700033))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (строительство автомобильных дорог и аэродромов, строительство мостов, транспортных эстакад и путепроводов)</b></font>";
				}
		break;		
		
		case $type5692:
		if((searchavailspec($allspec, $spec700084)+
		searchavailspec($allspec, $spec84)+
		searchavailspec($allspec, $spec17700084))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (строительство железных дорог)</b></font>";
				}
		break;		
		
		case $type5693:
		if((searchavailspec($allspec, $spec700085)+
		searchavailspec($allspec, $spec85)+
		searchavailspec($allspec, $spec17700085))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (строительство сооружений транспортных тоннелей, метрополитенов)</b></font>";
				}
		break;	
		
		case $type5694:
		if((searchavailspec($allspec, $spec700034)+
		searchavailspec($allspec, $spec34))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (гидротехническое и мелиоративное строительство)</b></font>";
				}
		break;	
		
		case $type5695:
		if((searchavailspec($allspec, $spec710113)+
		searchavailspec($allspec, $spec20113)+
		searchavailspec($allspec, $spec700113)+
		searchavailspec($allspec, $spec113))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (благоустройство территорий)</b></font>";
				}
		break;		
		
		
		case $type5696:
		if(searchavailspec($allspec, $spec276)>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (монтаж технологических трубопроводов и оборудования)</b></font>";
				}
		break;		

		case $type5697:
		if((searchavailspec($allspec, $spec700061)+
		searchavailspec($allspec, $spec17700061)+
		searchavailspec($allspec, $spec61))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (устройство магистральных трубопроводов для транспортирования нефти, газа, нефтепродуктов)</b></font>";
				}
		break;		
		
		case $type5698:
		if((searchavailspec($allspec, $spec700064)+
		searchavailspec($allspec, $spec3)+
		searchavailspec($allspec, $spec64))>=4 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов <b>ГАП</b> меньше 4</font>";
				}
		break;		
		
		case $type5699:
		break;		
		
		case $type5700:
		break;	
		
		case $type5701:
		break;
		
		case $type5702:
		break;
		
		case $type5703:
		break;
		
		case $type5704:
		break;
			
		case $type5705:
		break;
		
		case $type5706:
		if((searchavailspec($allspec, $spec71043)+
		searchavailspec($allspec, $spec71044)+
		searchavailspec($allspec, $spec71045)+
		searchavailspec($allspec, $spec71039)+
		searchavailspec($allspec, $spec71046)+
		searchavailspec($allspec, $spec71048)+
		searchavailspec($allspec, $spec71047)+
		searchavailspec($allspec, $spec71059)+
		searchavailspec($allspec, $spec71063)+
		searchavailspec($allspec, $spec71074)+
		searchavailspec($allspec, $spec700128)+
		searchavailspec($allspec, $spec700047)+
		searchavailspec($allspec, $spec710128)+
		searchavailspec($allspec, $spec700048)+
		searchavailspec($allspec, $spec700045)+
		searchavailspec($allspec, $spec700046)+
		searchavailspec($allspec, $spec700073)+
		searchavailspec($allspec, $spec700059)+
		searchavailspec($allspec, $spec700039)+
		searchavailspec($allspec, $spec700126)+
		searchavailspec($allspec, $spec700043)+
		searchavailspec($allspec, $spec700096)+
		searchavailspec($allspec, $spec700074)+
		searchavailspec($allspec, $spec700063)+
		searchavailspec($allspec, $spec700044)+
		searchavailspec($allspec, $spec150)+
		searchavailspec($allspec, $spec17700043)+
		searchavailspec($allspec, $spec17700044)+
		searchavailspec($allspec, $spec45)+
		searchavailspec($allspec, $spec39)+
		searchavailspec($allspec, $spec17700046)+
		searchavailspec($allspec, $spec17700048)+
		searchavailspec($allspec, $spec17700047)+
		searchavailspec($allspec, $spec17700059)+
		searchavailspec($allspec, $spec63)+
		searchavailspec($allspec, $spec73)+
		searchavailspec($allspec, $spec96)+
		searchavailspec($allspec, $spec17700074)+
		searchavailspec($allspec, $spec126)+
		searchavailspec($allspec, $spec128)+
		searchavailspec($allspec, $spec278)+
		searchavailspec($allspec, $spec43)+
		searchavailspec($allspec, $spec44)+
		searchavailspec($allspec, $spec46)+
		searchavailspec($allspec, $spec48)+
		searchavailspec($allspec, $spec47)+
		searchavailspec($allspec, $spec59)+
		searchavailspec($allspec, $spec74)+
		searchavailspec($allspec, $spec260)+
		searchavailspec($allspec, $spec261)+
		searchavailspec($allspec, $spec262)+
		searchavailspec($allspec, $spec263))<1)
		{
				echo "<font color=\"ff0000\">Нет ни одного <b>главного инженера</b></font>";
				}					
		elseif	
		((searchavailspec($allspec, $spec710114)+
		searchavailspec($allspec, $spec710115)+
		searchavailspec($allspec, $spec710116)+
		searchavailspec($allspec, $spec710117)+
		searchavailspec($allspec, $spec710118)+
		searchavailspec($allspec, $spec710119)+
		searchavailspec($allspec, $spec710120)+
		searchavailspec($allspec, $spec710121)+
		searchavailspec($allspec, $spec710122)+
		searchavailspec($allspec, $spec710123)+
		searchavailspec($allspec, $spec710124)+
		searchavailspec($allspec, $spec710125)+
		searchavailspec($allspec, $spec700120)+
		searchavailspec($allspec, $spec700115)+
		searchavailspec($allspec, $spec700122)+
		searchavailspec($allspec, $spec700124)+
		searchavailspec($allspec, $spec700125)+
		searchavailspec($allspec, $spec700114)+
		searchavailspec($allspec, $spec700117)+
		searchavailspec($allspec, $spec700121)+
		searchavailspec($allspec, $spec700123)+
		searchavailspec($allspec, $spec700118)+
		searchavailspec($allspec, $spec700116)+
		searchavailspec($allspec, $spec700119)+
		searchavailspec($allspec, $spec700147)+
		searchavailspec($allspec, $spec247)+
		searchavailspec($allspec, $spec147)+
		searchavailspec($allspec, $spec17700114)+
		searchavailspec($allspec, $spec17700115)+
		searchavailspec($allspec, $spec116)+
		searchavailspec($allspec, $spec117)+
		searchavailspec($allspec, $spec17700118)+
		searchavailspec($allspec, $spec119)+
		searchavailspec($allspec, $spec17700120)+
		searchavailspec($allspec, $spec17700121)+
		searchavailspec($allspec, $spec122)+
		searchavailspec($allspec, $spec123)+
		searchavailspec($allspec, $spec17700124)+
		searchavailspec($allspec, $spec125)+
		searchavailspec($allspec, $spec114)+
		searchavailspec($allspec, $spec115)+
		searchavailspec($allspec, $spec118)+
		searchavailspec($allspec, $spec120)+
		searchavailspec($allspec, $spec121)+
		searchavailspec($allspec, $spec124)+
		searchavailspec($allspec, $spec264)+
		searchavailspec($allspec, $spec265)+
		searchavailspec($allspec, $spec266))<1)
		
				{
				echo "<font color=\"ff0000\">Нет ни одного <b>начальника (заместителя) ПТО</b></font>";
				}
		elseif	
		((searchavailspec($allspec, $spec700141)+
		searchavailspec($allspec, $spec141))<1)
		
				{
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по сметной работе</b></font>";
				}			
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";		
				}
		break;		
		
		case $type5707:
		if((searchavailspec($allspec, $spec71043)+
		searchavailspec($allspec, $spec71044)+
		searchavailspec($allspec, $spec71045)+
		searchavailspec($allspec, $spec71039)+
		searchavailspec($allspec, $spec71046)+
		searchavailspec($allspec, $spec71048)+
		searchavailspec($allspec, $spec71047)+
		searchavailspec($allspec, $spec71059)+
		searchavailspec($allspec, $spec71063)+
		searchavailspec($allspec, $spec71074)+
		searchavailspec($allspec, $spec700128)+
		searchavailspec($allspec, $spec700047)+
		searchavailspec($allspec, $spec710128)+
		searchavailspec($allspec, $spec700048)+
		searchavailspec($allspec, $spec700045)+
		searchavailspec($allspec, $spec700046)+
		searchavailspec($allspec, $spec700073)+
		searchavailspec($allspec, $spec700059)+
		searchavailspec($allspec, $spec700039)+
		searchavailspec($allspec, $spec700126)+
		searchavailspec($allspec, $spec700043)+
		searchavailspec($allspec, $spec700096)+
		searchavailspec($allspec, $spec700074)+
		searchavailspec($allspec, $spec700063)+
		searchavailspec($allspec, $spec700044)+
		searchavailspec($allspec, $spec150)+
		searchavailspec($allspec, $spec17700043)+
		searchavailspec($allspec, $spec17700044)+
		searchavailspec($allspec, $spec45)+
		searchavailspec($allspec, $spec39)+
		searchavailspec($allspec, $spec17700046)+
		searchavailspec($allspec, $spec17700048)+
		searchavailspec($allspec, $spec17700047)+
		searchavailspec($allspec, $spec17700059)+
		searchavailspec($allspec, $spec63)+
		searchavailspec($allspec, $spec73)+
		searchavailspec($allspec, $spec96)+
		searchavailspec($allspec, $spec17700074)+
		searchavailspec($allspec, $spec126)+
		searchavailspec($allspec, $spec128)+
		searchavailspec($allspec, $spec278)+
		searchavailspec($allspec, $spec43)+
		searchavailspec($allspec, $spec44)+
		searchavailspec($allspec, $spec46)+
		searchavailspec($allspec, $spec48)+
		searchavailspec($allspec, $spec47)+
		searchavailspec($allspec, $spec59)+
		searchavailspec($allspec, $spec74)+
		searchavailspec($allspec, $spec260)+
		searchavailspec($allspec, $spec261)+
		searchavailspec($allspec, $spec262)+
		searchavailspec($allspec, $spec263))<1)
		{
				echo "<font color=\"ff0000\">Нет ни одного <b>главного инженера</b></font>";
				}					
		elseif	
		((searchavailspec($allspec, $spec710114)+
		searchavailspec($allspec, $spec710115)+
		searchavailspec($allspec, $spec710116)+
		searchavailspec($allspec, $spec710117)+
		searchavailspec($allspec, $spec710118)+
		searchavailspec($allspec, $spec710119)+
		searchavailspec($allspec, $spec710120)+
		searchavailspec($allspec, $spec710121)+
		searchavailspec($allspec, $spec710122)+
		searchavailspec($allspec, $spec710123)+
		searchavailspec($allspec, $spec710124)+
		searchavailspec($allspec, $spec710125)+
		searchavailspec($allspec, $spec700120)+
		searchavailspec($allspec, $spec700115)+
		searchavailspec($allspec, $spec700122)+
		searchavailspec($allspec, $spec700124)+
		searchavailspec($allspec, $spec700125)+
		searchavailspec($allspec, $spec700114)+
		searchavailspec($allspec, $spec700117)+
		searchavailspec($allspec, $spec700121)+
		searchavailspec($allspec, $spec700123)+
		searchavailspec($allspec, $spec700118)+
		searchavailspec($allspec, $spec700116)+
		searchavailspec($allspec, $spec700119)+
		searchavailspec($allspec, $spec700147)+
		searchavailspec($allspec, $spec247)+
		searchavailspec($allspec, $spec147)+
		searchavailspec($allspec, $spec17700114)+
		searchavailspec($allspec, $spec17700115)+
		searchavailspec($allspec, $spec116)+
		searchavailspec($allspec, $spec117)+
		searchavailspec($allspec, $spec17700118)+
		searchavailspec($allspec, $spec119)+
		searchavailspec($allspec, $spec17700120)+
		searchavailspec($allspec, $spec17700121)+
		searchavailspec($allspec, $spec122)+
		searchavailspec($allspec, $spec123)+
		searchavailspec($allspec, $spec17700124)+
		searchavailspec($allspec, $spec125)+
		searchavailspec($allspec, $spec114)+
		searchavailspec($allspec, $spec115)+
		searchavailspec($allspec, $spec118)+
		searchavailspec($allspec, $spec120)+
		searchavailspec($allspec, $spec121)+
		searchavailspec($allspec, $spec124)+
		searchavailspec($allspec, $spec264)+
		searchavailspec($allspec, $spec265)+
		searchavailspec($allspec, $spec266))<1)
		
				{
				echo "<font color=\"ff0000\">Нет ни одного <b>начальника (заместителя) ПТО</b></font>";
				}
		elseif	
		((searchavailspec($allspec, $spec700141)+
		searchavailspec($allspec, $spec141))<1)
		
				{
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по сметной работе</b></font>";
				}			
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";		
				}
		break;		

		
		case $type5708:
		break;
			
		case $type5709:
				if((searchavailspec($allspec, $spec140)+searchavailspec($allspec, $spec142)+
				searchavailspec($allspec, $spec700140)+searchavailspec($allspec, $spec700142))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>главного или ведущего геодезиста</b></font>";
				}
		break;		
		
		
		case $type5710:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5711:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec15)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec16)+searchavailspec($allspec, $spec76)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec78)+
				searchavailspec($allspec, $spec79)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec81)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700216)+searchavailspec($allspec, $spec17700243)+
				searchavailspec($allspec, $spec17700245)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec245)+searchavailspec($allspec, $spec205)+
				searchavailspec($allspec, $spec231)+searchavailspec($allspec, $spec233)+
				searchavailspec($allspec, $spec234)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec215)+
				searchavailspec($allspec, $spec216)+searchavailspec($allspec, $spec243))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5712:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec17700195)+searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec224)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700237)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5713:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;

		case $type5714:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5715:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5716:
				if((searchavailspec($allspec, $spec270)+searchavailspec($allspec, $spec274))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5717:
				if((searchavailspec($allspec, $spec11)+searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec0)+
				searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec16)+searchavailspec($allspec, $spec76)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec78)+
				searchavailspec($allspec, $spec79)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec81)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700205)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec226)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec206)+searchavailspec($allspec, $spec208)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec17700243)+
				searchavailspec($allspec, $spec17700245)+searchavailspec($allspec, $spec17700215)+
				searchavailspec($allspec, $spec17700216)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec203)+searchavailspec($allspec, $spec205)+
				searchavailspec($allspec, $spec231)+searchavailspec($allspec, $spec233)+
				searchavailspec($allspec, $spec234)+searchavailspec($allspec, $spec215)+
				searchavailspec($allspec, $spec216)+searchavailspec($allspec, $spec243)+
				searchavailspec($allspec, $spec245)+searchavailspec($allspec, $spec195))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $typetype5718:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5719:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec196))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5720:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec267)+searchavailspec($allspec, $spec271))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5721:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5722:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5723:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;			
		
		case $type5724:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
				
		case $type5725:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec76)+searchavailspec($allspec, $spec77)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec17700195)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700197)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec17700203)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec197)+searchavailspec($allspec, $spec225)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec205)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec233)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		
		case $type5726:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5727:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;			
		
		case $type5728:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec110)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700211)+searchavailspec($allspec, $spec17700239)+
				searchavailspec($allspec, $spec211)+searchavailspec($allspec, $spec239)+				
				searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;			
		
		case $type5729:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type5730:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;			
		
		case $type5731:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5732:
				if((searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec76)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec17700205)+searchavailspec($allspec, $spec17700231)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec212)+
				searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec205)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec235))>=1){
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
				
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))>=1)	
			{
				echo "<font color=\"ff0000\">Нет обязательных<b>аттестованных специалистов</b></font>";
				}	
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
		break;

		case $type5733:
				if((searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec17700204)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700232)+
				searchavailspec($allspec, $spec204)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec232))>=1){
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))>=1)	
			{
				echo "<font color=\"ff0000\">Нет обязательных<b>аттестованных специалистов</b></font>";
				}	
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
		break;
		
		case $type5734:
				if((searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec234))>=1){
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))>=1)	
			{
				echo "<font color=\"ff0000\">Нет обязательных<b>аттестованных специалистов</b></font>";
				}	
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
		break;			

		case $type5735:
				if((searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec207)+searchavailspec($allspec, $spec234))>=1){
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))>=1)	
			{
				echo "<font color=\"ff0000\">Нет обязательных<b>аттестованных специалистов</b></font>";
				}	
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
		break;		
		
		case $type5736:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec17700216)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700245)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec245)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec216))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5737:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec81)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700246)+
				searchavailspec($allspec, $spec17700217)+searchavailspec($allspec, $spec17700215)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec217)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec246))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5738:
				if((searchavailspec($allspec, $spec13)+searchavailspec($allspec, $spec193)+
				searchavailspec($allspec, $spec221))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type5739:
				if((searchavailspec($allspec, $spec0)+searchavailspec($allspec, $spec16)+
				searchavailspec($allspec, $spec218)+searchavailspec($allspec, $spec244))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;	
		
	
		case $type5740:
				if((searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec206)+searchavailspec($allspec, $spec207)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec234))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		
		case $type5741:
				if((searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5742:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		


		case $type5743:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		
		case $type5744:
				if((searchavailspec($allspec, $spec710112)+searchavailspec($allspec, $spec112)+
				searchavailspec($allspec, $spec20112)+searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec220))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		
		case $type5745:
				if((searchavailspec($allspec, $spec82)+searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec224))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
				
		
		case $type5746:
				if((searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700237)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		


		case $type5747:	
				if((searchavailspec($allspec, $spec269)+searchavailspec($allspec, $spec273))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type5748:	
				if((searchavailspec($allspec, $spec17)+searchavailspec($allspec, $spec214)
					+searchavailspec($allspec, $spec242))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5749:
						if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)
					+searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type5750:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5751:
				if((searchavailspec($allspec, $spec268)+searchavailspec($allspec, $spec272))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5752:

		break;		
		
case $type5901:
				if((searchavailspec($allspec, $spec700093)+searchavailspec($allspec, $spec700135)
					+searchavailspec($allspec, $spec800135)+searchavailspec($allspec, $spec93)+
				searchavailspec($allspec, $spec17700135))>=5){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
				else {
				echo "<font color=\"ff0000\">Не достаточно <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		
		case $type5903:
				if(searchavailspec($allspec, $spec250)>=5){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
				else {
				echo "<font color=\"ff0000\">Не достаточно специалистов, осуществляющих <b>обследование автомобильных дорог и мостовых сооружений</b></font>";
				}
		break;
		
		
        case $type5902:
				if((searchavailspec($allspec, $spec253)+searchavailspec($allspec, $spec254)
					+searchavailspec($allspec, $spec255)+searchavailspec($allspec, $spec256)+
				searchavailspec($allspec, $spec257)+searchavailspec($allspec, $spec258)
				+searchavailspec($allspec, $spec259))>=5){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
				else {
				echo "<font color=\"ff0000\">Не достаточно <b>аттестованных специалистов</b></font>";
				}
		break;		
		}
			
		} 

	}
    break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////CASE 2//////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
    case 2:
	if($vidyrabot1 < $outdate){
        for ($i = 0; $i <= count($types_of_jobs[$k]->field_field_vidyrab); $i++) 
		{ 
			$types_of_jobs2=$types_of_jobs[$k]->field_field_vidyrab[$i][raw];
			$types_of_jobs3=$types_of_jobs2[taxonomy_term]->name;
			$vidyrabot[$k][$i]=$types_of_jobs3; // переменная для вывода вне массива
			print_r ("</br>".$types_of_jobs3."</br>");

			
		switch ($types_of_jobs3) {
        
		
		case $type163:
		break;
		
		case $type164:
		if((searchavailspec($allspec, $spec700166)+searchavailspec($allspec, $spec166)+searchavailspec($allspec, $spec173))>=5){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-геодезические изыскания</b> меньше 5</font>";
				}
		break;
		
		case $type165:
			if((searchavailspec($allspec, $spec700167)+searchavailspec($allspec, $spec167)+searchavailspec($allspec, $spec174))>=5){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-геологические изыскания</b> меньше 5</font>";
				}
		break;
		
		case $type166:
			if((searchavailspec($allspec, $spec700168)+searchavailspec($allspec, $spec168))>=5){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-гидрометеорологические изыскания</b> меньше 5</font>";
				}
		break;
		
		case $type167:
			if((searchavailspec($allspec, $spec700169)+searchavailspec($allspec, $spec169))>=5){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-экологические изыскания</b> меньше 5</font>";
				}
		break;
		
		case $type168:
			if((searchavailspec($allspec, $spec700170)+searchavailspec($allspec, $spec170))>=5){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-геотехнические изыскания</b> меньше 5</font>";
				}
		break;
		
		case $type169:
			if((searchavailspec($allspec, $spec171)+searchavailspec($allspec, $spec171))>=5){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>обследование состояния грунтов оснований зданий и сооружений</b> меньше 5</font>";
				}
		break;
		
		case $type170:
			if((searchavailspec($allspec, $spec700064)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3))>=1 or (searchavailspec($allspec, $spec4)+searchavailspec($allspec, $spec148)+searchavailspec($allspec, $spec17700129)+searchavailspec($allspec, $spec129)+searchavailspec($allspec, $spec275))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного специалиста <b>ГАП</b> или <b>ГИП</b></font>";
				}
		break;
		
		case $type171:
			if(
			(searchavailspec($allspec, $spec700101)+
			 searchavailspec($allspec, $spec700102)+
			 searchavailspec($allspec, $spec700103)+
			 searchavailspec($allspec, $spec700104)+
			 searchavailspec($allspec, $spec700105)+
			 searchavailspec($allspec, $spec700106)+
			 searchavailspec($allspec, $spec700107)+
			 searchavailspec($allspec, $spec700108)+
			 searchavailspec($allspec, $spec700109)+
			 searchavailspec($allspec, $spec700162)+
			 searchavailspec($allspec, $spec17700101)+
			 searchavailspec($allspec, $spec17700102)+
			 searchavailspec($allspec, $spec17700103)+
			 searchavailspec($allspec, $spec17700104)+
			 searchavailspec($allspec, $spec17700105)+
			 searchavailspec($allspec, $spec17700106)+
			 searchavailspec($allspec, $spec17700107)+
			 searchavailspec($allspec, $spec17700108)+
			 searchavailspec($allspec, $spec17700109)+
			 searchavailspec($allspec, $spec138)+
			 searchavailspec($allspec, $spec137)+
			 searchavailspec($allspec, $spec162)+
			 searchavailspec($allspec, $spec101)+
			 searchavailspec($allspec, $spec102)+
			 searchavailspec($allspec, $spec103)+
			 searchavailspec($allspec, $spec104)+
			 searchavailspec($allspec, $spec105)+
			 searchavailspec($allspec, $spec106)+
			 searchavailspec($allspec, $spec107)+
			 searchavailspec($allspec, $spec108)+
			 searchavailspec($allspec, $spec109))<1) 
			 {
				echo "<font color=\"ff0000\">Нет ни одного аттестованного <b>начальника (заведующего) структурного подразделения</b></font>";
				}
			elseif	((searchavailspec($allspec, $spec700064)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3))<4 or (searchavailspec($allspec, $spec4)+searchavailspec($allspec, $spec148)+searchavailspec($allspec, $spec17700129)+searchavailspec($allspec, $spec129)+searchavailspec($allspec, $spec275))<4)
             {
				echo "<font color=\"ff0000\">Количество специалистов <b>ГАП</b> или <b>ГИП</b> меньше 4</font>";
				}
			 elseif (searchavailspec($allspec, $spec248)<1)
			{
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста по <b>охране окружающей среды</b></font>";
				} 
			elseif ((searchavailspec($allspec, $spec700164)+searchavailspec($allspec, $spec164))<1)
			{
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста по <b>организации строительства</b></font>";
				} 
			elseif (searchavailspec($allspec, $spec249)<1)
			{
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста по <b>инженерно-техническим мероприятиям гражданской обороны</b></font>";
				}
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
		break;
					
		case $type196:
		break;
		
		case $type197:
			if((searchavailspec($allspec, $spec700163)+searchavailspec($allspec, $spec163))>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (генеральный план)</b></font>";
				}
		break;
		
		
		case $type198:
			if((searchavailspec($allspec, $spec252)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3)+searchavailspec($allspec, $spec700064))>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (архитектурные решения)</b> либо <b>ГАПа</b></font>";
				}
		break;
		
				
		case $type199:
			if(searchavailspec($allspec, $spec139)>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (сметная документация)</b></font>";
				}
		break;
		
		
		case $type200:			
		if((searchavailspec($allspec, $spec66)+searchavailspec($allspec, $spec17700066)+searchavailspec($allspec, $spec700066))>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (конструктивные решения)</b></font>";
				}			
		break;
		
		
		case $type543:
		break;
		case $type5435:
			if((searchavailspec($allspec, $spec17700071)+searchavailspec($allspec, $spec700071)+searchavailspec($allspec, $spec71))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (холодоснабжение))</b></font>";
				}
		break;
		
				
		case $type5436:
			if((searchavailspec($allspec, $spec17700067)+searchavailspec($allspec, $spec700067)+searchavailspec($allspec, $spec67))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</b></font>";
				}
		break;
		
		case $type5438:
			if((searchavailspec($allspec, $spec17700067)+searchavailspec($allspec, $spec700067)+searchavailspec($allspec, $spec67))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</b></font>";
				}
		break;
		
		case $type5441:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</b></font>";
				}
		break;
		
		case $type5442:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</b></font>";
				}
		break;
		
		case $type5443:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</b></font>";
				}
		break;
		
		case $type5444:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;
		case $type5453:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;
		case $type5454:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;
		
		case $type5439:
			if((searchavailspec($allspec, $spec17700068)+searchavailspec($allspec, $spec700068)+searchavailspec($allspec, $spec68))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (отопление, вентиляция и кондиционирование воздуха))</b></font>";
				}
		break;
		
		case $type5440:
			if((searchavailspec($allspec, $spec17700068)+searchavailspec($allspec, $spec700068)+searchavailspec($allspec, $spec68))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (отопление, вентиляция и кондиционирование воздуха))</b></font>";
				}
		break;	
		
		case $type5437:
			if((searchavailspec($allspec, $spec17700069)+searchavailspec($allspec, $spec700069)+searchavailspec($allspec, $spec69))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</b></font>";
				}
		break;

		case $type5445: /*4.6. наружные сети и системы:*/
		break;
		
		case $type5446:
			if((searchavailspec($allspec, $spec17700070)+searchavailspec($allspec, $spec700070)+searchavailspec($allspec, $spec70))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (тепловые сети))</b></font>";
				}
		break;
		
		case $type5447:
			if((searchavailspec($allspec, $spec700067)+searchavailspec($allspec, $spec67))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</b></font>";
				}
		break;	
		
		case $type5449:
			if((searchavailspec($allspec, $spec700067)+searchavailspec($allspec, $spec67))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</b></font>";
				}
		break;	
		
		case $type5450:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</b></font>";
				}
		break;
		
		case $type5451:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;
		case $type5455:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;
		
		case $type5456:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;		
		
		case $type5448:
			if((searchavailspec($allspec, $spec17700069)+searchavailspec($allspec, $spec700069)+searchavailspec($allspec, $spec69))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</b></font>";
				}
		break;

		case $type202: 
		break;
		
		case $type5457: /*4.8.:*/
		break;
		
		case $type5459:
				if(searchavailspec($allspec, $spec249)>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерно-технические мероприятия гражданской обороны. Мероприятия по предупреждению чрезвычайных ситуаций)</b></font>";
				}
		break;
		case $type5460:
				if(searchavailspec($allspec, $spec249)>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерно-технические мероприятия гражданской обороны. Мероприятия по предупреждению чрезвычайных ситуаций)</b></font>";
				}
		break;
		case $type5461:
				if(searchavailspec($allspec, $spec249)>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерно-технические мероприятия гражданской обороны. Мероприятия по предупреждению чрезвычайных ситуаций)</b></font>";
				}
		break;
		
		case $type5462:
			if((searchavailspec($allspec, $spec700164)+searchavailspec($allspec, $spec164))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (организация строительства)</b></font>";
				}
		break;
		
		case $type5458:
			if(searchavailspec($allspec, $spec248)>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (охрана окружающей среды)</b></font>";
				}
		break;		
		
		case $type205:/*5. Выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов первого-четвертого классов сложности*/
		break;
		
		case $type206:
		break;
		
		case $type207:
				$count=0;
				$count=countoverzero(searchavailspec($allspec, $spec17700024),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700024),$count);
				$count=countoverzero(searchavailspec($allspec, $spec144),$count);
				$count=countoverzero(searchavailspec($allspec, $spec145),$count);
				$count=countoverzero(searchavailspec($allspec, $spec146),$count);
				$count=countoverzero(searchavailspec($allspec, $spec24),$count);				
				$count=countoverzero(searchavailspec($allspec, $spec17700026),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700026),$count);
				$count=countoverzero(searchavailspec($allspec, $spec26),$count);
				$count=countoverzero(searchavailspec($allspec, $spec277),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700095),$count);
				$count=countoverzero(searchavailspec($allspec, $spec95),$count);
				$count=countoverzero(searchavailspec($allspec, $spec57),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700057),$count);				
				$count=countoverzero(searchavailspec($allspec, $spec17700030),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700030),$count);
				$count=countoverzero(searchavailspec($allspec, $spec30),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec17700097),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700097),$count);
				$count=countoverzero(searchavailspec($allspec, $spec97),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec17700033),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700033),$count);
				$count=countoverzero(searchavailspec($allspec, $spec33),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec17700084),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700084),$count);
				$count=countoverzero(searchavailspec($allspec, $spec84),$count);				
				$count=countoverzero(searchavailspec($allspec, $spec17700085),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700085),$count);
				$count=countoverzero(searchavailspec($allspec, $spec85),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec34),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700034),$count);
				$count=countoverzero(searchavailspec($allspec, $spec113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec20113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec710113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec276),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700061),$count);
				$count=countoverzero(searchavailspec($allspec, $spec17700061),$count);
				$count=countoverzero(searchavailspec($allspec, $spec61),$count);
				
		if((searchavailspec($allspec, $spec40)+searchavailspec($allspec, $spec700187)+searchavailspec($allspec, $spec188)+searchavailspec($allspec, $spec189)+searchavailspec($allspec, $spec187))<2)
		{
				echo "<font color=\"ff0000\">Количество руководителей проекта меньше 2</font>";
				}		
				
		elseif	($count<6)
				{
				echo "<font color=\"ff0000\">Количество специалистов по техническому надзору меньше 6</font>";
				}
					
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";		
				}
		break;
		
		case $type208:
		if((searchavailspec($allspec, $spec700024)+
		searchavailspec($allspec, $spec144)+
		searchavailspec($allspec, $spec145)+
		searchavailspec($allspec, $spec146)+
		searchavailspec($allspec, $spec24)+
		searchavailspec($allspec, $spec17700024))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (общестроительные работы)</b></font>";
				}
		break;
		
		case $type209:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec17700026))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</b></font>";
				}
		break;
		
		case $type210:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec17700026))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</b></font>";
				}
		break;
		
		case $type211:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec17700026)+
		searchavailspec($allspec, $spec95)+
		searchavailspec($allspec, $spec700095))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</b></font>";
				}
		break;
		
		case $type212:
		if((searchavailspec($allspec, $spec700057)+
		searchavailspec($allspec, $spec57))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области газоснабжения)</b></font>";
				}
		break;

		case $type213:
		if((searchavailspec($allspec, $spec700030)+
		searchavailspec($allspec, $spec30)+
		searchavailspec($allspec, $spec17700030))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области электроснабжения и автоматизации)</b></font>";
				}
		break;

		case $type214:
		if((searchavailspec($allspec, $spec700097)+
		searchavailspec($allspec, $spec97)+
		searchavailspec($allspec, $spec17700097))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области связи, сигнализации)</b></font>";
				}
		break;

		case $type215:
		if((searchavailspec($allspec, $spec700033)+
		searchavailspec($allspec, $spec33)+
		searchavailspec($allspec, $spec17700033))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (строительство автомобильных дорог и аэродромов, строительство мостов, транспортных эстакад и путепроводов)</b></font>";
				}
		break;

		case $type216:
		if((searchavailspec($allspec, $spec700084)+
		searchavailspec($allspec, $spec84)+
		searchavailspec($allspec, $spec17700084))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (строительство железных дорог)</b></font>";
				}
		break;

		case $type217:
		if((searchavailspec($allspec, $spec700085)+
		searchavailspec($allspec, $spec85)+
		searchavailspec($allspec, $spec17700085))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (строительство сооружений транспортных тоннелей, метрополитенов)</b></font>";
				}
		break;

		case $type218:
		if((searchavailspec($allspec, $spec700034)+
		searchavailspec($allspec, $spec34))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (гидротехническое и мелиоративное строительство)</b></font>";
				}
		break;

		case $type219:
		if((searchavailspec($allspec, $spec710113)+
		searchavailspec($allspec, $spec20113)+
		searchavailspec($allspec, $spec700113)+
		searchavailspec($allspec, $spec113))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (благоустройство территорий)</b></font>";
				}
		break;

		case $type220:
		if((searchavailspec($allspec, $spec700064)+
		searchavailspec($allspec, $spec3)+
		searchavailspec($allspec, $spec64))>=4 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов <b>ГАП</b> меньше 4</font>";
				}
		break;
				
		case $type221:
		break;
		
		case $type222:
		break;
		
		case $type223:
		break;
		
		case $type224:
		break;
		
		case $type225:
		break;
		
		case $type226:
		break;
		
		case $type227:
		if((searchavailspec($allspec, $spec71043)+
		searchavailspec($allspec, $spec71044)+
		searchavailspec($allspec, $spec71045)+
		searchavailspec($allspec, $spec71039)+
		searchavailspec($allspec, $spec71046)+
		searchavailspec($allspec, $spec71048)+
		searchavailspec($allspec, $spec71047)+
		searchavailspec($allspec, $spec71059)+
		searchavailspec($allspec, $spec71063)+
		searchavailspec($allspec, $spec71074)+
		searchavailspec($allspec, $spec700128)+
		searchavailspec($allspec, $spec700047)+
		searchavailspec($allspec, $spec710128)+
		searchavailspec($allspec, $spec700048)+
		searchavailspec($allspec, $spec700045)+
		searchavailspec($allspec, $spec700046)+
		searchavailspec($allspec, $spec700073)+
		searchavailspec($allspec, $spec700059)+
		searchavailspec($allspec, $spec700039)+
		searchavailspec($allspec, $spec700126)+
		searchavailspec($allspec, $spec700043)+
		searchavailspec($allspec, $spec700096)+
		searchavailspec($allspec, $spec700074)+
		searchavailspec($allspec, $spec700063)+
		searchavailspec($allspec, $spec700044)+
		searchavailspec($allspec, $spec150)+
		searchavailspec($allspec, $spec17700043)+
		searchavailspec($allspec, $spec17700044)+
		searchavailspec($allspec, $spec45)+
		searchavailspec($allspec, $spec39)+
		searchavailspec($allspec, $spec17700046)+
		searchavailspec($allspec, $spec17700048)+
		searchavailspec($allspec, $spec17700047)+
		searchavailspec($allspec, $spec17700059)+
		searchavailspec($allspec, $spec63)+
		searchavailspec($allspec, $spec73)+
		searchavailspec($allspec, $spec96)+
		searchavailspec($allspec, $spec17700074)+
		searchavailspec($allspec, $spec126)+
		searchavailspec($allspec, $spec128)+
		searchavailspec($allspec, $spec278)+
		searchavailspec($allspec, $spec43)+
		searchavailspec($allspec, $spec44)+
		searchavailspec($allspec, $spec46)+
		searchavailspec($allspec, $spec48)+
		searchavailspec($allspec, $spec47)+
		searchavailspec($allspec, $spec59)+
		searchavailspec($allspec, $spec74)+
		searchavailspec($allspec, $spec260)+
		searchavailspec($allspec, $spec261)+
		searchavailspec($allspec, $spec262)+
		searchavailspec($allspec, $spec263))<1)
		{
				echo "<font color=\"ff0000\">Нет ни одного <b>главного инженера</b></font>";
				}					
		elseif	
		((searchavailspec($allspec, $spec710114)+
		searchavailspec($allspec, $spec710115)+
		searchavailspec($allspec, $spec710116)+
		searchavailspec($allspec, $spec710117)+
		searchavailspec($allspec, $spec710118)+
		searchavailspec($allspec, $spec710119)+
		searchavailspec($allspec, $spec710120)+
		searchavailspec($allspec, $spec710121)+
		searchavailspec($allspec, $spec710122)+
		searchavailspec($allspec, $spec710123)+
		searchavailspec($allspec, $spec710124)+
		searchavailspec($allspec, $spec710125)+
		searchavailspec($allspec, $spec700120)+
		searchavailspec($allspec, $spec700115)+
		searchavailspec($allspec, $spec700122)+
		searchavailspec($allspec, $spec700124)+
		searchavailspec($allspec, $spec700125)+
		searchavailspec($allspec, $spec700114)+
		searchavailspec($allspec, $spec700117)+
		searchavailspec($allspec, $spec700121)+
		searchavailspec($allspec, $spec700123)+
		searchavailspec($allspec, $spec700118)+
		searchavailspec($allspec, $spec700116)+
		searchavailspec($allspec, $spec700119)+
		searchavailspec($allspec, $spec700147)+
		searchavailspec($allspec, $spec247)+
		searchavailspec($allspec, $spec147)+
		searchavailspec($allspec, $spec17700114)+
		searchavailspec($allspec, $spec17700115)+
		searchavailspec($allspec, $spec116)+
		searchavailspec($allspec, $spec117)+
		searchavailspec($allspec, $spec17700118)+
		searchavailspec($allspec, $spec119)+
		searchavailspec($allspec, $spec17700120)+
		searchavailspec($allspec, $spec17700121)+
		searchavailspec($allspec, $spec122)+
		searchavailspec($allspec, $spec123)+
		searchavailspec($allspec, $spec17700124)+
		searchavailspec($allspec, $spec125)+
		searchavailspec($allspec, $spec114)+
		searchavailspec($allspec, $spec115)+
		searchavailspec($allspec, $spec118)+
		searchavailspec($allspec, $spec120)+
		searchavailspec($allspec, $spec121)+
		searchavailspec($allspec, $spec124)+
		searchavailspec($allspec, $spec264)+
		searchavailspec($allspec, $spec265)+
		searchavailspec($allspec, $spec266))<1)
		
				{
				echo "<font color=\"ff0000\">Нет ни одного <b>начальника (заместителя) ПТО</b></font>";
				}
		elseif	
		((searchavailspec($allspec, $spec700141)+
		searchavailspec($allspec, $spec141))<1)
		
				{
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по сметной работе</b></font>";
				}			
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";		
				}
		break;
		
			case $type228:
		break;
		
		case $type229:
				if((searchavailspec($allspec, $spec140)+searchavailspec($allspec, $spec142)+
				searchavailspec($allspec, $spec700140)+searchavailspec($allspec, $spec700142))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>главного или ведущего геодезиста</b></font>";
				}
		break;
		
		case $type230:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type231:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec15)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec16)+searchavailspec($allspec, $spec76)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec78)+
				searchavailspec($allspec, $spec79)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec81)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700216)+searchavailspec($allspec, $spec17700243)+
				searchavailspec($allspec, $spec17700245)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec245)+searchavailspec($allspec, $spec205)+
				searchavailspec($allspec, $spec231)+searchavailspec($allspec, $spec233)+
				searchavailspec($allspec, $spec234)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec215)+
				searchavailspec($allspec, $spec216)+searchavailspec($allspec, $spec243))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type232:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec17700195)+searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec224)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700237)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type233:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type234:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		
		case $type235:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type236:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec41)
					+searchavailspec($allspec, $spec82)+searchavailspec($allspec, $spec203)
				+searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)
				+searchavailspec($allspec, $spec224)+searchavailspec($allspec, $spec196)
				+searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec222)
				+searchavailspec($allspec, $spec17700203)+searchavailspec($allspec, $spec17700231)
				+searchavailspec($allspec, $spec231)+searchavailspec($allspec, $spec237)
				+searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223)
				+searchavailspec($allspec, $spec11))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		
		case $type237:
				if((searchavailspec($allspec, $spec11)+searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec0)+
				searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec16)+searchavailspec($allspec, $spec76)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec78)+
				searchavailspec($allspec, $spec79)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec81)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700205)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec226)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec206)+searchavailspec($allspec, $spec208)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec17700243)+
				searchavailspec($allspec, $spec17700245)+searchavailspec($allspec, $spec17700215)+
				searchavailspec($allspec, $spec17700216)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec203)+searchavailspec($allspec, $spec205)+
				searchavailspec($allspec, $spec231)+searchavailspec($allspec, $spec233)+
				searchavailspec($allspec, $spec234)+searchavailspec($allspec, $spec215)+
				searchavailspec($allspec, $spec216)+searchavailspec($allspec, $spec243)+
				searchavailspec($allspec, $spec245)+searchavailspec($allspec, $spec195))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type238:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;			
		
		case $type239:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec196))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		
		case $type240:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec267)+searchavailspec($allspec, $spec271))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type241:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type242:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type243:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		
		case $type244:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
				
		case $type245:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec76)+searchavailspec($allspec, $spec77)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec17700195)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700197)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec17700203)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec197)+searchavailspec($allspec, $spec225)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec205)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec233)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		
		case $type246:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type247:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type248:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec110)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700211)+searchavailspec($allspec, $spec17700239)+
				searchavailspec($allspec, $spec211)+searchavailspec($allspec, $spec239)+				
				searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		
		case $type249:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type250:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type251:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		


		case $type252:
				if((searchavailspec($allspec, $spec11)+searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec76)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec17700205)+searchavailspec($allspec, $spec17700231)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec212)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec205)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec235)+searchavailspec($allspec, $spec212))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;	

		case $type253:
				if((searchavailspec($allspec, $spec11)+searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec17700204)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700232)+
				searchavailspec($allspec, $spec212)+searchavailspec($allspec, $spec240)+
				searchavailspec($allspec, $spec204)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec232))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		
		case $type254:
				if((searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec212)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec212)+searchavailspec($allspec, $spec240)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec234))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		

		case $type255:
				if((searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec79)+searchavailspec($allspec, $spec212)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec207)+searchavailspec($allspec, $spec234))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		
		case $type256:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec17700216)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700245)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec245)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec216))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;

		
		case $type257:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec81)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700246)+
				searchavailspec($allspec, $spec17700217)+searchavailspec($allspec, $spec17700215)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec217)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec246))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		

		case $type258:
		break;		
		
		case $type259:
				if((searchavailspec($allspec, $spec13)+searchavailspec($allspec, $spec193)+searchavailspec($allspec, $spec221))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		
		case $type260:
				if((searchavailspec($allspec, $spec0)+searchavailspec($allspec, $spec16)+
				searchavailspec($allspec, $spec218)+searchavailspec($allspec, $spec244))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		

		case $type261:
				if((searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec206)+searchavailspec($allspec, $spec207)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec234))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		

		case $type262:
				if((searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		

		case $type263:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type264:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type265:
				if((searchavailspec($allspec, $spec710112)+searchavailspec($allspec, $spec112)+
				searchavailspec($allspec, $spec20112)+searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec220))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;			
		

		case $type266:
				if((searchavailspec($allspec, $spec82)+searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec224))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;			
		
				
		case $type267:
				if((searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700237)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		

		case $type268:
		break;		
		
		case $type269:
		break;		



		case $type270:
						if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)
					+searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		
		case $type271:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		

	
case $type272:
				if((searchavailspec($allspec, $spec700093)+searchavailspec($allspec, $spec700135)
					+searchavailspec($allspec, $spec800135)+searchavailspec($allspec, $spec93)+
				searchavailspec($allspec, $spec17700135))>=4){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
				else {
				echo "<font color=\"ff0000\">Не достаточно <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		
		case $type273:
				if(searchavailspec($allspec, $spec250)>=4){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
				else {
				echo "<font color=\"ff0000\">Не достаточно специалистов, осуществляющих <b>обследование автомобильных дорог и мостовых сооружений</b></font>";
				}
		break;
		
		
        case $type274:
				if((searchavailspec($allspec, $spec253)+searchavailspec($allspec, $spec254)
					+searchavailspec($allspec, $spec255)+searchavailspec($allspec, $spec256)+
				searchavailspec($allspec, $spec257)+searchavailspec($allspec, $spec258)
				+searchavailspec($allspec, $spec259))>=4){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
				else {
				echo "<font color=\"ff0000\">Не достаточно <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		
		
		
		
		}	


			
		}
	}
	else {
	        for ($i = 0; $i <= count($types_of_jobs[$k]->field_field_vidy_rabot_13_05_2017_); $i++) 
		{ 
			$types_of_jobs2=$types_of_jobs[$k]->field_field_vidy_rabot_13_05_2017_[$i][raw];
			$types_of_jobs3=$types_of_jobs2[taxonomy_term]->name;
			$vidyrabot[$k][$i]=$types_of_jobs3; // переменная для вывода вне массива
			print_r ("</br>".$types_of_jobs3."</br>");

			
		switch ($types_of_jobs3) {
 		
		case $type5594:
		break;
		
		case $type5595:
		if((searchavailspec($allspec, $spec700166)+searchavailspec($allspec, $spec166)+searchavailspec($allspec, $spec173))>=5){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-геодезические изыскания</b> меньше 5</font>";
				}
		break;
		
		case $type5616:
			if((searchavailspec($allspec, $spec700167)+searchavailspec($allspec, $spec167)+searchavailspec($allspec, $spec174))>=5){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-геологические изыскания</b> меньше 5</font>";
				}
		break;
		case $type5625:
			if((searchavailspec($allspec, $spec700168)+searchavailspec($allspec, $spec168))>=5){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-гидрометеорологические изыскания</b> меньше 5</font>";
				}
		break;	
	
		case $type5630:
			if((searchavailspec($allspec, $spec700169)+searchavailspec($allspec, $spec169))>=5){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-экологические изыскания</b> меньше 5</font>";
				}
		break;
		case $type5647:
			if((searchavailspec($allspec, $spec700170)+searchavailspec($allspec, $spec170))>=5){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-геотехнические изыскания</b> меньше 5</font>";
				}
		break;
		
	   case $type5648:
	   break;
	   case $type5649:
	   break;
	   case $type5650:
	   break;
	   case $type5651:
	   break;
	   case $type5652:
	   break;
	   case $type5653:
	   break;
		case $type5654:
			if((searchavailspec($allspec, $spec171)+searchavailspec($allspec, $spec171))>=5){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>обследование состояния грунтов оснований зданий и сооружений</b> меньше 5</font>";
				}
		break;
	
		case $type5655:
			if((searchavailspec($allspec, $spec700064)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3))>=1 or (searchavailspec($allspec, $spec4)+searchavailspec($allspec, $spec148)+searchavailspec($allspec, $spec17700129)+searchavailspec($allspec, $spec129)+searchavailspec($allspec, $spec275))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного специалиста <b>ГАП</b> или <b>ГИП</b></font>";
				}
		break;
		
		case $type5656:
			if(
			(searchavailspec($allspec, $spec700101)+
			 searchavailspec($allspec, $spec700102)+
			 searchavailspec($allspec, $spec700103)+
			 searchavailspec($allspec, $spec700104)+
			 searchavailspec($allspec, $spec700105)+
			 searchavailspec($allspec, $spec700106)+
			 searchavailspec($allspec, $spec700107)+
			 searchavailspec($allspec, $spec700108)+
			 searchavailspec($allspec, $spec700109)+
			 searchavailspec($allspec, $spec700162)+
			 searchavailspec($allspec, $spec17700101)+
			 searchavailspec($allspec, $spec17700102)+
			 searchavailspec($allspec, $spec17700103)+
			 searchavailspec($allspec, $spec17700104)+
			 searchavailspec($allspec, $spec17700105)+
			 searchavailspec($allspec, $spec17700106)+
			 searchavailspec($allspec, $spec17700107)+
			 searchavailspec($allspec, $spec17700108)+
			 searchavailspec($allspec, $spec17700109)+
			 searchavailspec($allspec, $spec138)+
			 searchavailspec($allspec, $spec137)+
			 searchavailspec($allspec, $spec162)+
			 searchavailspec($allspec, $spec101)+
			 searchavailspec($allspec, $spec102)+
			 searchavailspec($allspec, $spec103)+
			 searchavailspec($allspec, $spec104)+
			 searchavailspec($allspec, $spec105)+
			 searchavailspec($allspec, $spec106)+
			 searchavailspec($allspec, $spec107)+
			 searchavailspec($allspec, $spec108)+
			 searchavailspec($allspec, $spec109))<1) 
			 {
				echo "<font color=\"ff0000\">Нет ни одного аттестованного <b>начальника (заведующего) структурного подразделения</b></font>";
				}
			elseif	((searchavailspec($allspec, $spec700064)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3))<4 or (searchavailspec($allspec, $spec4)+searchavailspec($allspec, $spec148)+searchavailspec($allspec, $spec17700129)+searchavailspec($allspec, $spec129)+searchavailspec($allspec, $spec275))<4)
             {
				echo "<font color=\"ff0000\">Количество специалистов <b>ГАП</b> или <b>ГИП</b> меньше 4</font>";
				}
			 elseif (searchavailspec($allspec, $spec248)<1)
			{
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста по <b>охране окружающей среды</b></font>";
				} 
			elseif ((searchavailspec($allspec, $spec700164)+searchavailspec($allspec, $spec164))<1)
			{
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста по <b>организации строительства</b></font>";
				} 
			elseif (searchavailspec($allspec, $spec249)<1)
			{
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста по <b>инженерно-техническим мероприятиям гражданской обороны</b></font>";
				}
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
		break;		
		case $type5658:
			if((searchavailspec($allspec, $spec700163)+searchavailspec($allspec, $spec163))>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (генеральный план)</b></font>";
				}
		break;		
		
		case $type5659:
			if((searchavailspec($allspec, $spec252)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3)+searchavailspec($allspec, $spec700064))>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (архитектурные решения)</b> либо <b>ГАПа</b></font>";
				}
		break;		
				
		
		case $type5660:
			if(searchavailspec($allspec, $spec139)>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (сметная документация)</b></font>";
				}
		break;		
		
		
		case $type5661:
		if((searchavailspec($allspec, $spec66)+searchavailspec($allspec, $spec17700066)+searchavailspec($allspec, $spec700066))>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (конструктивные решения)</b></font>";
				}			
		break;		
		
		case $type5662:
		break;
		
		case $type5664:
			if((searchavailspec($allspec, $spec17700071)+searchavailspec($allspec, $spec700071)+searchavailspec($allspec, $spec71))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (холодоснабжение))</b></font>";
				}
		break;		
				
		case type5665:
			if((searchavailspec($allspec, $spec17700067)+searchavailspec($allspec, $spec700067)+searchavailspec($allspec, $spec67))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</b></font>";
				}
		break;		
		
		case $type5666:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</b></font>";
				}
		break;
				
		case $type5667:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;		
		
		case $type5663:
			if((searchavailspec($allspec, $spec17700068)+searchavailspec($allspec, $spec700068)+searchavailspec($allspec, $spec68))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (отопление, вентиляция и кондиционирование воздуха))</b></font>";
				}
		break;		
				
		case $type5669:
			if((searchavailspec($allspec, $spec17700069)+searchavailspec($allspec, $spec700069)+searchavailspec($allspec, $spec69))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</b></font>";
				}
		break;

		case $type5670:
		break;
		
		case $type5671:
			if((searchavailspec($allspec, $spec17700070)+searchavailspec($allspec, $spec700070)+searchavailspec($allspec, $spec70))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (тепловые сети))</b></font>";
				}
		break;		
			
		
		case $type5672:
			if((searchavailspec($allspec, $spec700067)+searchavailspec($allspec, $spec67))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</b></font>";
				}
		break;		
		
		case $type5673:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</b></font>";
				}
		break;		
		
		case $type5674:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;	

		case $type5675:
			if((searchavailspec($allspec, $spec17700069)+searchavailspec($allspec, $spec700069)+searchavailspec($allspec, $spec69))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</b></font>";
				}
		break;		
			
		case $type5676: 
		break;
		
		case $type5678:
			if((searchavailspec($allspec, $spec700164)+searchavailspec($allspec, $spec164))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (организация строительства)</b></font>";
				}
		break;		
		
		case $type5679:
			if(searchavailspec($allspec, $spec248)>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (охрана окружающей среды)</b></font>";
				}
		break;
		
		case $type5680:
		break;
		
		case $type5681:
		break;
		
		case $type207:
				$count=0;
				$count=countoverzero(searchavailspec($allspec, $spec17700024),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700024),$count);
				$count=countoverzero(searchavailspec($allspec, $spec144),$count);
				$count=countoverzero(searchavailspec($allspec, $spec145),$count);
				$count=countoverzero(searchavailspec($allspec, $spec146),$count);
				$count=countoverzero(searchavailspec($allspec, $spec24),$count);				
				$count=countoverzero(searchavailspec($allspec, $spec17700026),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700026),$count);
				$count=countoverzero(searchavailspec($allspec, $spec26),$count);
				$count=countoverzero(searchavailspec($allspec, $spec277),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700095),$count);
				$count=countoverzero(searchavailspec($allspec, $spec95),$count);
				$count=countoverzero(searchavailspec($allspec, $spec57),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700057),$count);				
				$count=countoverzero(searchavailspec($allspec, $spec17700030),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700030),$count);
				$count=countoverzero(searchavailspec($allspec, $spec30),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec17700097),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700097),$count);
				$count=countoverzero(searchavailspec($allspec, $spec97),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec17700033),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700033),$count);
				$count=countoverzero(searchavailspec($allspec, $spec33),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec17700084),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700084),$count);
				$count=countoverzero(searchavailspec($allspec, $spec84),$count);				
				$count=countoverzero(searchavailspec($allspec, $spec17700085),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700085),$count);
				$count=countoverzero(searchavailspec($allspec, $spec85),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec34),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700034),$count);
				$count=countoverzero(searchavailspec($allspec, $spec113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec20113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec710113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec276),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700061),$count);
				$count=countoverzero(searchavailspec($allspec, $spec17700061),$count);
				$count=countoverzero(searchavailspec($allspec, $spec61),$count);
				
		if((searchavailspec($allspec, $spec40)+searchavailspec($allspec, $spec700187)+searchavailspec($allspec, $spec188)+searchavailspec($allspec, $spec189)+searchavailspec($allspec, $spec187))<2)
		{
				echo "<font color=\"ff0000\">Количество руководителей проекта меньше 2</font>";
				}		
				
		elseif	($count<6)
				{
				echo "<font color=\"ff0000\">Количество специалистов по техническому надзору меньше 6</font>";
				}
					
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";		
				}
		break;
		
		case $type5682:
				$count=0;
				$count=countoverzero(searchavailspec($allspec, $spec17700024),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700024),$count);
				$count=countoverzero(searchavailspec($allspec, $spec144),$count);
				$count=countoverzero(searchavailspec($allspec, $spec145),$count);
				$count=countoverzero(searchavailspec($allspec, $spec146),$count);
				$count=countoverzero(searchavailspec($allspec, $spec24),$count);				
				$count=countoverzero(searchavailspec($allspec, $spec17700026),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700026),$count);
				$count=countoverzero(searchavailspec($allspec, $spec26),$count);
				$count=countoverzero(searchavailspec($allspec, $spec277),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700095),$count);
				$count=countoverzero(searchavailspec($allspec, $spec95),$count);
				$count=countoverzero(searchavailspec($allspec, $spec57),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700057),$count);				
				$count=countoverzero(searchavailspec($allspec, $spec17700030),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700030),$count);
				$count=countoverzero(searchavailspec($allspec, $spec30),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec17700097),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700097),$count);
				$count=countoverzero(searchavailspec($allspec, $spec97),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec17700033),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700033),$count);
				$count=countoverzero(searchavailspec($allspec, $spec33),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec17700084),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700084),$count);
				$count=countoverzero(searchavailspec($allspec, $spec84),$count);				
				$count=countoverzero(searchavailspec($allspec, $spec17700085),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700085),$count);
				$count=countoverzero(searchavailspec($allspec, $spec85),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec34),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700034),$count);
				$count=countoverzero(searchavailspec($allspec, $spec113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec20113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec710113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec276),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700061),$count);
				$count=countoverzero(searchavailspec($allspec, $spec17700061),$count);
				$count=countoverzero(searchavailspec($allspec, $spec61),$count);
				
		if((searchavailspec($allspec, $spec40)+searchavailspec($allspec, $spec700187)+searchavailspec($allspec, $spec188)+searchavailspec($allspec, $spec189)+searchavailspec($allspec, $spec187))<2)
		{
				echo "<font color=\"ff0000\">Количество руководителей проекта меньше 2</font>";
				}		
				
		elseif	($count<6)
				{
				echo "<font color=\"ff0000\">Количество специалистов по техническому надзору меньше 6</font>";
				}
					
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";		
				}
		break;
		
		case $type5683:
		if((searchavailspec($allspec, $spec700024)+
		searchavailspec($allspec, $spec144)+
		searchavailspec($allspec, $spec145)+
		searchavailspec($allspec, $spec146)+
		searchavailspec($allspec, $spec24)+
		searchavailspec($allspec, $spec17700024))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (общестроительные работы)</b></font>";
				}
		break;		
		
		case $type5684:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec17700026))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</b></font>";
				}
		break;		

		case $type5685:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec17700026))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</b></font>";
				}
		break;		
		
		case $type5686:
		if(
		searchavailspec($allspec, $spec277)>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (устройство систем холодоснабжения)</b></font>";
				}
		break;			
		
		case $type5687:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec17700026)+
		searchavailspec($allspec, $spec95)+
		searchavailspec($allspec, $spec700095))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</b></font>";
				}
		break;		
		
		case $type5688:
		if((searchavailspec($allspec, $spec700057)+
		searchavailspec($allspec, $spec57))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области газоснабжения)</b></font>";
				}
		break;
		
		case $type5689:
		if((searchavailspec($allspec, $spec700030)+
		searchavailspec($allspec, $spec30)+
		searchavailspec($allspec, $spec17700030))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области электроснабжения и автоматизации)</b></font>";
				}
		break;	
				

		case $type5690:
		if((searchavailspec($allspec, $spec700097)+
		searchavailspec($allspec, $spec97)+
		searchavailspec($allspec, $spec17700097))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области связи, сигнализации)</b></font>";
				}
		break;	
		

		case $type5691:
		if((searchavailspec($allspec, $spec700033)+
		searchavailspec($allspec, $spec33)+
		searchavailspec($allspec, $spec17700033))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (строительство автомобильных дорог и аэродромов, строительство мостов, транспортных эстакад и путепроводов)</b></font>";
				}
		break;		
		
		case $type5692:
		if((searchavailspec($allspec, $spec700084)+
		searchavailspec($allspec, $spec84)+
		searchavailspec($allspec, $spec17700084))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (строительство железных дорог)</b></font>";
				}
		break;		
		

		case $type5693:
		if((searchavailspec($allspec, $spec700085)+
		searchavailspec($allspec, $spec85)+
		searchavailspec($allspec, $spec17700085))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (строительство сооружений транспортных тоннелей, метрополитенов)</b></font>";
				}
		break;	
		
		case $type5694:
		if((searchavailspec($allspec, $spec700034)+
		searchavailspec($allspec, $spec34))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (гидротехническое и мелиоративное строительство)</b></font>";
				}
		break;	
		
		case $type5695:
		if((searchavailspec($allspec, $spec710113)+
		searchavailspec($allspec, $spec20113)+
		searchavailspec($allspec, $spec700113)+
		searchavailspec($allspec, $spec113))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (благоустройство территорий)</b></font>";
				}
		break;		
		
		
		case $type5696:
		if(searchavailspec($allspec, $spec276)>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (монтаж технологических трубопроводов и оборудования)</b></font>";
				}
		break;		

		case $type5697:
		if((searchavailspec($allspec, $spec700061)+
		searchavailspec($allspec, $spec17700061)+
		searchavailspec($allspec, $spec61))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (устройство магистральных трубопроводов для транспортирования нефти, газа, нефтепродуктов)</b></font>";
				}
		break;
		
		case $type5698:
		if((searchavailspec($allspec, $spec700064)+
		searchavailspec($allspec, $spec3)+
		searchavailspec($allspec, $spec64))>=4 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов <b>ГАП</b> меньше 4</font>";
				}
		break;		
		
		case $type5699:
		break;		
		
		case $type5700:
		break;	
		
		
		case $type5701:
		break;
		
		case $type5702:
		break;
		
		
		case $type5703:
		break;
		
		
		case $type5704:
		break;
		
		
		case $type5705:
		break;
		
		case $type5706:
		if((searchavailspec($allspec, $spec71043)+
		searchavailspec($allspec, $spec71044)+
		searchavailspec($allspec, $spec71045)+
		searchavailspec($allspec, $spec71039)+
		searchavailspec($allspec, $spec71046)+
		searchavailspec($allspec, $spec71048)+
		searchavailspec($allspec, $spec71047)+
		searchavailspec($allspec, $spec71059)+
		searchavailspec($allspec, $spec71063)+
		searchavailspec($allspec, $spec71074)+
		searchavailspec($allspec, $spec700128)+
		searchavailspec($allspec, $spec700047)+
		searchavailspec($allspec, $spec710128)+
		searchavailspec($allspec, $spec700048)+
		searchavailspec($allspec, $spec700045)+
		searchavailspec($allspec, $spec700046)+
		searchavailspec($allspec, $spec700073)+
		searchavailspec($allspec, $spec700059)+
		searchavailspec($allspec, $spec700039)+
		searchavailspec($allspec, $spec700126)+
		searchavailspec($allspec, $spec700043)+
		searchavailspec($allspec, $spec700096)+
		searchavailspec($allspec, $spec700074)+
		searchavailspec($allspec, $spec700063)+
		searchavailspec($allspec, $spec700044)+
		searchavailspec($allspec, $spec150)+
		searchavailspec($allspec, $spec17700043)+
		searchavailspec($allspec, $spec17700044)+
		searchavailspec($allspec, $spec45)+
		searchavailspec($allspec, $spec39)+
		searchavailspec($allspec, $spec17700046)+
		searchavailspec($allspec, $spec17700048)+
		searchavailspec($allspec, $spec17700047)+
		searchavailspec($allspec, $spec17700059)+
		searchavailspec($allspec, $spec63)+
		searchavailspec($allspec, $spec73)+
		searchavailspec($allspec, $spec96)+
		searchavailspec($allspec, $spec17700074)+
		searchavailspec($allspec, $spec126)+
		searchavailspec($allspec, $spec128)+
		searchavailspec($allspec, $spec278)+
		searchavailspec($allspec, $spec43)+
		searchavailspec($allspec, $spec44)+
		searchavailspec($allspec, $spec46)+
		searchavailspec($allspec, $spec48)+
		searchavailspec($allspec, $spec47)+
		searchavailspec($allspec, $spec59)+
		searchavailspec($allspec, $spec74)+
		searchavailspec($allspec, $spec260)+
		searchavailspec($allspec, $spec261)+
		searchavailspec($allspec, $spec262)+
		searchavailspec($allspec, $spec263))<1)
		{
				echo "<font color=\"ff0000\">Нет ни одного <b>главного инженера</b></font>";
				}					
		elseif	
		((searchavailspec($allspec, $spec710114)+
		searchavailspec($allspec, $spec710115)+
		searchavailspec($allspec, $spec710116)+
		searchavailspec($allspec, $spec710117)+
		searchavailspec($allspec, $spec710118)+
		searchavailspec($allspec, $spec710119)+
		searchavailspec($allspec, $spec710120)+
		searchavailspec($allspec, $spec710121)+
		searchavailspec($allspec, $spec710122)+
		searchavailspec($allspec, $spec710123)+
		searchavailspec($allspec, $spec710124)+
		searchavailspec($allspec, $spec710125)+
		searchavailspec($allspec, $spec700120)+
		searchavailspec($allspec, $spec700115)+
		searchavailspec($allspec, $spec700122)+
		searchavailspec($allspec, $spec700124)+
		searchavailspec($allspec, $spec700125)+
		searchavailspec($allspec, $spec700114)+
		searchavailspec($allspec, $spec700117)+
		searchavailspec($allspec, $spec700121)+
		searchavailspec($allspec, $spec700123)+
		searchavailspec($allspec, $spec700118)+
		searchavailspec($allspec, $spec700116)+
		searchavailspec($allspec, $spec700119)+
		searchavailspec($allspec, $spec700147)+
		searchavailspec($allspec, $spec247)+
		searchavailspec($allspec, $spec147)+
		searchavailspec($allspec, $spec17700114)+
		searchavailspec($allspec, $spec17700115)+
		searchavailspec($allspec, $spec116)+
		searchavailspec($allspec, $spec117)+
		searchavailspec($allspec, $spec17700118)+
		searchavailspec($allspec, $spec119)+
		searchavailspec($allspec, $spec17700120)+
		searchavailspec($allspec, $spec17700121)+
		searchavailspec($allspec, $spec122)+
		searchavailspec($allspec, $spec123)+
		searchavailspec($allspec, $spec17700124)+
		searchavailspec($allspec, $spec125)+
		searchavailspec($allspec, $spec114)+
		searchavailspec($allspec, $spec115)+
		searchavailspec($allspec, $spec118)+
		searchavailspec($allspec, $spec120)+
		searchavailspec($allspec, $spec121)+
		searchavailspec($allspec, $spec124)+
		searchavailspec($allspec, $spec264)+
		searchavailspec($allspec, $spec265)+
		searchavailspec($allspec, $spec266))<1)
		
				{
				echo "<font color=\"ff0000\">Нет ни одного <b>начальника (заместителя) ПТО</b></font>";
				}
		elseif	
		((searchavailspec($allspec, $spec700141)+
		searchavailspec($allspec, $spec141))<1)
		
				{
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по сметной работе</b></font>";
				}			
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";		
				}
		break;		
		
		case $type5707:
		if((searchavailspec($allspec, $spec71043)+
		searchavailspec($allspec, $spec71044)+
		searchavailspec($allspec, $spec71045)+
		searchavailspec($allspec, $spec71039)+
		searchavailspec($allspec, $spec71046)+
		searchavailspec($allspec, $spec71048)+
		searchavailspec($allspec, $spec71047)+
		searchavailspec($allspec, $spec71059)+
		searchavailspec($allspec, $spec71063)+
		searchavailspec($allspec, $spec71074)+
		searchavailspec($allspec, $spec700128)+
		searchavailspec($allspec, $spec700047)+
		searchavailspec($allspec, $spec710128)+
		searchavailspec($allspec, $spec700048)+
		searchavailspec($allspec, $spec700045)+
		searchavailspec($allspec, $spec700046)+
		searchavailspec($allspec, $spec700073)+
		searchavailspec($allspec, $spec700059)+
		searchavailspec($allspec, $spec700039)+
		searchavailspec($allspec, $spec700126)+
		searchavailspec($allspec, $spec700043)+
		searchavailspec($allspec, $spec700096)+
		searchavailspec($allspec, $spec700074)+
		searchavailspec($allspec, $spec700063)+
		searchavailspec($allspec, $spec700044)+
		searchavailspec($allspec, $spec150)+
		searchavailspec($allspec, $spec17700043)+
		searchavailspec($allspec, $spec17700044)+
		searchavailspec($allspec, $spec45)+
		searchavailspec($allspec, $spec39)+
		searchavailspec($allspec, $spec17700046)+
		searchavailspec($allspec, $spec17700048)+
		searchavailspec($allspec, $spec17700047)+
		searchavailspec($allspec, $spec17700059)+
		searchavailspec($allspec, $spec63)+
		searchavailspec($allspec, $spec73)+
		searchavailspec($allspec, $spec96)+
		searchavailspec($allspec, $spec17700074)+
		searchavailspec($allspec, $spec126)+
		searchavailspec($allspec, $spec128)+
		searchavailspec($allspec, $spec278)+
		searchavailspec($allspec, $spec43)+
		searchavailspec($allspec, $spec44)+
		searchavailspec($allspec, $spec46)+
		searchavailspec($allspec, $spec48)+
		searchavailspec($allspec, $spec47)+
		searchavailspec($allspec, $spec59)+
		searchavailspec($allspec, $spec74)+
		searchavailspec($allspec, $spec260)+
		searchavailspec($allspec, $spec261)+
		searchavailspec($allspec, $spec262)+
		searchavailspec($allspec, $spec263))<1)
		{
				echo "<font color=\"ff0000\">Нет ни одного <b>главного инженера</b></font>";
				}					
		elseif	
		((searchavailspec($allspec, $spec710114)+
		searchavailspec($allspec, $spec710115)+
		searchavailspec($allspec, $spec710116)+
		searchavailspec($allspec, $spec710117)+
		searchavailspec($allspec, $spec710118)+
		searchavailspec($allspec, $spec710119)+
		searchavailspec($allspec, $spec710120)+
		searchavailspec($allspec, $spec710121)+
		searchavailspec($allspec, $spec710122)+
		searchavailspec($allspec, $spec710123)+
		searchavailspec($allspec, $spec710124)+
		searchavailspec($allspec, $spec710125)+
		searchavailspec($allspec, $spec700120)+
		searchavailspec($allspec, $spec700115)+
		searchavailspec($allspec, $spec700122)+
		searchavailspec($allspec, $spec700124)+
		searchavailspec($allspec, $spec700125)+
		searchavailspec($allspec, $spec700114)+
		searchavailspec($allspec, $spec700117)+
		searchavailspec($allspec, $spec700121)+
		searchavailspec($allspec, $spec700123)+
		searchavailspec($allspec, $spec700118)+
		searchavailspec($allspec, $spec700116)+
		searchavailspec($allspec, $spec700119)+
		searchavailspec($allspec, $spec700147)+
		searchavailspec($allspec, $spec247)+
		searchavailspec($allspec, $spec147)+
		searchavailspec($allspec, $spec17700114)+
		searchavailspec($allspec, $spec17700115)+
		searchavailspec($allspec, $spec116)+
		searchavailspec($allspec, $spec117)+
		searchavailspec($allspec, $spec17700118)+
		searchavailspec($allspec, $spec119)+
		searchavailspec($allspec, $spec17700120)+
		searchavailspec($allspec, $spec17700121)+
		searchavailspec($allspec, $spec122)+
		searchavailspec($allspec, $spec123)+
		searchavailspec($allspec, $spec17700124)+
		searchavailspec($allspec, $spec125)+
		searchavailspec($allspec, $spec114)+
		searchavailspec($allspec, $spec115)+
		searchavailspec($allspec, $spec118)+
		searchavailspec($allspec, $spec120)+
		searchavailspec($allspec, $spec121)+
		searchavailspec($allspec, $spec124)+
		searchavailspec($allspec, $spec264)+
		searchavailspec($allspec, $spec265)+
		searchavailspec($allspec, $spec266))<1)
		
				{
				echo "<font color=\"ff0000\">Нет ни одного <b>начальника (заместителя) ПТО</b></font>";
				}
		elseif	
		((searchavailspec($allspec, $spec700141)+
		searchavailspec($allspec, $spec141))<1)
		
				{
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по сметной работе</b></font>";
				}			
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";		
				}
		break;
		
		case $type5708:
		break;
			
		
		case $type5709:
				if((searchavailspec($allspec, $spec140)+searchavailspec($allspec, $spec142)+
				searchavailspec($allspec, $spec700140)+searchavailspec($allspec, $spec700142))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>главного или ведущего геодезиста</b></font>";
				}
		break;		
		
		
		case $type5710:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5711:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec15)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec16)+searchavailspec($allspec, $spec76)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec78)+
				searchavailspec($allspec, $spec79)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec81)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700216)+searchavailspec($allspec, $spec17700243)+
				searchavailspec($allspec, $spec17700245)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec245)+searchavailspec($allspec, $spec205)+
				searchavailspec($allspec, $spec231)+searchavailspec($allspec, $spec233)+
				searchavailspec($allspec, $spec234)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec215)+
				searchavailspec($allspec, $spec216)+searchavailspec($allspec, $spec243))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5712:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec17700195)+searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec224)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700237)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5713:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;

		case $type5714:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5715:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5716:
				if((searchavailspec($allspec, $spec270)+searchavailspec($allspec, $spec274))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5717:
				if((searchavailspec($allspec, $spec11)+searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec0)+
				searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec16)+searchavailspec($allspec, $spec76)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec78)+
				searchavailspec($allspec, $spec79)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec81)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700205)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec226)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec206)+searchavailspec($allspec, $spec208)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec17700243)+
				searchavailspec($allspec, $spec17700245)+searchavailspec($allspec, $spec17700215)+
				searchavailspec($allspec, $spec17700216)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec203)+searchavailspec($allspec, $spec205)+
				searchavailspec($allspec, $spec231)+searchavailspec($allspec, $spec233)+
				searchavailspec($allspec, $spec234)+searchavailspec($allspec, $spec215)+
				searchavailspec($allspec, $spec216)+searchavailspec($allspec, $spec243)+
				searchavailspec($allspec, $spec245)+searchavailspec($allspec, $spec195))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $typetype5718:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5719:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec196))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5720:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec267)+searchavailspec($allspec, $spec271))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5721:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5722:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5723:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;			
		
		case $type5724:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
				
		case $type5725:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec76)+searchavailspec($allspec, $spec77)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec17700195)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700197)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec17700203)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec197)+searchavailspec($allspec, $spec225)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec205)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec233)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		
		case $type5726:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5727:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;			
		

		case $type5728:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec110)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700211)+searchavailspec($allspec, $spec17700239)+
				searchavailspec($allspec, $spec211)+searchavailspec($allspec, $spec239)+				
				searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;			
				
		case $type5729:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type5730:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;			
		
		case $type5731:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5732:
				if((searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec76)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec17700205)+searchavailspec($allspec, $spec17700231)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec212)+
				searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec205)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec235))>=1){
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
				
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))>=1)	
			{
				echo "<font color=\"ff0000\">Нет обязательных<b>аттестованных специалистов</b></font>";
				}	
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
		break;

		case $type5733:
				if((searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec17700204)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700232)+
				searchavailspec($allspec, $spec204)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec232))>=1){
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))>=1)	
			{
				echo "<font color=\"ff0000\">Нет обязательных<b>аттестованных специалистов</b></font>";
				}	
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
		break;
		
		case $type5734:
				if((searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec234))>=1){
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))>=1)	
			{
				echo "<font color=\"ff0000\">Нет обязательных<b>аттестованных специалистов</b></font>";
				}	
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
		break;			

		case $type5735:
				if((searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec207)+searchavailspec($allspec, $spec234))>=1){
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))>=1)	
			{
				echo "<font color=\"ff0000\">Нет обязательных<b>аттестованных специалистов</b></font>";
				}	
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
		break;		
		

		case $type5736:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec17700216)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700245)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec245)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec216))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
				
		case $type5737:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec81)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700246)+
				searchavailspec($allspec, $spec17700217)+searchavailspec($allspec, $spec17700215)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec217)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec246))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5738:
				if((searchavailspec($allspec, $spec13)+searchavailspec($allspec, $spec193)+
				searchavailspec($allspec, $spec221))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
				
		case $type5739:
				if((searchavailspec($allspec, $spec0)+searchavailspec($allspec, $spec16)+
				searchavailspec($allspec, $spec218)+searchavailspec($allspec, $spec244))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;	
				
		case $type5740:
				if((searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec206)+searchavailspec($allspec, $spec207)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec234))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5741:
				if((searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5742:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5743:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
				
		case $type5744:
				if((searchavailspec($allspec, $spec710112)+searchavailspec($allspec, $spec112)+
				searchavailspec($allspec, $spec20112)+searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec220))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5745:
				if((searchavailspec($allspec, $spec82)+searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec224))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
				
		
		case $type5746:
				if((searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700237)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5747:	
				if((searchavailspec($allspec, $spec269)+searchavailspec($allspec, $spec273))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type5748:	
				if((searchavailspec($allspec, $spec17)+searchavailspec($allspec, $spec214)
					+searchavailspec($allspec, $spec242))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5749:
						if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)
					+searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
				
		case $type5750:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5751:
				if((searchavailspec($allspec, $spec268)+searchavailspec($allspec, $spec272))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;	
		
	case $type5752:
	break;
	
	case $type5901:
				if((searchavailspec($allspec, $spec700093)+searchavailspec($allspec, $spec700135)
					+searchavailspec($allspec, $spec800135)+searchavailspec($allspec, $spec93)+
				searchavailspec($allspec, $spec17700135))>=4){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
				else {
				echo "<font color=\"ff0000\">Не достаточно <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		
		case $type5903:
				if(searchavailspec($allspec, $spec250)>=4){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
				else {
				echo "<font color=\"ff0000\">Не достаточно специалистов, осуществляющих <b>обследование автомобильных дорог и мостовых сооружений</b></font>";
				}
		break;
		
		
        case $type5902:
				if((searchavailspec($allspec, $spec253)+searchavailspec($allspec, $spec254)
					+searchavailspec($allspec, $spec255)+searchavailspec($allspec, $spec256)+
				searchavailspec($allspec, $spec257)+searchavailspec($allspec, $spec258)
				+searchavailspec($allspec, $spec259))>=4){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
				else {
				echo "<font color=\"ff0000\">Не достаточно <b>аттестованных специалистов</b></font>";
				}
		break;		
	
	
	
	
		}	
	
		} 
}		
    break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////CASE 3//////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	  
    case 3:
	if($vidyrabot1 < $outdate){
	 for ($i = 0; $i <= count($types_of_jobs[$k]->field_field_vidyrab); $i++) 
		{ 
			$types_of_jobs2=$types_of_jobs[$k]->field_field_vidyrab[$i][raw];
			$types_of_jobs3=$types_of_jobs2[taxonomy_term]->name;
			$vidyrabot[$k][$i]=$types_of_jobs3; // переменная для вывода вне массива
			print_r ("</br>".$types_of_jobs3."</br>");
	
	

	switch ($types_of_jobs3) {
		
		
		
        case $type163:
		break;
		
		case $type164:
		if((searchavailspec($allspec, $spec700166)+searchavailspec($allspec, $spec166)+searchavailspec($allspec, $spec173))>=3){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-геодезические изыскания</b> меньше 3</font>";
				}
		break;
		
		case $type165:
			if((searchavailspec($allspec, $spec700167)+searchavailspec($allspec, $spec167)+searchavailspec($allspec, $spec174))>=3){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-геологические изыскания</b> меньше 3</font>";
				}
		break;
		
		case $type166:
			if((searchavailspec($allspec, $spec700168)+searchavailspec($allspec, $spec168))>=3){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-гидрометеорологические изыскания</b> меньше 3</font>";
				}
		break;
		
		case $type167:
			if((searchavailspec($allspec, $spec700169)+searchavailspec($allspec, $spec169))>=3){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-экологические изыскания</b> меньше 3</font>";
				}
		break;
		
		case $type168:
			if((searchavailspec($allspec, $spec700170)+searchavailspec($allspec, $spec170))>=3){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-геотехнические изыскания</b> меньше 3</font>";
				}
		break;
		
		case $type169:
			if((searchavailspec($allspec, $spec171)+searchavailspec($allspec, $spec171))>=3){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>обследование состояния грунтов оснований зданий и сооружений</b> меньше 3</font>";
				}
		break;
		
	
		case $type170:
			if((searchavailspec($allspec, $spec700064)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3))>=1 or (searchavailspec($allspec, $spec4)+searchavailspec($allspec, $spec148)+searchavailspec($allspec, $spec17700129)+searchavailspec($allspec, $spec129)+searchavailspec($allspec, $spec275))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного специалиста <b>ГАП</b> или <b>ГИП</b></font>";
				}
		break;
		
		case $type171:
			if(
			(searchavailspec($allspec, $spec700101)+
			 searchavailspec($allspec, $spec700102)+
			 searchavailspec($allspec, $spec700103)+
			 searchavailspec($allspec, $spec700104)+
			 searchavailspec($allspec, $spec700105)+
			 searchavailspec($allspec, $spec700106)+
			 searchavailspec($allspec, $spec700107)+
			 searchavailspec($allspec, $spec700108)+
			 searchavailspec($allspec, $spec700109)+
			 searchavailspec($allspec, $spec700162)+
			 searchavailspec($allspec, $spec17700101)+
			 searchavailspec($allspec, $spec17700102)+
			 searchavailspec($allspec, $spec17700103)+
			 searchavailspec($allspec, $spec17700104)+
			 searchavailspec($allspec, $spec17700105)+
			 searchavailspec($allspec, $spec17700106)+
			 searchavailspec($allspec, $spec17700107)+
			 searchavailspec($allspec, $spec17700108)+
			 searchavailspec($allspec, $spec17700109)+
			 searchavailspec($allspec, $spec138)+
			 searchavailspec($allspec, $spec137)+
			 searchavailspec($allspec, $spec162)+
			 searchavailspec($allspec, $spec101)+
			 searchavailspec($allspec, $spec102)+
			 searchavailspec($allspec, $spec103)+
			 searchavailspec($allspec, $spec104)+
			 searchavailspec($allspec, $spec105)+
			 searchavailspec($allspec, $spec106)+
			 searchavailspec($allspec, $spec107)+
			 searchavailspec($allspec, $spec108)+
			 searchavailspec($allspec, $spec109))<1) 
			 {
				echo "<font color=\"ff0000\">Нет ни одного аттестованного <b>начальника (заведующего) структурного подразделения</b></font>";
				}
			elseif	(searchavailspec($allspec, $spec700064)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3))<2 or (searchavailspec($allspec, $spec4)+searchavailspec($allspec, $spec148)+searchavailspec($allspec, $spec17700129)+searchavailspec($allspec, $spec129)+searchavailspec($allspec, $spec275))<2)
             {
				echo "<font color=\"ff0000\">Количество специалистов <b>ГАП</b> или <b>ГИП</b> меньше 2</font>";
				}
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
		break;
					
		case $type196:
		break;
		
		case $type197:
			if((searchavailspec($allspec, $spec700163)+searchavailspec($allspec, $spec163))>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (генеральный план)</b></font>";
				}
		break;
		
		case $type198:
			if((searchavailspec($allspec, $spec252)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3)+searchavailspec($allspec, $spec700064))>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (архитектурные решения)</b> либо <b>ГАПа</b></font>";
				}
		break;
		
		case $type199:
			if(searchavailspec($allspec, $spec139)>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (сметная документация)</b></font>";
				}
		break;
		
		
		case $type200:			
		if((searchavailspec($allspec, $spec66)+searchavailspec($allspec, $spec17700066)+searchavailspec($allspec, $spec700066))>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (конструктивные решения)</b></font>";
				}			
		break;
		
		case $type543:
		break;
		
		case $type5435:
			if((searchavailspec($allspec, $spec17700071)+searchavailspec($allspec, $spec700071)+searchavailspec($allspec, $spec71))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (холодоснабжение))</b></font>";
				}
		break;
		
				
		case $type5436:
			if((searchavailspec($allspec, $spec17700067)+searchavailspec($allspec, $spec700067)+searchavailspec($allspec, $spec67))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</b></font>";
				}
		break;
		
		case $type5438:
			if((searchavailspec($allspec, $spec17700067)+searchavailspec($allspec, $spec700067)+searchavailspec($allspec, $spec67))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</b></font>";
				}
		break;
		
		
		case $type5441:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</b></font>";
				}
		break;
		
		case $type5442:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</b></font>";
				}
		break;
		
		case $type5443:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</b></font>";
				}
		break;
		
		case $type5444:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;
		case $type5453:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;
		case $type5454:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;
		
		
		case $type5439:
			if((searchavailspec($allspec, $spec17700068)+searchavailspec($allspec, $spec700068)+searchavailspec($allspec, $spec68))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (отопление, вентиляция и кондиционирование воздуха))</b></font>";
				}
		break;
		
		case $type5440:
			if((searchavailspec($allspec, $spec17700068)+searchavailspec($allspec, $spec700068)+searchavailspec($allspec, $spec68))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (отопление, вентиляция и кондиционирование воздуха))</b></font>";
				}
		break;	
		
		case $type5437:
			if((searchavailspec($allspec, $spec17700069)+searchavailspec($allspec, $spec700069)+searchavailspec($allspec, $spec69))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</b></font>";
				}
		break;


		case $type5445: /*4.6. наружные сети и системы:*/
		break;
		
		case $type5446:
			if((searchavailspec($allspec, $spec17700070)+searchavailspec($allspec, $spec700070)+searchavailspec($allspec, $spec70))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (тепловые сети))</b></font>";
				}
		break;
		
		case $type5447:
			if((searchavailspec($allspec, $spec700067)+searchavailspec($allspec, $spec67))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</b></font>";
				}
		break;	
		
		case $type5449:
			if((searchavailspec($allspec, $spec700067)+searchavailspec($allspec, $spec67))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</b></font>";
				}
		break;	
		
		case $type5450:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</b></font>";
				}
		break;
		
		case $type5451:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;
		case $type5455:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;
		
		case $type5456:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;
		
		case $type5448:
			if((searchavailspec($allspec, $spec17700069)+searchavailspec($allspec, $spec700069)+searchavailspec($allspec, $spec69))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</b></font>";
				}
		break;

		case $type202: 
		break;
		
		case $type5457: /*4.8.:*/
		break;
		
		case $type5459:
				if(searchavailspec($allspec, $spec249)>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерно-технические мероприятия гражданской обороны. Мероприятия по предупреждению чрезвычайных ситуаций)</b></font>";
				}
		break;
		case $type5460:
				if(searchavailspec($allspec, $spec249)>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерно-технические мероприятия гражданской обороны. Мероприятия по предупреждению чрезвычайных ситуаций)</b></font>";
				}
		break;
		case $type5461:
				if(searchavailspec($allspec, $spec249)>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерно-технические мероприятия гражданской обороны. Мероприятия по предупреждению чрезвычайных ситуаций)</b></font>";
				}
		break;
		
		case $type5462:
			if((searchavailspec($allspec, $spec700164)+searchavailspec($allspec, $spec164))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (организация строительства)</b></font>";
				}
		break;
		
		case $type5458:
			if(searchavailspec($allspec, $spec248)>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (охрана окружающей среды)</b></font>";
				}
		break;		
		
		case $type205:/*5. Выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов первого-четвертого классов сложности*/
		break;
		
		case $type206:
		break;
		
		case $type207:
				$count=0;
				$count=countoverzero(searchavailspec($allspec, $spec17700024),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700024),$count);
				$count=countoverzero(searchavailspec($allspec, $spec144),$count);
				$count=countoverzero(searchavailspec($allspec, $spec145),$count);
				$count=countoverzero(searchavailspec($allspec, $spec146),$count);
				$count=countoverzero(searchavailspec($allspec, $spec24),$count);				
				$count=countoverzero(searchavailspec($allspec, $spec17700026),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700026),$count);
				$count=countoverzero(searchavailspec($allspec, $spec26),$count);
				$count=countoverzero(searchavailspec($allspec, $spec277),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700095),$count);
				$count=countoverzero(searchavailspec($allspec, $spec95),$count);
				$count=countoverzero(searchavailspec($allspec, $spec57),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700057),$count);				
				$count=countoverzero(searchavailspec($allspec, $spec17700030),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700030),$count);
				$count=countoverzero(searchavailspec($allspec, $spec30),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec17700097),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700097),$count);
				$count=countoverzero(searchavailspec($allspec, $spec97),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec17700033),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700033),$count);
				$count=countoverzero(searchavailspec($allspec, $spec33),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec17700084),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700084),$count);
				$count=countoverzero(searchavailspec($allspec, $spec84),$count);				
				$count=countoverzero(searchavailspec($allspec, $spec17700085),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700085),$count);
				$count=countoverzero(searchavailspec($allspec, $spec85),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec34),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700034),$count);
				$count=countoverzero(searchavailspec($allspec, $spec113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec20113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec710113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec276),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700061),$count);
				$count=countoverzero(searchavailspec($allspec, $spec17700061),$count);
				$count=countoverzero(searchavailspec($allspec, $spec61),$count);
				
		if((searchavailspec($allspec, $spec40)+searchavailspec($allspec, $spec700187)+searchavailspec($allspec, $spec188)+searchavailspec($allspec, $spec189)+searchavailspec($allspec, $spec187))<1)
		{
				echo "<font color=\"ff0000\">Нет ни одного руководителя проекта</font>";
				}		
				
		elseif	($count<4)
				{
				echo "<font color=\"ff0000\">Количество специалистов по техническому надзору меньше 4</font>";
				}
					
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";		
				}
		break;
		
		case $type208:
		if((searchavailspec($allspec, $spec700024)+
		searchavailspec($allspec, $spec144)+
		searchavailspec($allspec, $spec145)+
		searchavailspec($allspec, $spec146)+
		searchavailspec($allspec, $spec24)+
		searchavailspec($allspec, $spec17700024))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (общестроительные работы)</b></font>";
				}
		break;
		
		case $type209:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec17700026))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</b></font>";
				}
		break;
		
		case $type210:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec17700026))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</b></font>";
				}
		break;
		
		case $type211:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec17700026)+
		searchavailspec($allspec, $spec95)+
		searchavailspec($allspec, $spec700095))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</b></font>";
				}
		break;
		
		case $type212:
		if((searchavailspec($allspec, $spec700057)+
		searchavailspec($allspec, $spec57))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области газоснабжения)</b></font>";
				}
		break;

		case $type213:
		if((searchavailspec($allspec, $spec700030)+
		searchavailspec($allspec, $spec30)+
		searchavailspec($allspec, $spec17700030))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области электроснабжения и автоматизации)</b></font>";
				}
		break;

		case $type214:
		if((searchavailspec($allspec, $spec700097)+
		searchavailspec($allspec, $spec97)+
		searchavailspec($allspec, $spec17700097))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области связи, сигнализации)</b></font>";
				}
		break;

		case $type215:
		if((searchavailspec($allspec, $spec700033)+
		searchavailspec($allspec, $spec33)+
		searchavailspec($allspec, $spec17700033))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (строительство автомобильных дорог и аэродромов, строительство мостов, транспортных эстакад и путепроводов)</b></font>";
				}
		break;

		case $type216:
		if((searchavailspec($allspec, $spec700084)+
		searchavailspec($allspec, $spec84)+
		searchavailspec($allspec, $spec17700084))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (строительство железных дорог)</b></font>";
				}
		break;

		case $type217:
		if((searchavailspec($allspec, $spec700085)+
		searchavailspec($allspec, $spec85)+
		searchavailspec($allspec, $spec17700085))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (строительство сооружений транспортных тоннелей, метрополитенов)</b></font>";
				}
		break;

		case $type218:
		if((searchavailspec($allspec, $spec700034)+
		searchavailspec($allspec, $spec34))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (гидротехническое и мелиоративное строительство)</b></font>";
				}
		break;

		case $type219:
		if((searchavailspec($allspec, $spec710113)+
		searchavailspec($allspec, $spec20113)+
		searchavailspec($allspec, $spec700113)+
		searchavailspec($allspec, $spec113))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (благоустройство территорий)</b></font>";
				}
		break;

		case $type220:
		if((searchavailspec($allspec, $spec700064)+
		searchavailspec($allspec, $spec3)+
		searchavailspec($allspec, $spec64))>=4 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов <b>ГАП</b> меньше 4</font>";
				}
		break;
		
		
		case $type221:
		break;
		
		case $type222:
		break;
		
		case $type223:
		break;
		
		case $type224:
		break;
		
		case $type225:
		break;
		
		case $type226:
		break;
		
		
		case $type227:
		if((searchavailspec($allspec, $spec71043)+
		searchavailspec($allspec, $spec71044)+
		searchavailspec($allspec, $spec71045)+
		searchavailspec($allspec, $spec71039)+
		searchavailspec($allspec, $spec71046)+
		searchavailspec($allspec, $spec71048)+
		searchavailspec($allspec, $spec71047)+
		searchavailspec($allspec, $spec71059)+
		searchavailspec($allspec, $spec71063)+
		searchavailspec($allspec, $spec71074)+
		searchavailspec($allspec, $spec700128)+
		searchavailspec($allspec, $spec700047)+
		searchavailspec($allspec, $spec710128)+
		searchavailspec($allspec, $spec700048)+
		searchavailspec($allspec, $spec700045)+
		searchavailspec($allspec, $spec700046)+
		searchavailspec($allspec, $spec700073)+
		searchavailspec($allspec, $spec700059)+
		searchavailspec($allspec, $spec700039)+
		searchavailspec($allspec, $spec700126)+
		searchavailspec($allspec, $spec700043)+
		searchavailspec($allspec, $spec700096)+
		searchavailspec($allspec, $spec700074)+
		searchavailspec($allspec, $spec700063)+
		searchavailspec($allspec, $spec700044)+
		searchavailspec($allspec, $spec150)+
		searchavailspec($allspec, $spec17700043)+
		searchavailspec($allspec, $spec17700044)+
		searchavailspec($allspec, $spec45)+
		searchavailspec($allspec, $spec39)+
		searchavailspec($allspec, $spec17700046)+
		searchavailspec($allspec, $spec17700048)+
		searchavailspec($allspec, $spec17700047)+
		searchavailspec($allspec, $spec17700059)+
		searchavailspec($allspec, $spec63)+
		searchavailspec($allspec, $spec73)+
		searchavailspec($allspec, $spec96)+
		searchavailspec($allspec, $spec17700074)+
		searchavailspec($allspec, $spec126)+
		searchavailspec($allspec, $spec128)+
		searchavailspec($allspec, $spec278)+
		searchavailspec($allspec, $spec43)+
		searchavailspec($allspec, $spec44)+
		searchavailspec($allspec, $spec46)+
		searchavailspec($allspec, $spec48)+
		searchavailspec($allspec, $spec47)+
		searchavailspec($allspec, $spec59)+
		searchavailspec($allspec, $spec74)+
		searchavailspec($allspec, $spec260)+
		searchavailspec($allspec, $spec261)+
		searchavailspec($allspec, $spec262)+
		searchavailspec($allspec, $spec263))<1)
		{
				echo "<font color=\"ff0000\">Нет ни одного <b>главного инженера</b></font>";
				}					
			
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";		
				}
		break;
		
	
		case $type228:
		break;
		
		case $type229:
				if((searchavailspec($allspec, $spec140)+searchavailspec($allspec, $spec142)+
				searchavailspec($allspec, $spec700140)+searchavailspec($allspec, $spec700142))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>главного или ведущего геодезиста</b></font>";
				}
		break;
		
		case $type230:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type231:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec15)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec16)+searchavailspec($allspec, $spec76)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec78)+
				searchavailspec($allspec, $spec79)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec81)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700216)+searchavailspec($allspec, $spec17700243)+
				searchavailspec($allspec, $spec17700245)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec245)+searchavailspec($allspec, $spec205)+
				searchavailspec($allspec, $spec231)+searchavailspec($allspec, $spec233)+
				searchavailspec($allspec, $spec234)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec215)+
				searchavailspec($allspec, $spec216)+searchavailspec($allspec, $spec243))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type232:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec17700195)+searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec224)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700237)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type233:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type234:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		
		case $type235:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type236:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec41)
					+searchavailspec($allspec, $spec82)+searchavailspec($allspec, $spec203)
				+searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)
				+searchavailspec($allspec, $spec224)+searchavailspec($allspec, $spec196)
				+searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec222)
				+searchavailspec($allspec, $spec17700203)+searchavailspec($allspec, $spec17700231)
				+searchavailspec($allspec, $spec231)+searchavailspec($allspec, $spec237)
				+searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223)
				+searchavailspec($allspec, $spec11))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type237:
				if((searchavailspec($allspec, $spec11)+searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec0)+
				searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec16)+searchavailspec($allspec, $spec76)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec78)+
				searchavailspec($allspec, $spec79)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec81)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700205)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec226)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec206)+searchavailspec($allspec, $spec208)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec17700243)+
				searchavailspec($allspec, $spec17700245)+searchavailspec($allspec, $spec17700215)+
				searchavailspec($allspec, $spec17700216)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec203)+searchavailspec($allspec, $spec205)+
				searchavailspec($allspec, $spec231)+searchavailspec($allspec, $spec233)+
				searchavailspec($allspec, $spec234)+searchavailspec($allspec, $spec215)+
				searchavailspec($allspec, $spec216)+searchavailspec($allspec, $spec243)+
				searchavailspec($allspec, $spec245)+searchavailspec($allspec, $spec195))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type238:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;			
		
		case $type239:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec196))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type240:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec267)+searchavailspec($allspec, $spec271))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		

		case $type241:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type242:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		
		case $type243:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		
		case $type244:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
				
		case $type245:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec76)+searchavailspec($allspec, $spec77)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec17700195)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700197)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec17700203)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec197)+searchavailspec($allspec, $spec225)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec205)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec233)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type246:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type247:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type248:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec110)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700211)+searchavailspec($allspec, $spec17700239)+
				searchavailspec($allspec, $spec211)+searchavailspec($allspec, $spec239)+				
				searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type249:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type250:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type251:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type252:
				if((searchavailspec($allspec, $spec11)+searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec76)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec17700205)+searchavailspec($allspec, $spec17700231)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec212)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec205)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec235)+searchavailspec($allspec, $spec212))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;	

		case $type253:
				if((searchavailspec($allspec, $spec11)+searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec17700204)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700232)+
				searchavailspec($allspec, $spec212)+searchavailspec($allspec, $spec240)+
				searchavailspec($allspec, $spec204)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec232))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type254:
				if((searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec212)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec212)+searchavailspec($allspec, $spec240)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec234))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type255:
				if((searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec79)+searchavailspec($allspec, $spec212)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec207)+searchavailspec($allspec, $spec234))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type256:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec17700216)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700245)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec245)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec216))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;

		case $type257:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec81)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700246)+
				searchavailspec($allspec, $spec17700217)+searchavailspec($allspec, $spec17700215)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec217)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec246))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type258:
		break;		
		
		case $type259:
				if((searchavailspec($allspec, $spec13)+searchavailspec($allspec, $spec193)+searchavailspec($allspec, $spec221))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type260:
				if((searchavailspec($allspec, $spec0)+searchavailspec($allspec, $spec16)+
				searchavailspec($allspec, $spec218)+searchavailspec($allspec, $spec244))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type261:
				if((searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec206)+searchavailspec($allspec, $spec207)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec234))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type262:
				if((searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type263:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type264:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type265:
				if((searchavailspec($allspec, $spec710112)+searchavailspec($allspec, $spec112)+
				searchavailspec($allspec, $spec20112)+searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec220))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;			
		
		case $type266:
				if((searchavailspec($allspec, $spec82)+searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec224))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;			
		
		case $type267:
				if((searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700237)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type268:
		break;		
		
		case $type269:
		break;		



		case $type270:
						if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)
					+searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type271:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
	
case $type272:
				if((searchavailspec($allspec, $spec700093)+searchavailspec($allspec, $spec700135)
					+searchavailspec($allspec, $spec800135)+searchavailspec($allspec, $spec93)+
				searchavailspec($allspec, $spec17700135))>=3){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
				else {
				echo "<font color=\"ff0000\">Не достаточно <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		
		case $type273:
				if(searchavailspec($allspec, $spec250)>=3){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
				else {
				echo "<font color=\"ff0000\">Не достаточно специалистов, осуществляющих <b>обследование автомобильных дорог и мостовых сооружений</b></font>";
				}
		break;
		
		
        case $type274:
				if((searchavailspec($allspec, $spec253)+searchavailspec($allspec, $spec254)
					+searchavailspec($allspec, $spec255)+searchavailspec($allspec, $spec256)+
				searchavailspec($allspec, $spec257)+searchavailspec($allspec, $spec258)
				+searchavailspec($allspec, $spec259))>=3){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
				else {
				echo "<font color=\"ff0000\">Не достаточно <b>аттестованных специалистов</b></font>";
				}
		break;		
		}
	
	
	} 
	}
	else {
			 for ($i = 0; $i <= count($types_of_jobs[$k]->field_field_vidy_rabot_13_05_2017_); $i++) 
		{ 
			$types_of_jobs2=$types_of_jobs[$k]->field_field_vidy_rabot_13_05_2017_[$i][raw];
			$types_of_jobs3=$types_of_jobs2[taxonomy_term]->name;
			$vidyrabot[$k][$i]=$types_of_jobs3; // переменная для вывода вне массива
			print_r ("</br>".$types_of_jobs3."</br>");
	
	

	switch ($types_of_jobs3) {
		
		case $type5594:
		break;
		
		case $type5595:
		if((searchavailspec($allspec, $spec700166)+searchavailspec($allspec, $spec166)+searchavailspec($allspec, $spec173))>=3){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-геодезические изыскания</b> меньше 3</font>";
				}
		break;
		
		case $type5616:
			if((searchavailspec($allspec, $spec700167)+searchavailspec($allspec, $spec167)+searchavailspec($allspec, $spec174))>=3){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-геологические изыскания</b> меньше 3</font>";
				}
		break;
		
		case $type5625:
			if((searchavailspec($allspec, $spec700168)+searchavailspec($allspec, $spec168))>=3){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-гидрометеорологические изыскания</b> меньше 3</font>";
				}
		break;	
		
		case $type5630:
			if((searchavailspec($allspec, $spec700169)+searchavailspec($allspec, $spec169))>=3){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-экологические изыскания</b> меньше 3</font>";
				}
		break;
		
		case $type5647:
			if((searchavailspec($allspec, $spec700170)+searchavailspec($allspec, $spec170))>=3){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-геотехнические изыскания</b> меньше 3</font>";
				}
		break;
		
		       case $type5648:
	   break;
	   case $type5649:
	   break;
	   case $type5650:
	   break;
	   case $type5651:
	   break;
	   case $type5652:
	   break;
	   case $type5653:
	   break;
		
		case $type5654:
			if((searchavailspec($allspec, $spec171)+searchavailspec($allspec, $spec171))>=3){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>обследование состояния грунтов оснований зданий и сооружений</b> меньше 3</font>";
				}
		break;
		
		case $type5655:
			if((searchavailspec($allspec, $spec700064)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3))>=1 or (searchavailspec($allspec, $spec4)+searchavailspec($allspec, $spec148)+searchavailspec($allspec, $spec17700129)+searchavailspec($allspec, $spec129)+searchavailspec($allspec, $spec275))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного специалиста <b>ГАП</b> или <b>ГИП</b></font>";
				}
		break;
		
		case $type5656:
			if(
			(searchavailspec($allspec, $spec700101)+
			 searchavailspec($allspec, $spec700102)+
			 searchavailspec($allspec, $spec700103)+
			 searchavailspec($allspec, $spec700104)+
			 searchavailspec($allspec, $spec700105)+
			 searchavailspec($allspec, $spec700106)+
			 searchavailspec($allspec, $spec700107)+
			 searchavailspec($allspec, $spec700108)+
			 searchavailspec($allspec, $spec700109)+
			 searchavailspec($allspec, $spec700162)+
			 searchavailspec($allspec, $spec17700101)+
			 searchavailspec($allspec, $spec17700102)+
			 searchavailspec($allspec, $spec17700103)+
			 searchavailspec($allspec, $spec17700104)+
			 searchavailspec($allspec, $spec17700105)+
			 searchavailspec($allspec, $spec17700106)+
			 searchavailspec($allspec, $spec17700107)+
			 searchavailspec($allspec, $spec17700108)+
			 searchavailspec($allspec, $spec17700109)+
			 searchavailspec($allspec, $spec138)+
			 searchavailspec($allspec, $spec137)+
			 searchavailspec($allspec, $spec162)+
			 searchavailspec($allspec, $spec101)+
			 searchavailspec($allspec, $spec102)+
			 searchavailspec($allspec, $spec103)+
			 searchavailspec($allspec, $spec104)+
			 searchavailspec($allspec, $spec105)+
			 searchavailspec($allspec, $spec106)+
			 searchavailspec($allspec, $spec107)+
			 searchavailspec($allspec, $spec108)+
			 searchavailspec($allspec, $spec109))<1) 
			 {
				echo "<font color=\"ff0000\">Нет ни одного аттестованного <b>начальника (заведующего) структурного подразделения</b></font>";
				}
			elseif	((searchavailspec($allspec, $spec700064)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3))<2 or (searchavailspec($allspec, $spec4)+searchavailspec($allspec, $spec148)+searchavailspec($allspec, $spec17700129)+searchavailspec($allspec, $spec129)+searchavailspec($allspec, $spec275))<2)
             {
				echo "<font color=\"ff0000\">Количество специалистов <b>ГАП</b> или <b>ГИП</b> меньше 2</font>";
				}
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
		break;		
		
		case $type5658:
			if((searchavailspec($allspec, $spec700163)+searchavailspec($allspec, $spec163))>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (генеральный план)</b></font>";
				}
		break;		
			
		case $type5659:
			if((searchavailspec($allspec, $spec252)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3)+searchavailspec($allspec, $spec700064))>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (архитектурные решения)</b> либо <b>ГАПа</b></font>";
				}
		break;		
				
		case $type5660:
			if(searchavailspec($allspec, $spec139)>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (сметная документация)</b></font>";
				}
		break;		
		
		case $type5661:
		if((searchavailspec($allspec, $spec66)+searchavailspec($allspec, $spec17700066)+searchavailspec($allspec, $spec700066))>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (конструктивные решения)</b></font>";
				}			
		break;		
		
		case $type5662:
		break;
		
		case $type5664:
			if((searchavailspec($allspec, $spec17700071)+searchavailspec($allspec, $spec700071)+searchavailspec($allspec, $spec71))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (холодоснабжение))</b></font>";
				}
		break;		
				
		case type5665:
			if((searchavailspec($allspec, $spec17700067)+searchavailspec($allspec, $spec700067)+searchavailspec($allspec, $spec67))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</b></font>";
				}
		break;		
		
		case $type5666:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</b></font>";
				}
		break;
				
		case $type5667:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;		
		
		case $type5663:
			if((searchavailspec($allspec, $spec17700068)+searchavailspec($allspec, $spec700068)+searchavailspec($allspec, $spec68))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (отопление, вентиляция и кондиционирование воздуха))</b></font>";
				}
		break;		
				
		case $type5669:
			if((searchavailspec($allspec, $spec17700069)+searchavailspec($allspec, $spec700069)+searchavailspec($allspec, $spec69))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</b></font>";
				}
		break;

		case $type5670:
		break;
		
		case $type5671:
			if((searchavailspec($allspec, $spec17700070)+searchavailspec($allspec, $spec700070)+searchavailspec($allspec, $spec70))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (тепловые сети))</b></font>";
				}
		break;		
			
		case $type5672:
			if((searchavailspec($allspec, $spec700067)+searchavailspec($allspec, $spec67))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</b></font>";
				}
		break;		
		
		case $type5673:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</b></font>";
				}
		break;		
		
		case $type5674:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;		
		
		case $type5675:
			if((searchavailspec($allspec, $spec17700069)+searchavailspec($allspec, $spec700069)+searchavailspec($allspec, $spec69))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</b></font>";
				}
		break;		
			
		case $type5676: 
		break;
		
		case $type5678:
			if((searchavailspec($allspec, $spec700164)+searchavailspec($allspec, $spec164))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (организация строительства)</b></font>";
				}
		break;		
		
		case $type5679:
			if(searchavailspec($allspec, $spec248)>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (охрана окружающей среды)</b></font>";
				}
		break;
		
		case $type5680:
		break;
		
		case $type5681:
		break;
		
		case $type5682:
				$count=0;
				$count=countoverzero(searchavailspec($allspec, $spec17700024),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700024),$count);
				$count=countoverzero(searchavailspec($allspec, $spec144),$count);
				$count=countoverzero(searchavailspec($allspec, $spec145),$count);
				$count=countoverzero(searchavailspec($allspec, $spec146),$count);
				$count=countoverzero(searchavailspec($allspec, $spec24),$count);				
				$count=countoverzero(searchavailspec($allspec, $spec17700026),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700026),$count);
				$count=countoverzero(searchavailspec($allspec, $spec26),$count);
				$count=countoverzero(searchavailspec($allspec, $spec277),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700095),$count);
				$count=countoverzero(searchavailspec($allspec, $spec95),$count);
				$count=countoverzero(searchavailspec($allspec, $spec57),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700057),$count);				
				$count=countoverzero(searchavailspec($allspec, $spec17700030),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700030),$count);
				$count=countoverzero(searchavailspec($allspec, $spec30),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec17700097),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700097),$count);
				$count=countoverzero(searchavailspec($allspec, $spec97),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec17700033),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700033),$count);
				$count=countoverzero(searchavailspec($allspec, $spec33),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec17700084),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700084),$count);
				$count=countoverzero(searchavailspec($allspec, $spec84),$count);				
				$count=countoverzero(searchavailspec($allspec, $spec17700085),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700085),$count);
				$count=countoverzero(searchavailspec($allspec, $spec85),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec34),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700034),$count);
				$count=countoverzero(searchavailspec($allspec, $spec113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec20113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec710113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec276),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700061),$count);
				$count=countoverzero(searchavailspec($allspec, $spec17700061),$count);
				$count=countoverzero(searchavailspec($allspec, $spec61),$count);
				
		if((searchavailspec($allspec, $spec40)+searchavailspec($allspec, $spec700187)+searchavailspec($allspec, $spec188)+searchavailspec($allspec, $spec189)+searchavailspec($allspec, $spec187))<1)
		{
				echo "<font color=\"ff0000\">Нет ни одного руководителя проекта</font>";
				}		
				
		elseif	($count<4)
				{
				echo "<font color=\"ff0000\">Количество специалистов по техническому надзору меньше 4</font>";
				}
					
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";		
				}
		break;
		
		case $type5683:
		if((searchavailspec($allspec, $spec700024)+
		searchavailspec($allspec, $spec144)+
		searchavailspec($allspec, $spec145)+
		searchavailspec($allspec, $spec146)+
		searchavailspec($allspec, $spec24)+
		searchavailspec($allspec, $spec17700024))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (общестроительные работы)</b></font>";
				}
		break;		
		
		case $type5684:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec17700026))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</b></font>";
				}
		break;		
		
		case $type5685:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec17700026))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</b></font>";
				}
		break;		
		
		case $type5686:
		if(
		searchavailspec($allspec, $spec277)>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (устройство систем холодоснабжения)</b></font>";
				}
		break;			
		
		case $type5687:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec17700026)+
		searchavailspec($allspec, $spec95)+
		searchavailspec($allspec, $spec700095))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</b></font>";
				}
		break;		
		
		case $type5688:
		if((searchavailspec($allspec, $spec700057)+
		searchavailspec($allspec, $spec57))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области газоснабжения)</b></font>";
				}
		break;
		
		case $type5689:
		if((searchavailspec($allspec, $spec700030)+
		searchavailspec($allspec, $spec30)+
		searchavailspec($allspec, $spec17700030))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области электроснабжения и автоматизации)</b></font>";
				}
		break;	
				
		case $type5690:
		if((searchavailspec($allspec, $spec700097)+
		searchavailspec($allspec, $spec97)+
		searchavailspec($allspec, $spec17700097))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области связи, сигнализации)</b></font>";
				}
		break;	
		
		case $type5691:
		if((searchavailspec($allspec, $spec700033)+
		searchavailspec($allspec, $spec33)+
		searchavailspec($allspec, $spec17700033))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (строительство автомобильных дорог и аэродромов, строительство мостов, транспортных эстакад и путепроводов)</b></font>";
				}
		break;		
		
		case $type5692:
		if((searchavailspec($allspec, $spec700084)+
		searchavailspec($allspec, $spec84)+
		searchavailspec($allspec, $spec17700084))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (строительство железных дорог)</b></font>";
				}
		break;		
		
		case $type5693:
		if((searchavailspec($allspec, $spec700085)+
		searchavailspec($allspec, $spec85)+
		searchavailspec($allspec, $spec17700085))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (строительство сооружений транспортных тоннелей, метрополитенов)</b></font>";
				}
		break;	
		
		case $type5694:
		if((searchavailspec($allspec, $spec700034)+
		searchavailspec($allspec, $spec34))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (гидротехническое и мелиоративное строительство)</b></font>";
				}
		break;	
		
		case $type5695:
		if((searchavailspec($allspec, $spec710113)+
		searchavailspec($allspec, $spec20113)+
		searchavailspec($allspec, $spec700113)+
		searchavailspec($allspec, $spec113))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (благоустройство территорий)</b></font>";
				}
		break;		
		
		
		case $type5696:
		if(searchavailspec($allspec, $spec276)>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (монтаж технологических трубопроводов и оборудования)</b></font>";
				}
		break;		

		case $type5697:
		if((searchavailspec($allspec, $spec700061)+
		searchavailspec($allspec, $spec17700061)+
		searchavailspec($allspec, $spec61))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (устройство магистральных трубопроводов для транспортирования нефти, газа, нефтепродуктов)</b></font>";
				}
		break;
		
		case $type5698:
		if((searchavailspec($allspec, $spec700064)+
		searchavailspec($allspec, $spec3)+
		searchavailspec($allspec, $spec64))>=4 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов <b>ГАП</b> меньше 4</font>";
				}
		break;		
		
		case $type5699:
		break;		
		
		case $type5700:
		break;	
		
		case $type5701:
		break;
		
		case $type5702:
		break;
		
		case $type5703:
		break;
		
		case $type5704:
		break;
		
		
		case $type5707:
		if((searchavailspec($allspec, $spec71043)+
		searchavailspec($allspec, $spec71044)+
		searchavailspec($allspec, $spec71045)+
		searchavailspec($allspec, $spec71039)+
		searchavailspec($allspec, $spec71046)+
		searchavailspec($allspec, $spec71048)+
		searchavailspec($allspec, $spec71047)+
		searchavailspec($allspec, $spec71059)+
		searchavailspec($allspec, $spec71063)+
		searchavailspec($allspec, $spec71074)+
		searchavailspec($allspec, $spec700128)+
		searchavailspec($allspec, $spec700047)+
		searchavailspec($allspec, $spec710128)+
		searchavailspec($allspec, $spec700048)+
		searchavailspec($allspec, $spec700045)+
		searchavailspec($allspec, $spec700046)+
		searchavailspec($allspec, $spec700073)+
		searchavailspec($allspec, $spec700059)+
		searchavailspec($allspec, $spec700039)+
		searchavailspec($allspec, $spec700126)+
		searchavailspec($allspec, $spec700043)+
		searchavailspec($allspec, $spec700096)+
		searchavailspec($allspec, $spec700074)+
		searchavailspec($allspec, $spec700063)+
		searchavailspec($allspec, $spec700044)+
		searchavailspec($allspec, $spec150)+
		searchavailspec($allspec, $spec17700043)+
		searchavailspec($allspec, $spec17700044)+
		searchavailspec($allspec, $spec45)+
		searchavailspec($allspec, $spec39)+
		searchavailspec($allspec, $spec17700046)+
		searchavailspec($allspec, $spec17700048)+
		searchavailspec($allspec, $spec17700047)+
		searchavailspec($allspec, $spec17700059)+
		searchavailspec($allspec, $spec63)+
		searchavailspec($allspec, $spec73)+
		searchavailspec($allspec, $spec96)+
		searchavailspec($allspec, $spec17700074)+
		searchavailspec($allspec, $spec126)+
		searchavailspec($allspec, $spec128)+
		searchavailspec($allspec, $spec278)+
		searchavailspec($allspec, $spec43)+
		searchavailspec($allspec, $spec44)+
		searchavailspec($allspec, $spec46)+
		searchavailspec($allspec, $spec48)+
		searchavailspec($allspec, $spec47)+
		searchavailspec($allspec, $spec59)+
		searchavailspec($allspec, $spec74)+
		searchavailspec($allspec, $spec260)+
		searchavailspec($allspec, $spec261)+
		searchavailspec($allspec, $spec262)+
		searchavailspec($allspec, $spec263))<1)
		{
				echo "<font color=\"ff0000\">Нет ни одного <b>главного инженера</b></font>";
				}					
			
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";		
				}
		break;
				
		case $type5708:
		break;
			
		case $type5709:
				if((searchavailspec($allspec, $spec140)+searchavailspec($allspec, $spec142)+
				searchavailspec($allspec, $spec700140)+searchavailspec($allspec, $spec700142))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>главного или ведущего геодезиста</b></font>";
				}
		break;		
		
		case $type5710:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5711:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec15)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec16)+searchavailspec($allspec, $spec76)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec78)+
				searchavailspec($allspec, $spec79)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec81)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700216)+searchavailspec($allspec, $spec17700243)+
				searchavailspec($allspec, $spec17700245)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec245)+searchavailspec($allspec, $spec205)+
				searchavailspec($allspec, $spec231)+searchavailspec($allspec, $spec233)+
				searchavailspec($allspec, $spec234)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec215)+
				searchavailspec($allspec, $spec216)+searchavailspec($allspec, $spec243))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5712:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec17700195)+searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec224)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700237)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5713:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;

		case $type5714:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5715:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5716:
				if((searchavailspec($allspec, $spec270)+searchavailspec($allspec, $spec274))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5717:
				if((searchavailspec($allspec, $spec11)+searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec0)+
				searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec16)+searchavailspec($allspec, $spec76)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec78)+
				searchavailspec($allspec, $spec79)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec81)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700205)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec226)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec206)+searchavailspec($allspec, $spec208)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec17700243)+
				searchavailspec($allspec, $spec17700245)+searchavailspec($allspec, $spec17700215)+
				searchavailspec($allspec, $spec17700216)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec203)+searchavailspec($allspec, $spec205)+
				searchavailspec($allspec, $spec231)+searchavailspec($allspec, $spec233)+
				searchavailspec($allspec, $spec234)+searchavailspec($allspec, $spec215)+
				searchavailspec($allspec, $spec216)+searchavailspec($allspec, $spec243)+
				searchavailspec($allspec, $spec245)+searchavailspec($allspec, $spec195))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $typetype5718:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5719:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec196))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5720:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec267)+searchavailspec($allspec, $spec271))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5721:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5722:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5723:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;			
		
		case $type5724:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
				
		case $type5725:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec76)+searchavailspec($allspec, $spec77)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec17700195)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700197)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec17700203)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec197)+searchavailspec($allspec, $spec225)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec205)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec233)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		
		case $type5726:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5727:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;			
		
		case $type5728:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec110)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700211)+searchavailspec($allspec, $spec17700239)+
				searchavailspec($allspec, $spec211)+searchavailspec($allspec, $spec239)+				
				searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;			
		
		case $type5729:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type5730:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;			
		
		case $type5731:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5732:
				if((searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec76)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec17700205)+searchavailspec($allspec, $spec17700231)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec212)+
				searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec205)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec235))>=1){
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
				
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))>=1)	
			{
				echo "<font color=\"ff0000\">Нет обязательных<b>аттестованных специалистов</b></font>";
				}	
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
		break;

		case $type5733:
				if((searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec17700204)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700232)+
				searchavailspec($allspec, $spec204)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec232))>=1){
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))>=1)	
			{
				echo "<font color=\"ff0000\">Нет обязательных<b>аттестованных специалистов</b></font>";
				}	
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
		break;
		
		case $type5734:
				if((searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec234))>=1){
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))>=1)	
			{
				echo "<font color=\"ff0000\">Нет обязательных<b>аттестованных специалистов</b></font>";
				}	
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
		break;			

		case $type5735:
				if((searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec207)+searchavailspec($allspec, $spec234))>=1){
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))>=1)	
			{
				echo "<font color=\"ff0000\">Нет обязательных<b>аттестованных специалистов</b></font>";
				}	
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
		break;	
		
		case $type5736:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec17700216)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700245)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec245)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec216))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5737:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec81)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700246)+
				searchavailspec($allspec, $spec17700217)+searchavailspec($allspec, $spec17700215)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec217)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec246))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5738:
				if((searchavailspec($allspec, $spec13)+searchavailspec($allspec, $spec193)+
				searchavailspec($allspec, $spec221))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		
		case $type5739:
				if((searchavailspec($allspec, $spec0)+searchavailspec($allspec, $spec16)+
				searchavailspec($allspec, $spec218)+searchavailspec($allspec, $spec244))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;	
		

		case $type5740:
				if((searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec206)+searchavailspec($allspec, $spec207)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec234))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5741:
				if((searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5742:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5743:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5744:
				if((searchavailspec($allspec, $spec710112)+searchavailspec($allspec, $spec112)+
				searchavailspec($allspec, $spec20112)+searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec220))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5745:
				if((searchavailspec($allspec, $spec82)+searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec224))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
				
		case $type5746:
				if((searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700237)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5747:	
				if((searchavailspec($allspec, $spec269)+searchavailspec($allspec, $spec273))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type5748:	
				if((searchavailspec($allspec, $spec17)+searchavailspec($allspec, $spec214)
					+searchavailspec($allspec, $spec242))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5749:
						if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)
					+searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type5750:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5751:
				if((searchavailspec($allspec, $spec268)+searchavailspec($allspec, $spec272))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;	
	
	
	case $type5752:
	break;
	
	case $type5901:
				if((searchavailspec($allspec, $spec700093)+searchavailspec($allspec, $spec700135)
					+searchavailspec($allspec, $spec800135)+searchavailspec($allspec, $spec93)+
				searchavailspec($allspec, $spec17700135))>=3){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
				else {
				echo "<font color=\"ff0000\">Не достаточно <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		
		case $type5903:
				if(searchavailspec($allspec, $spec250)>=3){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
				else {
				echo "<font color=\"ff0000\">Не достаточно специалистов, осуществляющих <b>обследование автомобильных дорог и мостовых сооружений</b></font>";
				}
		break;
		
		
        case $type5902:
				if((searchavailspec($allspec, $spec253)+searchavailspec($allspec, $spec254)
					+searchavailspec($allspec, $spec255)+searchavailspec($allspec, $spec256)+
				searchavailspec($allspec, $spec257)+searchavailspec($allspec, $spec258)
				+searchavailspec($allspec, $spec259))>=3){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
				else {
				echo "<font color=\"ff0000\">Не достаточно <b>аттестованных специалистов</b></font>";
				}
		break;		
	
	
	
	
		}
	
	
	} 
	break;
	}
	break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////CASE 4//////////////////////////////////////////////////////////////////////////////////
		
	case 4:
	if($vidyrabot1 < $outdate){
        for ($i = 0; $i <= count($types_of_jobs[$k]->field_field_vidyrab); $i++) 
		{ 
			$types_of_jobs2=$types_of_jobs[$k]->field_field_vidyrab[$i][raw];
			$types_of_jobs3=$types_of_jobs2[taxonomy_term]->name;
			$vidyrabot[$k][$i]=$types_of_jobs3;
			print_r ("</br>".$types_of_jobs3."</br>");
			
			
			
				switch ($types_of_jobs3) {
        
		
        case $type163:
		break;
		
		case $type164:
		if((searchavailspec($allspec, $spec700166)+searchavailspec($allspec, $spec166)+searchavailspec($allspec, $spec173))>=2){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-геодезические изыскания</b> меньше 2</font>";
				}
		break;
		
		case $type165:
			if((searchavailspec($allspec, $spec700167)+searchavailspec($allspec, $spec167)+searchavailspec($allspec, $spec174))>=2){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-геологические изыскания</b> меньше 2</font>";
				}
		break;
		
		case $type166:
			if((searchavailspec($allspec, $spec700168)+searchavailspec($allspec, $spec168))>=2){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-гидрометеорологические изыскания</b> меньше 2</font>";
				}
		break;
		
		case $type167:
			if((searchavailspec($allspec, $spec700169)+searchavailspec($allspec, $spec169))>=2){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-экологические изыскания</b> меньше 2</font>";
				}
		break;
		
		case $type168:
			if((searchavailspec($allspec, $spec700170)+searchavailspec($allspec, $spec170))>=2){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-геотехнические изыскания</b> меньше 2</font>";
				}
		break;
		
		case $type169:
			if((searchavailspec($allspec, $spec171)+searchavailspec($allspec, $spec171))>=2){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>обследование состояния грунтов оснований зданий и сооружений</b> меньше 2</font>";
				}
		break;
		
		case $type170:
			if((searchavailspec($allspec, $spec700064)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3))>=1 or (searchavailspec($allspec, $spec4)+searchavailspec($allspec, $spec148)+searchavailspec($allspec, $spec17700129)+searchavailspec($allspec, $spec129)+searchavailspec($allspec, $spec275))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного специалиста <b>ГАП</b> или <b>ГИП</b></font>";
				}
		break;
		
		case $type171:
			if(
			(searchavailspec($allspec, $spec700101)+
			 searchavailspec($allspec, $spec700102)+
			 searchavailspec($allspec, $spec700103)+
			 searchavailspec($allspec, $spec700104)+
			 searchavailspec($allspec, $spec700105)+
			 searchavailspec($allspec, $spec700106)+
			 searchavailspec($allspec, $spec700107)+
			 searchavailspec($allspec, $spec700108)+
			 searchavailspec($allspec, $spec700109)+
			 searchavailspec($allspec, $spec700162)+
			 searchavailspec($allspec, $spec17700101)+
			 searchavailspec($allspec, $spec17700102)+
			 searchavailspec($allspec, $spec17700103)+
			 searchavailspec($allspec, $spec17700104)+
			 searchavailspec($allspec, $spec17700105)+
			 searchavailspec($allspec, $spec17700106)+
			 searchavailspec($allspec, $spec17700107)+
			 searchavailspec($allspec, $spec17700108)+
			 searchavailspec($allspec, $spec17700109)+
			 searchavailspec($allspec, $spec138)+
			 searchavailspec($allspec, $spec137)+
			 searchavailspec($allspec, $spec162)+
			 searchavailspec($allspec, $spec101)+
			 searchavailspec($allspec, $spec102)+
			 searchavailspec($allspec, $spec103)+
			 searchavailspec($allspec, $spec104)+
			 searchavailspec($allspec, $spec105)+
			 searchavailspec($allspec, $spec106)+
			 searchavailspec($allspec, $spec107)+
			 searchavailspec($allspec, $spec108)+
			 searchavailspec($allspec, $spec109))<1) 
			 {
				echo "<font color=\"ff0000\">Нет ни одного аттестованного <b>начальника (заведующего) структурного подразделения</b></font>";
				}
			elseif	((searchavailspec($allspec, $spec700064)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3))<2 or (searchavailspec($allspec, $spec4)+searchavailspec($allspec, $spec148)+searchavailspec($allspec, $spec17700129)+searchavailspec($allspec, $spec129)+searchavailspec($allspec, $spec275))<2)
             {
				echo "<font color=\"ff0000\">Количество специалистов <b>ГАП</b> или <b>ГИП</b> меньше 2</font>";
				}
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
		break;
					
		case $type196:
		break;
		
		case $type197:
			if((searchavailspec($allspec, $spec700163)+searchavailspec($allspec, $spec163))>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (генеральный план)</b></font>";
				}
		break;
		
		case $type198:
			if((searchavailspec($allspec, $spec252)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3)+searchavailspec($allspec, $spec700064))>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (архитектурные решения)</b> либо <b>ГАПа</b></font>";
				}
		break;
		
		case $type199:
			if(searchavailspec($allspec, $spec139)>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (сметная документация)</b></font>";
				}
		break;
		
		case $type200:			
		if((searchavailspec($allspec, $spec66)+searchavailspec($allspec, $spec17700066)+searchavailspec($allspec, $spec700066))>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (конструктивные решения)</b></font>";
				}			
		break;
		
		case $type543:
		break;
		
		case $type5435:
			if((searchavailspec($allspec, $spec17700071)+searchavailspec($allspec, $spec700071)+searchavailspec($allspec, $spec71))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (холодоснабжение))</b></font>";
				}
		break;
		
		case $type5436:
			if((searchavailspec($allspec, $spec17700067)+searchavailspec($allspec, $spec700067)+searchavailspec($allspec, $spec67))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</b></font>";
				}
		break;
		
		case $type5438:
			if((searchavailspec($allspec, $spec17700067)+searchavailspec($allspec, $spec700067)+searchavailspec($allspec, $spec67))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</b></font>";
				}
		break;
		
		case $type5441:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</b></font>";
				}
		break;
		
		case $type5442:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</b></font>";
				}
		break;
		
		case $type5443:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</b></font>";
				}
		break;
		
		case $type5444:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;
		case $type5453:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;
		case $type5454:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;
		
		case $type5439:
			if((searchavailspec($allspec, $spec17700068)+searchavailspec($allspec, $spec700068)+searchavailspec($allspec, $spec68))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (отопление, вентиляция и кондиционирование воздуха))</b></font>";
				}
		break;
		
		case $type5440:
			if((searchavailspec($allspec, $spec17700068)+searchavailspec($allspec, $spec700068)+searchavailspec($allspec, $spec68))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (отопление, вентиляция и кондиционирование воздуха))</b></font>";
				}
		break;	
		
		
		case $type5437:
			if((searchavailspec($allspec, $spec17700069)+searchavailspec($allspec, $spec700069)+searchavailspec($allspec, $spec69))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</b></font>";
				}
		break;


		case $type5445: /*4.6. наружные сети и системы:*/
		break;
		
		case $type5446:
			if((searchavailspec($allspec, $spec17700070)+searchavailspec($allspec, $spec700070)+searchavailspec($allspec, $spec70))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (тепловые сети))</b></font>";
				}
		break;
		
		case $type5447:
			if((searchavailspec($allspec, $spec700067)+searchavailspec($allspec, $spec67))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</b></font>";
				}
		break;	
		
		case $type5449:
			if((searchavailspec($allspec, $spec700067)+searchavailspec($allspec, $spec67))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</b></font>";
				}
		break;	
		
		
		case $type5450:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</b></font>";
				}
		break;
		
		case $type5451:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;
		case $type5455:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;
		
		case $type5456:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;
		
		case $type5448:
			if((searchavailspec($allspec, $spec17700069)+searchavailspec($allspec, $spec700069)+searchavailspec($allspec, $spec69))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</b></font>";
				}
		break;

			
		case $type202: 
		break;
		
		
		case $type5457: /*4.8.:*/
		break;
		
		case $type5459:
				if(searchavailspec($allspec, $spec249)>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерно-технические мероприятия гражданской обороны. Мероприятия по предупреждению чрезвычайных ситуаций)</b></font>";
				}
		break;
		case $type5460:
				if(searchavailspec($allspec, $spec249)>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерно-технические мероприятия гражданской обороны. Мероприятия по предупреждению чрезвычайных ситуаций)</b></font>";
				}
		break;
		case $type5461:
				if(searchavailspec($allspec, $spec249)>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерно-технические мероприятия гражданской обороны. Мероприятия по предупреждению чрезвычайных ситуаций)</b></font>";
				}
		break;
		
		case $type5462:
			if((searchavailspec($allspec, $spec700164)+searchavailspec($allspec, $spec164))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (организация строительства)</b></font>";
				}
		break;
		
		case $type5458:
			if(searchavailspec($allspec, $spec248)>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (охрана окружающей среды)</b></font>";
				}
		break;		
		
		case $type205:/*5. Выполнение функций заказчика, застройщика, оказание инженерных услуг при осуществлении деятельности в области строительства объектов первого-четвертого классов сложности*/
		break;
		
		case $type206:
		break;
		
	
		case $type207:
				$count=0;
				$count=countoverzero(searchavailspec($allspec, $spec17700024),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700024),$count);
				$count=countoverzero(searchavailspec($allspec, $spec144),$count);
				$count=countoverzero(searchavailspec($allspec, $spec145),$count);
				$count=countoverzero(searchavailspec($allspec, $spec146),$count);
				$count=countoverzero(searchavailspec($allspec, $spec24),$count);				
				$count=countoverzero(searchavailspec($allspec, $spec17700026),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700026),$count);
				$count=countoverzero(searchavailspec($allspec, $spec26),$count);
				$count=countoverzero(searchavailspec($allspec, $spec277),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700095),$count);
				$count=countoverzero(searchavailspec($allspec, $spec95),$count);
				$count=countoverzero(searchavailspec($allspec, $spec57),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700057),$count);				
				$count=countoverzero(searchavailspec($allspec, $spec17700030),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700030),$count);
				$count=countoverzero(searchavailspec($allspec, $spec30),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec17700097),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700097),$count);
				$count=countoverzero(searchavailspec($allspec, $spec97),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec17700033),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700033),$count);
				$count=countoverzero(searchavailspec($allspec, $spec33),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec17700084),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700084),$count);
				$count=countoverzero(searchavailspec($allspec, $spec84),$count);				
				$count=countoverzero(searchavailspec($allspec, $spec17700085),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700085),$count);
				$count=countoverzero(searchavailspec($allspec, $spec85),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec34),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700034),$count);
				$count=countoverzero(searchavailspec($allspec, $spec113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec20113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec710113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec276),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700061),$count);
				$count=countoverzero(searchavailspec($allspec, $spec17700061),$count);
				$count=countoverzero(searchavailspec($allspec, $spec61),$count);
				
		if((searchavailspec($allspec, $spec40)+searchavailspec($allspec, $spec700187)+searchavailspec($allspec, $spec188)+searchavailspec($allspec, $spec189)+searchavailspec($allspec, $spec187))<1)
		{
				echo "<font color=\"ff0000\">Нет ни одного руководителя проекта</font>";
				}		
				
		elseif	($count<2)
				{
				echo "<font color=\"ff0000\">Количество специалистов по техническому надзору меньше 2</font>";
				}
					
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";		
				}
		break;
		
		case $type208:
		if((searchavailspec($allspec, $spec700024)+
		searchavailspec($allspec, $spec144)+
		searchavailspec($allspec, $spec145)+
		searchavailspec($allspec, $spec146)+
		searchavailspec($allspec, $spec24)+
		searchavailspec($allspec, $spec17700024))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (общестроительные работы)</b></font>";
				}
		break;
		
		case $type209:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec17700026))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</b></font>";
				}
		break;
		
		case $type210:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec17700026))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</b></font>";
				}
		break;
		
		case $type211:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec17700026)+
		searchavailspec($allspec, $spec95)+
		searchavailspec($allspec, $spec700095))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</b></font>";
				}
		break;
		
		case $type212:
		if((searchavailspec($allspec, $spec700057)+
		searchavailspec($allspec, $spec57))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области газоснабжения)</b></font>";
				}
		break;

		case $type213:
		if((searchavailspec($allspec, $spec700030)+
		searchavailspec($allspec, $spec30)+
		searchavailspec($allspec, $spec17700030))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области электроснабжения и автоматизации)</b></font>";
				}
		break;

				
		case $type214:
		if((searchavailspec($allspec, $spec700097)+
		searchavailspec($allspec, $spec97)+
		searchavailspec($allspec, $spec17700097))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области связи, сигнализации)</b></font>";
				}
		break;

		
		case $type215:
		if((searchavailspec($allspec, $spec700033)+
		searchavailspec($allspec, $spec33)+
		searchavailspec($allspec, $spec17700033))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (строительство автомобильных дорог и аэродромов, строительство мостов, транспортных эстакад и путепроводов)</b></font>";
				}
		break;

		case $type216:
		if((searchavailspec($allspec, $spec700084)+
		searchavailspec($allspec, $spec84)+
		searchavailspec($allspec, $spec17700084))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (строительство железных дорог)</b></font>";
				}
		break;

		case $type217:
		if((searchavailspec($allspec, $spec700085)+
		searchavailspec($allspec, $spec85)+
		searchavailspec($allspec, $spec17700085))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (строительство сооружений транспортных тоннелей, метрополитенов)</b></font>";
				}
		break;

		case $type218:
		if((searchavailspec($allspec, $spec700034)+
		searchavailspec($allspec, $spec34))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (гидротехническое и мелиоративное строительство)</b></font>";
				}
		break;

		case $type219:
		if((searchavailspec($allspec, $spec710113)+
		searchavailspec($allspec, $spec20113)+
		searchavailspec($allspec, $spec700113)+
		searchavailspec($allspec, $spec113))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (благоустройство территорий)</b></font>";
				}
		break;

		case $type220:
		if((searchavailspec($allspec, $spec700064)+
		searchavailspec($allspec, $spec3)+
		searchavailspec($allspec, $spec64))>=4 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов <b>ГАП</b> меньше 4</font>";
				}
		break;
		
		case $type221:
		break;
		
		case $type222:
		break;
		
		case $type223:
		break;
		
		case $type224:
		break;
		
		case $type225:
		break;
		
		case $type226:
		break;
		
		case $type227:
		if((searchavailspec($allspec, $spec71043)+
		searchavailspec($allspec, $spec71044)+
		searchavailspec($allspec, $spec71045)+
		searchavailspec($allspec, $spec71039)+
		searchavailspec($allspec, $spec71046)+
		searchavailspec($allspec, $spec71048)+
		searchavailspec($allspec, $spec71047)+
		searchavailspec($allspec, $spec71059)+
		searchavailspec($allspec, $spec71063)+
		searchavailspec($allspec, $spec71074)+
		searchavailspec($allspec, $spec700128)+
		searchavailspec($allspec, $spec700047)+
		searchavailspec($allspec, $spec710128)+
		searchavailspec($allspec, $spec700048)+
		searchavailspec($allspec, $spec700045)+
		searchavailspec($allspec, $spec700046)+
		searchavailspec($allspec, $spec700073)+
		searchavailspec($allspec, $spec700059)+
		searchavailspec($allspec, $spec700039)+
		searchavailspec($allspec, $spec700126)+
		searchavailspec($allspec, $spec700043)+
		searchavailspec($allspec, $spec700096)+
		searchavailspec($allspec, $spec700074)+
		searchavailspec($allspec, $spec700063)+
		searchavailspec($allspec, $spec700044)+
		searchavailspec($allspec, $spec150)+
		searchavailspec($allspec, $spec17700043)+
		searchavailspec($allspec, $spec17700044)+
		searchavailspec($allspec, $spec45)+
		searchavailspec($allspec, $spec39)+
		searchavailspec($allspec, $spec17700046)+
		searchavailspec($allspec, $spec17700048)+
		searchavailspec($allspec, $spec17700047)+
		searchavailspec($allspec, $spec17700059)+
		searchavailspec($allspec, $spec63)+
		searchavailspec($allspec, $spec73)+
		searchavailspec($allspec, $spec96)+
		searchavailspec($allspec, $spec17700074)+
		searchavailspec($allspec, $spec126)+
		searchavailspec($allspec, $spec128)+
		searchavailspec($allspec, $spec278)+
		searchavailspec($allspec, $spec43)+
		searchavailspec($allspec, $spec44)+
		searchavailspec($allspec, $spec46)+
		searchavailspec($allspec, $spec48)+
		searchavailspec($allspec, $spec47)+
		searchavailspec($allspec, $spec59)+
		searchavailspec($allspec, $spec74)+
		searchavailspec($allspec, $spec260)+
		searchavailspec($allspec, $spec261)+
		searchavailspec($allspec, $spec262)+
		searchavailspec($allspec, $spec263))<1)
		{
				echo "<font color=\"ff0000\">Нет ни одного <b>главного инженера</b></font>";
				}					
			
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";		
				}
		break;
		

		
			case $type228:
		break;
		
			
		case $type229:
				if((searchavailspec($allspec, $spec140)+searchavailspec($allspec, $spec142)+
				searchavailspec($allspec, $spec700140)+searchavailspec($allspec, $spec700142))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>главного или ведущего геодезиста</b></font>";
				}
		break;
		
		
		case $type230:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type231:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec15)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec16)+searchavailspec($allspec, $spec76)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec78)+
				searchavailspec($allspec, $spec79)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec81)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700216)+searchavailspec($allspec, $spec17700243)+
				searchavailspec($allspec, $spec17700245)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec245)+searchavailspec($allspec, $spec205)+
				searchavailspec($allspec, $spec231)+searchavailspec($allspec, $spec233)+
				searchavailspec($allspec, $spec234)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec215)+
				searchavailspec($allspec, $spec216)+searchavailspec($allspec, $spec243))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		
		case $type232:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec17700195)+searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec224)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700237)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type233:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		

		case $type234:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		
		case $type235:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type236:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec41)
					+searchavailspec($allspec, $spec82)+searchavailspec($allspec, $spec203)
				+searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)
				+searchavailspec($allspec, $spec224)+searchavailspec($allspec, $spec196)
				+searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec222)
				+searchavailspec($allspec, $spec17700203)+searchavailspec($allspec, $spec17700231)
				+searchavailspec($allspec, $spec231)+searchavailspec($allspec, $spec237)
				+searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223)
				+searchavailspec($allspec, $spec11))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		
		case $type237:
				if((searchavailspec($allspec, $spec11)+searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec0)+
				searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec16)+searchavailspec($allspec, $spec76)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec78)+
				searchavailspec($allspec, $spec79)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec81)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700205)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec226)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec206)+searchavailspec($allspec, $spec208)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec17700243)+
				searchavailspec($allspec, $spec17700245)+searchavailspec($allspec, $spec17700215)+
				searchavailspec($allspec, $spec17700216)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec203)+searchavailspec($allspec, $spec205)+
				searchavailspec($allspec, $spec231)+searchavailspec($allspec, $spec233)+
				searchavailspec($allspec, $spec234)+searchavailspec($allspec, $spec215)+
				searchavailspec($allspec, $spec216)+searchavailspec($allspec, $spec243)+
				searchavailspec($allspec, $spec245)+searchavailspec($allspec, $spec195))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		
		case $type238:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;			
		
		case $type239:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec196))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		
		case $type240:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec267)+searchavailspec($allspec, $spec271))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type241:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type242:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		
		case $type243:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		
		case $type244:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
				
		case $type245:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec76)+searchavailspec($allspec, $spec77)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec17700195)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700197)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec17700203)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec197)+searchavailspec($allspec, $spec225)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec205)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec233)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type246:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		
		case $type247:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		
		case $type248:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec110)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700211)+searchavailspec($allspec, $spec17700239)+
				searchavailspec($allspec, $spec211)+searchavailspec($allspec, $spec239)+				
				searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		
		case $type249:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		
		case $type250:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type251:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		


		case $type252:
				if((searchavailspec($allspec, $spec11)+searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec76)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec17700205)+searchavailspec($allspec, $spec17700231)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec212)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec205)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec235)+searchavailspec($allspec, $spec212))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;	


		case $type253:
				if((searchavailspec($allspec, $spec11)+searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec17700204)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700232)+
				searchavailspec($allspec, $spec212)+searchavailspec($allspec, $spec240)+
				searchavailspec($allspec, $spec204)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec232))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type254:
				if((searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec212)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec212)+searchavailspec($allspec, $spec240)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec234))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type255:
				if((searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec79)+searchavailspec($allspec, $spec212)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec207)+searchavailspec($allspec, $spec234))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		
		case $type256:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec17700216)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700245)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec245)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec216))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;

		case $type257:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec81)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700246)+
				searchavailspec($allspec, $spec17700217)+searchavailspec($allspec, $spec17700215)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec217)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec246))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type258:
		break;		
		
		case $type259:
				if((searchavailspec($allspec, $spec13)+searchavailspec($allspec, $spec193)+searchavailspec($allspec, $spec221))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type260:
				if((searchavailspec($allspec, $spec0)+searchavailspec($allspec, $spec16)+
				searchavailspec($allspec, $spec218)+searchavailspec($allspec, $spec244))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type261:
				if((searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec206)+searchavailspec($allspec, $spec207)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec234))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type262:
				if((searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type263:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type264:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type265:
				if((searchavailspec($allspec, $spec710112)+searchavailspec($allspec, $spec112)+
				searchavailspec($allspec, $spec20112)+searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec220))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;			
		
		case $type266:
				if((searchavailspec($allspec, $spec82)+searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec224))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;			
		
		case $type267:
				if((searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700237)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type268:
		break;		
		
		case $type269:
		break;		


		case $type270:
						if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)
					+searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		
		case $type271:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
	
case $type272:
				if((searchavailspec($allspec, $spec700093)+searchavailspec($allspec, $spec700135)
					+searchavailspec($allspec, $spec800135)+searchavailspec($allspec, $spec93)+
				searchavailspec($allspec, $spec17700135))>=2){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
				else {
				echo "<font color=\"ff0000\">Не достаточно <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		
		case $type273:
				if(searchavailspec($allspec, $spec250)>=2){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
				else {
				echo "<font color=\"ff0000\">Не достаточно специалистов, осуществляющих <b>обследование автомобильных дорог и мостовых сооружений</b></font>";
				}
		break;
		
		
        case $type274:
				if((searchavailspec($allspec, $spec253)+searchavailspec($allspec, $spec254)
					+searchavailspec($allspec, $spec255)+searchavailspec($allspec, $spec256)+
				searchavailspec($allspec, $spec257)+searchavailspec($allspec, $spec258)
				+searchavailspec($allspec, $spec259))>=2){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
				else {
				echo "<font color=\"ff0000\">Не достаточно <b>аттестованных специалистов</b></font>";
				}
		break;		
		}
			
			
		}	
			
		}
	else {
	        for ($i = 0; $i <= count($types_of_jobs[$k]->field_field_vidy_rabot_13_05_2017_); $i++) 
		{ 
			$types_of_jobs2=$types_of_jobs[$k]->field_field_vidy_rabot_13_05_2017_[$i][raw];
			$types_of_jobs3=$types_of_jobs2[taxonomy_term]->name;
			$vidyrabot[$k][$i]=$types_of_jobs3;
			print_r ("</br>".$types_of_jobs3."</br>");
			
			
			
				switch ($types_of_jobs3) {
		case $type5594:
		break;
		
		case $type5595:
		if((searchavailspec($allspec, $spec700166)+searchavailspec($allspec, $spec166)+searchavailspec($allspec, $spec173))>=2){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-геодезические изыскания</b> меньше 2</font>";
				}
		break;
	
		case $type5616:
			if((searchavailspec($allspec, $spec700167)+searchavailspec($allspec, $spec167)+searchavailspec($allspec, $spec174))>=2){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-геологические изыскания</b> меньше 2</font>";
				}
		break;
	
		case $type5625:
			if((searchavailspec($allspec, $spec700168)+searchavailspec($allspec, $spec168))>=2){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-гидрометеорологические изыскания</b> меньше 2</font>";
				}
		break;	
	
		case $type5630:
			if((searchavailspec($allspec, $spec700169)+searchavailspec($allspec, $spec169))>=2){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-экологические изыскания</b> меньше 2</font>";
				}
		break;
	
		case $type5647:
			if((searchavailspec($allspec, $spec700170)+searchavailspec($allspec, $spec170))>=2){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>инженерно-геотехнические изыскания</b> меньше 2</font>";
				}
		break;
		
		       case $type5648:
	   break;
	   case $type5649:
	   break;
	   case $type5650:
	   break;
	   case $type5651:
	   break;
	   case $type5652:
	   break;
	   case $type5653:
	   break;
		
	
		case $type5654:
			if((searchavailspec($allspec, $spec171)+searchavailspec($allspec, $spec171))>=2){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов, осуществляющих <b>обследование состояния грунтов оснований зданий и сооружений</b> меньше 2</font>";
				}
		break;
		
	
		case $type5655:
			if((searchavailspec($allspec, $spec700064)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3))>=1 or (searchavailspec($allspec, $spec4)+searchavailspec($allspec, $spec148)+searchavailspec($allspec, $spec17700129)+searchavailspec($allspec, $spec129)+searchavailspec($allspec, $spec275))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного специалиста <b>ГАП</b> или <b>ГИП</b></font>";
				}
		break;
		
				
		case $type5656:
			if(
			(searchavailspec($allspec, $spec700101)+
			 searchavailspec($allspec, $spec700102)+
			 searchavailspec($allspec, $spec700103)+
			 searchavailspec($allspec, $spec700104)+
			 searchavailspec($allspec, $spec700105)+
			 searchavailspec($allspec, $spec700106)+
			 searchavailspec($allspec, $spec700107)+
			 searchavailspec($allspec, $spec700108)+
			 searchavailspec($allspec, $spec700109)+
			 searchavailspec($allspec, $spec700162)+
			 searchavailspec($allspec, $spec17700101)+
			 searchavailspec($allspec, $spec17700102)+
			 searchavailspec($allspec, $spec17700103)+
			 searchavailspec($allspec, $spec17700104)+
			 searchavailspec($allspec, $spec17700105)+
			 searchavailspec($allspec, $spec17700106)+
			 searchavailspec($allspec, $spec17700107)+
			 searchavailspec($allspec, $spec17700108)+
			 searchavailspec($allspec, $spec17700109)+
			 searchavailspec($allspec, $spec138)+
			 searchavailspec($allspec, $spec137)+
			 searchavailspec($allspec, $spec162)+
			 searchavailspec($allspec, $spec101)+
			 searchavailspec($allspec, $spec102)+
			 searchavailspec($allspec, $spec103)+
			 searchavailspec($allspec, $spec104)+
			 searchavailspec($allspec, $spec105)+
			 searchavailspec($allspec, $spec106)+
			 searchavailspec($allspec, $spec107)+
			 searchavailspec($allspec, $spec108)+
			 searchavailspec($allspec, $spec109))<1) 
			 {
				echo "<font color=\"ff0000\">Нет ни одного аттестованного <b>начальника (заведующего) структурного подразделения</b></font>";
				}
			elseif	((searchavailspec($allspec, $spec700064)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3))<2 or (searchavailspec($allspec, $spec4)+searchavailspec($allspec, $spec148)+searchavailspec($allspec, $spec17700129)+searchavailspec($allspec, $spec129)+searchavailspec($allspec, $spec275))<2)
             {
				echo "<font color=\"ff0000\">Количество специалистов <b>ГАП</b> или <b>ГИП</b> меньше 2</font>";
				}
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
		break;
		
		case $type5658:
			if((searchavailspec($allspec, $spec700163)+searchavailspec($allspec, $spec163))>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (генеральный план)</b></font>";
				}
		break;		
			
		case $type5659:
			if((searchavailspec($allspec, $spec252)+searchavailspec($allspec, $spec64)+searchavailspec($allspec, $spec3)+searchavailspec($allspec, $spec700064))>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (архитектурные решения)</b> либо <b>ГАПа</b></font>";
				}
		break;		
				
		case $type5660:
			if(searchavailspec($allspec, $spec139)>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (сметная документация)</b></font>";
				}
		break;		
		
		case $type5661:
		if((searchavailspec($allspec, $spec66)+searchavailspec($allspec, $spec17700066)+searchavailspec($allspec, $spec700066))>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (конструктивные решения)</b></font>";
				}			
		break;		
		
		case $type5662:
		break;
		
		case $type5664:
			if((searchavailspec($allspec, $spec17700071)+searchavailspec($allspec, $spec700071)+searchavailspec($allspec, $spec71))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (холодоснабжение))</b></font>";
				}
		break;		
				
		case type5665:
			if((searchavailspec($allspec, $spec17700067)+searchavailspec($allspec, $spec700067)+searchavailspec($allspec, $spec67))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</b></font>";
				}
		break;		
		
		case $type5666:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</b></font>";
				}
		break;
				
		case $type5667:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;		
		
		case $type5663:
			if((searchavailspec($allspec, $spec17700068)+searchavailspec($allspec, $spec700068)+searchavailspec($allspec, $spec68))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (отопление, вентиляция и кондиционирование воздуха))</b></font>";
				}
		break;		
				
		case $type5669:
			if((searchavailspec($allspec, $spec17700069)+searchavailspec($allspec, $spec700069)+searchavailspec($allspec, $spec69))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</b></font>";
				}
		break;
		
		case $type5670:
		break;
		
		case $type5671:
			if((searchavailspec($allspec, $spec17700070)+searchavailspec($allspec, $spec700070)+searchavailspec($allspec, $spec70))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (тепловые сети))</b></font>";
				}
		break;		
			
		case $type5672:
			if((searchavailspec($allspec, $spec700067)+searchavailspec($allspec, $spec67))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (водоснабжение и канализация))</b></font>";
				}
		break;		
		
		case $type5673:
			if((searchavailspec($allspec, $spec17700072)+searchavailspec($allspec, $spec700072)+searchavailspec($allspec, $spec72))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (электроснабжение, силовое электрооборудование и электроосвещение))</b></font>";
				}
		break;		
		
		case $type5674:
			if((searchavailspec($allspec, $spec17700098)+searchavailspec($allspec, $spec700098)+searchavailspec($allspec, $spec98))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (связь и сигнализация))</b></font>";
				}
		break;
		
		case $type5675:
			if((searchavailspec($allspec, $spec17700069)+searchavailspec($allspec, $spec700069)+searchavailspec($allspec, $spec69))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (инженерное оборудование, сети и системы (система газоснабжения))</b></font>";
				}
		break;		
			
		case $type5676: 
		break;
		
		case $type5678:
			if((searchavailspec($allspec, $spec700164)+searchavailspec($allspec, $spec164))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (организация строительства)</b></font>";
				}
		break;		
		
		case $type5679:
			if(searchavailspec($allspec, $spec248)>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного главного специалиста, осуществляющего <b>разработку раздела проектной документации (охрана окружающей среды)</b></font>";
				}
		break;
		
		case $type5680:
		break;
		
		case $type5681:
		break;
		
		case $type5682:
				$count=0;
				$count=countoverzero(searchavailspec($allspec, $spec17700024),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700024),$count);
				$count=countoverzero(searchavailspec($allspec, $spec144),$count);
				$count=countoverzero(searchavailspec($allspec, $spec145),$count);
				$count=countoverzero(searchavailspec($allspec, $spec146),$count);
				$count=countoverzero(searchavailspec($allspec, $spec24),$count);				
				$count=countoverzero(searchavailspec($allspec, $spec17700026),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700026),$count);
				$count=countoverzero(searchavailspec($allspec, $spec26),$count);
				$count=countoverzero(searchavailspec($allspec, $spec277),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700095),$count);
				$count=countoverzero(searchavailspec($allspec, $spec95),$count);
				$count=countoverzero(searchavailspec($allspec, $spec57),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700057),$count);				
				$count=countoverzero(searchavailspec($allspec, $spec17700030),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700030),$count);
				$count=countoverzero(searchavailspec($allspec, $spec30),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec17700097),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700097),$count);
				$count=countoverzero(searchavailspec($allspec, $spec97),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec17700033),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700033),$count);
				$count=countoverzero(searchavailspec($allspec, $spec33),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec17700084),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700084),$count);
				$count=countoverzero(searchavailspec($allspec, $spec84),$count);				
				$count=countoverzero(searchavailspec($allspec, $spec17700085),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700085),$count);
				$count=countoverzero(searchavailspec($allspec, $spec85),$count);								
				$count=countoverzero(searchavailspec($allspec, $spec34),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700034),$count);
				$count=countoverzero(searchavailspec($allspec, $spec113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec20113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec710113),$count);
				$count=countoverzero(searchavailspec($allspec, $spec276),$count);
				$count=countoverzero(searchavailspec($allspec, $spec700061),$count);
				$count=countoverzero(searchavailspec($allspec, $spec17700061),$count);
				$count=countoverzero(searchavailspec($allspec, $spec61),$count);
				
		if((searchavailspec($allspec, $spec40)+searchavailspec($allspec, $spec700187)+searchavailspec($allspec, $spec188)+searchavailspec($allspec, $spec189)+searchavailspec($allspec, $spec187))<1)
		{
				echo "<font color=\"ff0000\">Нет ни одного руководителя проекта</font>";
				}		
				
		elseif	($count<2)
				{
				echo "<font color=\"ff0000\">Количество специалистов по техническому надзору меньше 2</font>";
				}
					
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";		
				}
		break;
		
		case $type5683:
		if((searchavailspec($allspec, $spec700024)+
		searchavailspec($allspec, $spec144)+
		searchavailspec($allspec, $spec145)+
		searchavailspec($allspec, $spec146)+
		searchavailspec($allspec, $spec24)+
		searchavailspec($allspec, $spec17700024))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (общестроительные работы)</b></font>";
				}
		break;		
		
		case $type5684:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec17700026))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</b></font>";
				}
		break;		
		
		case $type5685:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec17700026))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</b></font>";
				}
		break;		
		
		case $type5686:
		if(
		searchavailspec($allspec, $spec277)>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (устройство систем холодоснабжения)</b></font>";
				}
		break;			
		
		case $type5687:
		if((searchavailspec($allspec, $spec700026)+
		searchavailspec($allspec, $spec26)+
		searchavailspec($allspec, $spec17700026)+
		searchavailspec($allspec, $spec95)+
		searchavailspec($allspec, $spec700095))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области теплоснабжения, водоснабжения и канализации, устройства систем вентиляции, кондиционирования воздуха)</b></font>";
				}
		break;		
		
		case $type5688:
		if((searchavailspec($allspec, $spec700057)+
		searchavailspec($allspec, $spec57))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области газоснабжения)</b></font>";
				}
		break;
		
		case $type5689:
		if((searchavailspec($allspec, $spec700030)+
		searchavailspec($allspec, $spec30)+
		searchavailspec($allspec, $spec17700030))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области электроснабжения и автоматизации)</b></font>";
				}
		break;	
				
		case $type5690:
		if((searchavailspec($allspec, $spec700097)+
		searchavailspec($allspec, $spec97)+
		searchavailspec($allspec, $spec17700097))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (работы в области связи, сигнализации)</b></font>";
				}
		break;	
		
		case $type5691:
		if((searchavailspec($allspec, $spec700033)+
		searchavailspec($allspec, $spec33)+
		searchavailspec($allspec, $spec17700033))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (строительство автомобильных дорог и аэродромов, строительство мостов, транспортных эстакад и путепроводов)</b></font>";
				}
		break;		
		
		case $type5692:
		if((searchavailspec($allspec, $spec700084)+
		searchavailspec($allspec, $spec84)+
		searchavailspec($allspec, $spec17700084))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (строительство железных дорог)</b></font>";
				}
		break;		
		
		case $type5693:
		if((searchavailspec($allspec, $spec700085)+
		searchavailspec($allspec, $spec85)+
		searchavailspec($allspec, $spec17700085))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (строительство сооружений транспортных тоннелей, метрополитенов)</b></font>";
				}
		break;	
		
		case $type5694:
		if((searchavailspec($allspec, $spec700034)+
		searchavailspec($allspec, $spec34))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (гидротехническое и мелиоративное строительство)</b></font>";
				}
		break;	
		
		case $type5695:
		if((searchavailspec($allspec, $spec710113)+
		searchavailspec($allspec, $spec20113)+
		searchavailspec($allspec, $spec700113)+
		searchavailspec($allspec, $spec113))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (благоустройство территорий)</b></font>";
				}
		break;		
		
		
		case $type5696:
		if(searchavailspec($allspec, $spec276)>0){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (монтаж технологических трубопроводов и оборудования)</b></font>";
				}
		break;		

		case $type5697:
		if((searchavailspec($allspec, $spec700061)+
		searchavailspec($allspec, $spec17700061)+
		searchavailspec($allspec, $spec61))>0 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>инженера по техническому надзору за строительством (устройство магистральных трубопроводов для транспортирования нефти, газа, нефтепродуктов)</b></font>";
				}
		break;
		
		case $type5698:
		if((searchavailspec($allspec, $spec700064)+
		searchavailspec($allspec, $spec3)+
		searchavailspec($allspec, $spec64))>=4 ){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Количество специалистов <b>ГАП</b> меньше 4</font>";
				}
		break;		
		
		case $type5699:
		break;		
		
		case $type5700:
		break;	
		
		case $type5701:
		break;
		
		case $type5702:
		break;
		
		case $type5703:
		break;
		
		case $type5704:
		break;
		
		case $type5705:
		break;
		
		case $type5706:
		if((searchavailspec($allspec, $spec71043)+
		searchavailspec($allspec, $spec71044)+
		searchavailspec($allspec, $spec71045)+
		searchavailspec($allspec, $spec71039)+
		searchavailspec($allspec, $spec71046)+
		searchavailspec($allspec, $spec71048)+
		searchavailspec($allspec, $spec71047)+
		searchavailspec($allspec, $spec71059)+
		searchavailspec($allspec, $spec71063)+
		searchavailspec($allspec, $spec71074)+
		searchavailspec($allspec, $spec700128)+
		searchavailspec($allspec, $spec700047)+
		searchavailspec($allspec, $spec710128)+
		searchavailspec($allspec, $spec700048)+
		searchavailspec($allspec, $spec700045)+
		searchavailspec($allspec, $spec700046)+
		searchavailspec($allspec, $spec700073)+
		searchavailspec($allspec, $spec700059)+
		searchavailspec($allspec, $spec700039)+
		searchavailspec($allspec, $spec700126)+
		searchavailspec($allspec, $spec700043)+
		searchavailspec($allspec, $spec700096)+
		searchavailspec($allspec, $spec700074)+
		searchavailspec($allspec, $spec700063)+
		searchavailspec($allspec, $spec700044)+
		searchavailspec($allspec, $spec150)+
		searchavailspec($allspec, $spec17700043)+
		searchavailspec($allspec, $spec17700044)+
		searchavailspec($allspec, $spec45)+
		searchavailspec($allspec, $spec39)+
		searchavailspec($allspec, $spec17700046)+
		searchavailspec($allspec, $spec17700048)+
		searchavailspec($allspec, $spec17700047)+
		searchavailspec($allspec, $spec17700059)+
		searchavailspec($allspec, $spec63)+
		searchavailspec($allspec, $spec73)+
		searchavailspec($allspec, $spec96)+
		searchavailspec($allspec, $spec17700074)+
		searchavailspec($allspec, $spec126)+
		searchavailspec($allspec, $spec128)+
		searchavailspec($allspec, $spec278)+
		searchavailspec($allspec, $spec43)+
		searchavailspec($allspec, $spec44)+
		searchavailspec($allspec, $spec46)+
		searchavailspec($allspec, $spec48)+
		searchavailspec($allspec, $spec47)+
		searchavailspec($allspec, $spec59)+
		searchavailspec($allspec, $spec74)+
		searchavailspec($allspec, $spec260)+
		searchavailspec($allspec, $spec261)+
		searchavailspec($allspec, $spec262)+
		searchavailspec($allspec, $spec263))<1)
		{
				echo "<font color=\"ff0000\">Нет ни одного <b>главного инженера</b></font>";
				}					
			
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";		
				}
		break;		
		
		case $type5707:
		if((searchavailspec($allspec, $spec71043)+
		searchavailspec($allspec, $spec71044)+
		searchavailspec($allspec, $spec71045)+
		searchavailspec($allspec, $spec71039)+
		searchavailspec($allspec, $spec71046)+
		searchavailspec($allspec, $spec71048)+
		searchavailspec($allspec, $spec71047)+
		searchavailspec($allspec, $spec71059)+
		searchavailspec($allspec, $spec71063)+
		searchavailspec($allspec, $spec71074)+
		searchavailspec($allspec, $spec700128)+
		searchavailspec($allspec, $spec700047)+
		searchavailspec($allspec, $spec710128)+
		searchavailspec($allspec, $spec700048)+
		searchavailspec($allspec, $spec700045)+
		searchavailspec($allspec, $spec700046)+
		searchavailspec($allspec, $spec700073)+
		searchavailspec($allspec, $spec700059)+
		searchavailspec($allspec, $spec700039)+
		searchavailspec($allspec, $spec700126)+
		searchavailspec($allspec, $spec700043)+
		searchavailspec($allspec, $spec700096)+
		searchavailspec($allspec, $spec700074)+
		searchavailspec($allspec, $spec700063)+
		searchavailspec($allspec, $spec700044)+
		searchavailspec($allspec, $spec150)+
		searchavailspec($allspec, $spec17700043)+
		searchavailspec($allspec, $spec17700044)+
		searchavailspec($allspec, $spec45)+
		searchavailspec($allspec, $spec39)+
		searchavailspec($allspec, $spec17700046)+
		searchavailspec($allspec, $spec17700048)+
		searchavailspec($allspec, $spec17700047)+
		searchavailspec($allspec, $spec17700059)+
		searchavailspec($allspec, $spec63)+
		searchavailspec($allspec, $spec73)+
		searchavailspec($allspec, $spec96)+
		searchavailspec($allspec, $spec17700074)+
		searchavailspec($allspec, $spec126)+
		searchavailspec($allspec, $spec128)+
		searchavailspec($allspec, $spec278)+
		searchavailspec($allspec, $spec43)+
		searchavailspec($allspec, $spec44)+
		searchavailspec($allspec, $spec46)+
		searchavailspec($allspec, $spec48)+
		searchavailspec($allspec, $spec47)+
		searchavailspec($allspec, $spec59)+
		searchavailspec($allspec, $spec74)+
		searchavailspec($allspec, $spec260)+
		searchavailspec($allspec, $spec261)+
		searchavailspec($allspec, $spec262)+
		searchavailspec($allspec, $spec263))<1)
		{
				echo "<font color=\"ff0000\">Нет ни одного <b>главного инженера</b></font>";
				}					
			
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";		
				}
		break;
		

		case $type5708:
		break;
			
		case $type5709:
				if((searchavailspec($allspec, $spec140)+searchavailspec($allspec, $spec142)+
				searchavailspec($allspec, $spec700140)+searchavailspec($allspec, $spec700142))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет ни одного <b>главного или ведущего геодезиста</b></font>";
				}
		break;		
		
		
		case $type5710:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		
		case $type5711:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec15)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec16)+searchavailspec($allspec, $spec76)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec78)+
				searchavailspec($allspec, $spec79)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec81)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700216)+searchavailspec($allspec, $spec17700243)+
				searchavailspec($allspec, $spec17700245)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec245)+searchavailspec($allspec, $spec205)+
				searchavailspec($allspec, $spec231)+searchavailspec($allspec, $spec233)+
				searchavailspec($allspec, $spec234)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec215)+
				searchavailspec($allspec, $spec216)+searchavailspec($allspec, $spec243))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5712:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec17700195)+searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec224)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec17700237)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5713:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;

		case $type5714:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5715:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5716:
				if((searchavailspec($allspec, $spec270)+searchavailspec($allspec, $spec274))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5717:
				if((searchavailspec($allspec, $spec11)+searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec0)+
				searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec16)+searchavailspec($allspec, $spec76)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec78)+
				searchavailspec($allspec, $spec79)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec81)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700205)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec226)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec206)+searchavailspec($allspec, $spec208)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec17700243)+
				searchavailspec($allspec, $spec17700245)+searchavailspec($allspec, $spec17700215)+
				searchavailspec($allspec, $spec17700216)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec203)+searchavailspec($allspec, $spec205)+
				searchavailspec($allspec, $spec231)+searchavailspec($allspec, $spec233)+
				searchavailspec($allspec, $spec234)+searchavailspec($allspec, $spec215)+
				searchavailspec($allspec, $spec216)+searchavailspec($allspec, $spec243)+
				searchavailspec($allspec, $spec245)+searchavailspec($allspec, $spec195))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $typetype5718:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5719:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec226)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec223)+
				searchavailspec($allspec, $spec237)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec198)+searchavailspec($allspec, $spec196))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5720:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec267)+searchavailspec($allspec, $spec271))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5721:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5722:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5723:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)+
				searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;			
		
		case $type5724:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec18)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec196)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
				
		case $type5725:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec19)+
				searchavailspec($allspec, $spec41)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec60)+searchavailspec($allspec, $spec82)+
				searchavailspec($allspec, $spec76)+searchavailspec($allspec, $spec77)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec83)+searchavailspec($allspec, $spec194)+
				searchavailspec($allspec, $spec17700195)+searchavailspec($allspec, $spec17700223)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec224)+
				searchavailspec($allspec, $spec17700197)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226)+searchavailspec($allspec, $spec222)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec17700203)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700205)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec236)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec197)+searchavailspec($allspec, $spec225)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec205)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec233)+searchavailspec($allspec, $spec234)+
				searchavailspec($allspec, $spec209)+searchavailspec($allspec, $spec237)+
				searchavailspec($allspec, $spec195)+searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		
		case $type5726:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec58)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec210)+searchavailspec($allspec, $spec238)+
				searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5727:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec199)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;			
		
		case $type5728:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec110)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700211)+searchavailspec($allspec, $spec17700239)+
				searchavailspec($allspec, $spec211)+searchavailspec($allspec, $spec239)+				
				searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;			
		
		case $type5729:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type5730:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;			
		
		case $type5731:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec127)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700200)+searchavailspec($allspec, $spec228)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec200))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5732:
				if((searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec76)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec17700205)+searchavailspec($allspec, $spec17700231)+
				searchavailspec($allspec, $spec17700233)+searchavailspec($allspec, $spec212)+
				searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec205)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec235))>=1){
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
				
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))>=1)	
			{
				echo "<font color=\"ff0000\">Нет обязательных<b>аттестованных специалистов</b></font>";
				}	
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
		break;

		case $type5733:
				if((searchavailspec($allspec, $spec11)+
				searchavailspec($allspec, $spec77)+searchavailspec($allspec, $spec17700203)+
				searchavailspec($allspec, $spec17700204)+searchavailspec($allspec, $spec203)+
				searchavailspec($allspec, $spec17700231)+searchavailspec($allspec, $spec17700232)+
				searchavailspec($allspec, $spec204)+searchavailspec($allspec, $spec231)+
				searchavailspec($allspec, $spec232))>=1){
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))>=1)	
			{
				echo "<font color=\"ff0000\">Нет обязательных<b>аттестованных специалистов</b></font>";
				}	
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
		break;
		
		case $type5734:
				if((searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec78)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec208)+searchavailspec($allspec, $spec17700234)+
				searchavailspec($allspec, $spec236)+searchavailspec($allspec, $spec234))>=1){
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))>=1)	
			{
				echo "<font color=\"ff0000\">Нет обязательных<b>аттестованных специалистов</b></font>";
				}	
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
		break;			

		case $type5735:
				if((searchavailspec($allspec, $spec12)+
				searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec206)+
				searchavailspec($allspec, $spec207)+searchavailspec($allspec, $spec234))>=1){
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
			else if ((searchavailspec($allspec, $spec62)+
				searchavailspec($allspec, $spec240)+searchavailspec($allspec, $spec212))>=1)	
			{
				echo "<font color=\"ff0000\">Нет обязательных<b>аттестованных специалистов</b></font>";
				}	
			else {
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
		break;		
		
		case $type5736:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec80)+
				searchavailspec($allspec, $spec17700215)+searchavailspec($allspec, $spec17700216)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700245)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec245)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec216))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5737:
				if((searchavailspec($allspec, $spec15)+searchavailspec($allspec, $spec81)+
				searchavailspec($allspec, $spec17700243)+searchavailspec($allspec, $spec17700246)+
				searchavailspec($allspec, $spec17700217)+searchavailspec($allspec, $spec17700215)+
				searchavailspec($allspec, $spec215)+searchavailspec($allspec, $spec217)+
				searchavailspec($allspec, $spec243)+searchavailspec($allspec, $spec246))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5738:
				if((searchavailspec($allspec, $spec13)+searchavailspec($allspec, $spec193)+
				searchavailspec($allspec, $spec221))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type5739:
				if((searchavailspec($allspec, $spec0)+searchavailspec($allspec, $spec16)+
				searchavailspec($allspec, $spec218)+searchavailspec($allspec, $spec244))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;	
		

		case $type5740:
				if((searchavailspec($allspec, $spec12)+searchavailspec($allspec, $spec79)+
				searchavailspec($allspec, $spec206)+searchavailspec($allspec, $spec207)+
				searchavailspec($allspec, $spec17700234)+searchavailspec($allspec, $spec235)+
				searchavailspec($allspec, $spec222)+searchavailspec($allspec, $spec234))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5741:
				if((searchavailspec($allspec, $spec19)+searchavailspec($allspec, $spec41)+
				searchavailspec($allspec, $spec194)+searchavailspec($allspec, $spec198)+
				searchavailspec($allspec, $spec226))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5742:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5743:
				if((searchavailspec($allspec, $spec18)+searchavailspec($allspec, $spec17700195)+
				searchavailspec($allspec, $spec17700223)+searchavailspec($allspec, $spec195)+
				searchavailspec($allspec, $spec223))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		case $type5744:
				if((searchavailspec($allspec, $spec710112)+searchavailspec($allspec, $spec112)+
				searchavailspec($allspec, $spec20112)+searchavailspec($allspec, $spec192)+
				searchavailspec($allspec, $spec220))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5745:
				if((searchavailspec($allspec, $spec82)+searchavailspec($allspec, $spec196)+
				searchavailspec($allspec, $spec224))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
				
		case $type5746:
				if((searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700237)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5747:	
				if((searchavailspec($allspec, $spec269)+searchavailspec($allspec, $spec273))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type5748:	
				if((searchavailspec($allspec, $spec17)+searchavailspec($allspec, $spec214)
					+searchavailspec($allspec, $spec242))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5749:
						if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec17700199)
					+searchavailspec($allspec, $spec227)+searchavailspec($allspec, $spec199))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;
		
		case $type5750:
				if((searchavailspec($allspec, $spec9)+searchavailspec($allspec, $spec83)+
				searchavailspec($allspec, $spec17700199)+searchavailspec($allspec, $spec227)+
				searchavailspec($allspec, $spec17700209)+searchavailspec($allspec, $spec17700237)+
				searchavailspec($allspec, $spec199)+searchavailspec($allspec, $spec209)+
				searchavailspec($allspec, $spec237))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;		

		case $type5751:
				if((searchavailspec($allspec, $spec268)+searchavailspec($allspec, $spec272))>=1){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
			else {
				echo "<font color=\"ff0000\">Нет <b>аттестованных специалистов</b></font>";
				}
		break;	
		
		case $type5752:
		break;
		
		case $type5901:
				if((searchavailspec($allspec, $spec700093)+searchavailspec($allspec, $spec700135)
					+searchavailspec($allspec, $spec800135)+searchavailspec($allspec, $spec93)+
				searchavailspec($allspec, $spec17700135))>=2){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
				else {
				echo "<font color=\"ff0000\">Не достаточно <b>аттестованных специалистов</b></font>";
				}
		break;		
		
		
		case $type5903:
				if(searchavailspec($allspec, $spec250)>=2){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
				else {
				echo "<font color=\"ff0000\">Не достаточно специалистов, осуществляющих <b>обследование автомобильных дорог и мостовых сооружений</b></font>";
				}
		break;
		
		
        case $type5902:
				if((searchavailspec($allspec, $spec253)+searchavailspec($allspec, $spec254)
					+searchavailspec($allspec, $spec255)+searchavailspec($allspec, $spec256)+
				searchavailspec($allspec, $spec257)+searchavailspec($allspec, $spec258)
				+searchavailspec($allspec, $spec259))>=2){
			echo "<font color=\"7CFC00\">СООТВЕТСТВУЕТ</font>";
				}
				else {
				echo "<font color=\"ff0000\">Не достаточно <b>аттестованных специалистов</b></font>";
				}
		break;		
	
	
		}
			
		} 
}		
    break;
}print_r ("<hr>");
} 
?>